# Main resource bundle for APM BusinessObject exceptions, status messages, and log messages

#PromoDFUCollector
PromoDFUCollector.DuplicatePromoPriceStrategy=Ya existe una estrategia de precios en este nivel de jerarqu\u00eda.
PromoDFUCollector.MissingPromoPriceStrategy=La estrategia de precios no existe en este nivel de jerarqu\u00eda.
PromoDFUCollector.ConflictWhenAddingProduct=Uno o m\u00e1s productos de los que se van a agregar ya existe.
PromoDFUCollector.NoProductsFound=La b\u00fasqueda no dio resultados de ning\u00fan producto.
PromoDFUCollector.AssocToActivityResultsInNoProds=Las ubicaciones en la actividad seleccionada no coinciden con ninguno de los criterios de b\u00fasqueda originales.  Como resultado, se eliminaron todos los productos de la oferta.
PromoDFUCollector.FilterContainsOR=La configuraci\u00f3n de seguridad de datos no se estableci\u00f3 correctamente. Contacte al administrador de sistemas.
PromoDFUCollector.FilterContainsUnsupportedTables=La configuraci\u00f3n de seguridad de datos no se estableci\u00f3 correctamente. Contacte al administrador de sistemas.

# State
APMStateControl.InvalidTransitionForDate=La fecha de inicio de oferta promocional debe ser mayor o igual a la fecha de hoy.

#PromoAnalysisParams
PromoAnalysisParams.DefaultForecastName=Previsi\u00f3n

#Exceptions
APM.Exception.AllocationCalendarNotFound=No se encuentra el calendario de asignaci\u00f3n {0}.
APM.Exception.CriteriaNotAvailable=Los siguientes criterios de b\u00fasqueda no se encuentran en la cach\u00e9 del cliente: {0}
APM.Exception.UnexpectedCriteriaFinderOperation=PromoDFUCriteriaFinder fue llamado inesperadamente para un contexto de la consulta o el contexto de la b\u00fasqueda. 
PromotionsManagement.Exception.RefreshAggregateAttributeFailed=Error al actualizar el atributo agregado {0}.
PromotionsManagement.Exception.TotalNodeValueApplication=Error al actualizar el atributo de nodo total {0}.
PromotionsManagement.Exception.retrievePriceZoneListForActivity=Error al recuperar zonas de precio para la actividad asociada.
PromotionsManagement.Exception.RefreshSaveStoriesFailed=Error al actualizaci\u00f3n las  historias guardadas.
PromotionsManagement.Exception.RefreshExclusionsFailed=Error al actualizar las exclusiones.
PromotionsManagement.Exception.HistoryDataLoadFailed=Error al cargar los datos del historial.
PromotionsManagement.Exception.reloadDFUs=Error al recargar las UPD promocionales.
PromotionsManagement.Exception.RefreshFcstDataFailed=Error al actualizar la previsi\u00f3n para las UPD promocionales.
PromotionsManagement.Exception.UnsupportedMIDataType=No se admite el tipo de datos {0} como atributo de instrumento de marketing.
PromotionsManagement.Exception.OptimizationFailed=Se produjo un error durante la optimizaci\u00f3n. Contacte al administrador de sistemas.
PromotionsManagement.Exception.ExportFailed=Se produjo un error durante la exportaci\u00f3n. Contacte al administrador de sistemas.
PromotionsManagement.Exception.CrossImpactsNotSupported=No se pudo conciliar los impactos cruzados de productos en los niveles de la jerarqu\u00eda.  Cada nivel de la jerarqu\u00eda se puede optimizar de forma independiente.
PromotionsManagement.Exception.UserInformationNotAvailable=La informaci\u00f3n de usuario para el usuario {0} no se pudo recuperar. 

PromotionsManagement.Exception.CollectorServiceNotAvailable=El sistema no puede procesar su solicitud porque no se ha iniciado el proceso de Promotions Management Collector SRE. P\u00f3ngase en contacto con el administrador del sistema.
PromotionsManagement.Exception.CollectorAuthenticationFailed=No se pudo conectar con el servidor de la aplicaci\u00f3n. Intente cargar de nuevo la oferta. Si el problema persiste, p\u00f3ngase en contacto con el administrador del sistema. 
PromotionsManagement.Exception.ConnectionTerminated=La conexi\u00f3n con el servidor de la aplicaci\u00f3n ha finalizado de forma inesperada. Intente cargar de nuevo la oferta. Si el problema persiste, p\u00f3ngase en contacto con el administrador del sistema. 
PromotionsManagement.Exception.CollectorBeanNotFound=El servidor de la aplicaci\u00f3n ha solicitado un objeto que ya no es v\u00e1lido. Es posible que el objeto haya superado el tiempo de sesi\u00f3n y se haya eliminado de la memoria. Intente cargar de nuevo la oferta.  Si el problema persiste, p\u00f3ngase en contacto con el administrador del sistema.
PromotionsManagement.Exception.NoCollectorCanBeAllocated=Debido a la configuraci\u00f3n de limitaci\u00f3n para este trabajo, no se puede procesar su solicitud. Int\u00e9ntelo m\u00e1s tarde o p\u00f3ngase en contacto con el administrador del sistema.
PromotionsManagement.Exception.NoCollectorCanBeAllocatedPartialOfferLoaded=Debido a la configuraci\u00f3n de limitaci\u00f3n para este trabajo, no se pueden cargar todas las ofertas. Int\u00e9ntelo m\u00e1s tarde o p\u00f3ngase en contacto con el administrador del sistema.
PromotionsManagement.Exception.ProcessTableDataLoadFailed=Error al llenar la tabla de proceso para el selector de la base de datos.
PromotionsManagement.Exception.ProcessTableDataDeleteFailed=Error al suprimir registros de la tabla de proceso para el selector de la base de datos.
PromotionsManagement.Exception.DropProcessTableFailed=Error al eliminar la tabla de proceso para el selector de la base de datos.
PromotionsManagement.Exception.CreateProcessTableFailed=Se produjo un error al crear la tabla de proceso para el selector de la base de datos.
PromotionsManagement.Exception.InsertDataLoadFailed=Error al insertar la entrada de la tabla de proceso para el selector de la base de datos.
PromotionsManagement.Exception.DeleteDataLoadFailed=Error al suprimir la entrada de la tabla de proceso para el selector de la base de datos.
PromotionsManagement.Exception.DeleteProcessTablesFailed=Error al eliminar las entradas de la tabla y las tablas de procesos para el selector de la base de datos.
PromotionsManagement.Warning.FirstVisitMarkdownAllocation = El porcentaje total de asignaci\u00f3n de la reducci\u00f3n para la primera visita debe totalizar 100%
PromotionsManagement.Warning.BouncebackMarkdownAllocation = El porcentaje total de asignaci\u00f3n de la reducci\u00f3n para bounceback debe totalizar 100%
PromotionsManagement.Exception.UnsupportedVTFDataType=El tipo de datos {0} no se admite como atributo de promociones comerciales.
PromotionsManagement.Exception.LogInException=El servidor de la aplicaci\u00f3n ha solicitado un objeto que ya no es v\u00e1lido. Es posible que el objeto haya superado el tiempo de sesi\u00f3n y se haya eliminado de la memoria. Intente cargar de nuevo la oferta.  Si el problema persiste, p\u00f3ngase en contacto con el administrador del sistema.
PromotionsManagement.Exception.SavingLockedOffer=La oferta promocional est\u00e1 bloqueada. No se pueden guardar los cambios hechos a la oferta.
PromotionsManagement.Exception.SavingLockedOfferWithOfferName=La oferta promocional {0} est\u00e1 bloqueada. No se pueden guardar los cambios hechos a la oferta.
#Warnings
PromotionsManagement.Warning.RedundantPriceStrategy=Estrategia de pecios definida es redundante.
PromotionsManagement.Warning.Integration.ConnectionProblem=Hay un problema en la conexi\u00f3n con el servidor de publicidad, p\u00f3ngase en contacto con el administrador del sistema.
PromotionsManagement.Warning.InadvisableEdit=Uno o m\u00e1s de los cambios har\u00e1 a la oferta {0} s\u00f3lo lectura basado en sus privilegios de seguridad.
PromotionsManagement.Warning.ExceededSearchLimit=La combinaci\u00f3n de productos en las ubicaciones para la oferta supera {0}. Restrinja el alcance de la oferta o intente crear una nueva.
PromotionsManagement.Warning.NoFeaturedProduct=Se necesita el producto especial para publicar la oferta.
PromotionsManagement.Warning.NoPriceStrategy=Se necesita la estrategia de precios para publicar el precio.
PromotionsManagement.Warning.NoPriceStrategyOrFeaturedProduct=Se necesita la estrategia de precios y el producto especial para publicar la oferta.
PromotionsManagement.Warning.NoPriceStrategyPublishOffer=Se necesita la estrategia de precios para publicar la oferta.
PromotionsManagement.Warning.InvalidFcstStatusMsg=No se puede publicar la previsi\u00f3n ya que el estado de previsi\u00f3n se encuentra en estado inv\u00e1lido.
PromotionsManagement.Warning.Approve.InvalidFcstStatusMsg=No se puede aprobar la oferta ya que el estado de previsi\u00f3n se encuentra en estado inv\u00e1lido.
PromotionsManagement.Warning.SumitForApproval.InvalidFcstStatusMsg=No puede enviar la oferta para su aprobaci\u00f3n ya que el estado de previsi\u00f3n se encuentra en estado inv\u00e1lido.
PromotionsManagement.Warning.BlockRetrieval=No se pudo recuperar los datos en bloques.  Contacte al administrador de sistemas.
PromotionsManagement.Warning.OfferBaseDmdOutOfDate = La Demanda base para esta oferta est\u00e1 desactualizada. Para obtener los valores actuales, ejecute el proceso Actualizar ofertas.
PromotionsManagement.Warning.InvalidDisplayLevelMsg = Par\u00e1metro DRM.APM.MARKDOWNALLOCATION.HIERARCHYLEVEL en la tabla Par\u00e1mGlobalPrecio no est\u00e1 configurado correctamente. P\u00f3ngase en contacto con el administrador del sistema.
PromotionsManagement.Warning.IncompleteMarkingOfBuyGetDFU = Todos los productos deben tener una designaci\u00f3n Compre o Lleve, con por lo menos un producto para comprar y uno para llevar gratis.
#SRE Promo Offer Export
APM.PromoOfferExport:Exportaci\u00f3n de las ofertas promocionales
APM.PromoOfferExport.ProcessedOffers=Ofertas procesadas
APM.PromoOfferExport.ExportedOffers=Ofertas exportadas
APM.PromoOfferExport.FailedOffers=Error de ofertas

#SRE Price Rule Export
APM.PriceRuleExport:Exportaci\u00f3n de las normas de precio

#PromoActivity
PromoActivity.EventType=Tipo de evento inv\u00e1lido para actividad promocional.

Activity.NoLocations=La actividad {0} no tiene ninguna ubicaci\u00f3n. Agregue las ubicaciones antes de asignar la oferta.
HierarchyMetadata.NotSetupProperly=MD_LIST_DOMAIN no tiene datos de REF_TABLE para DOMAIN_NAME 'SCPO_APM_LOCATION_HIERARCHY' y 'SCPO_APM_PRODUCT_HIERARCHY'.

BuyXGetYPriceStrategy.CannotOverrideError=Una estrategia de precio Comprar X Obtener Y no puede ser modificada por otra estrategia de precio.
BOGOPriceStrategy.CannotOverrideError=Una estrategia de precio BOGO no puede ser modificada por otra estrategia de precio.
CrossImpacted.ImpactedProducts=Productos impactados
Total=Total
Activity.NoLocationsForRequest=La actividad {0} no tiene ninguna ubicaci\u00f3n. Agregue las ubicaciones antes de asignar la solicitud.
PromotionsManagement.InsufficientLeadTime=Tiempo de espera insuficiente
Offer.MultipleCurrencies=Existen varias divisas para las ubicaciones seleccionadas.
