# Main resource bundle for APM BusinessObject exceptions, status messages, and log messages

#PromoDFUCollector
PromoDFUCollector.DuplicatePromoPriceStrategy=Uma estrat\u00e9gia de pre\u00e7o j\u00e1 existe nesse n\u00edvel de hierarquia.
PromoDFUCollector.MissingPromoPriceStrategy=A estrat\u00e9gia de pre\u00e7o n\u00e3o existe nesse n\u00edvel de hierarquia.
PromoDFUCollector.ConflictWhenAddingProduct=Um ou mais produtos a serem adicionados j\u00e1 existem.
PromoDFUCollector.NoProductsFound=A pesquisa n\u00e3o retornou produtos.
PromoDFUCollector.AssocToActivityResultsInNoProds=Os locais na atividade selecionada n\u00e3o correspondem a qualquer um dos crit\u00e9rios de pesquisa originais.  Como resultado, todos os produtos foram removidos da oferta.
PromoDFUCollector.FilterContainsOR=A configura\u00e7\u00e3o de seguran\u00e7a dos dados n\u00e3o foi definida corretamente. Entre em contato com o administrador do sistema.
PromoDFUCollector.FilterContainsUnsupportedTables=A configura\u00e7\u00e3o de seguran\u00e7a dos dados n\u00e3o foi definida corretamente. Entre em contato com o administrador do sistema.

# State
APMStateControl.InvalidTransitionForDate=A data de in\u00edcio da oferta promocional deve ser maior que ou igual \u00e0 data de hoje.

#PromoAnalysisParams
PromoAnalysisParams.DefaultForecastName=Proje\u00e7\u00e3o

#Exceptions
APM.Exception.AllocationCalendarNotFound=O calend\u00e1rio de aloca\u00e7\u00f5es {0} n\u00e3o pode ser encontrado.
APM.Exception.CriteriaNotAvailable=Os crit\u00e9rios de pesquisa a seguir n\u00e3o podem ser encontrados no cache do cliente: {0}
APM.Exception.UnexpectedCriteriaFinderOperation=PromoDFUCriteriaFinder foi inesperadamente chamada para um contexto de consulta ou pesquisa. 
PromotionsManagement.Exception.RefreshAggregateAttributeFailed=Erro ao atualizar o atributo agregado {0}.
PromotionsManagement.Exception.TotalNodeValueApplication=Erro ao atualizar o atributo total do n\u00f3 {0}.
PromotionsManagement.Exception.retrievePriceZoneListForActivity=Erro ao recuperar as zonas de pre\u00e7o para as atividades associadas.
PromotionsManagement.Exception.RefreshSaveStoriesFailed=Erro ao atualizar as mat\u00e9rias de salvamento.
PromotionsManagement.Exception.RefreshExclusionsFailed=Erro ao atualizar as exclus\u00f5es.
PromotionsManagement.Exception.HistoryDataLoadFailed=Erro ao carregar os dados do hist\u00f3rico.
PromotionsManagement.Exception.reloadDFUs=Erro ao recarregar os DFUs promocionais.
PromotionsManagement.Exception.RefreshFcstDataFailed=Erro ao atualizar a previs\u00e3o para os DFUs promocionais.
PromotionsManagement.Exception.UnsupportedMIDataType=Os dados do tipo {0} n\u00e3o s\u00e3o suportados como atributo do instrumento de marketing.
PromotionsManagement.Exception.OptimizationFailed=Ocorreu um erro durante a otimiza\u00e7\u00e3o. Entre em contato com o administrador do sistema.
PromotionsManagement.Exception.ExportFailed=Ocorreu um erro durante a exporta\u00e7\u00e3o. Entre em contato com o administrador do sistema.
PromotionsManagement.Exception.CrossImpactsNotSupported=N\u00e3o \u00e9 poss\u00edvel reconciliar os impactos entre produtos entre os n\u00edveis hier\u00e1rquicos.  Cada n\u00edvel de hierarquia pode ser otimizado de forma independente.
PromotionsManagement.Exception.UserInformationNotAvailable=As informa\u00e7\u00f5es do usu\u00e1rio para o usu\u00e1rio {0} n\u00e3o puderam ser recuperadas. 

PromotionsManagement.Exception.CollectorServiceNotAvailable=O sistema n\u00e3o consegue processar a sua solicita\u00e7\u00e3o, porque o processo SRE do coletor de gerenciamento de promo\u00e7\u00f5es foi iniciado. Entre em contato com o administrador do sistema.
PromotionsManagement.Exception.CollectorAuthenticationFailed=N\u00e3o \u00e9 poss\u00edvel conectar-se ao servidor do aplicativo. Tente carregar a oferta novamente. Se o problema persistir, entre em contato com o administrador do sistema. 
PromotionsManagement.Exception.ConnectionTerminated=A conex\u00e3o com o servidor de aplicativos foi finalizada inesperadamente. Tente carregar a oferta novamente. Se o problema persistir, entre em contato com o administrador do sistema. 
PromotionsManagement.Exception.CollectorBeanNotFound=O servidor de aplicativo solicitou um objeto que n\u00e3o \u00e9 mais v\u00e1lido. O objeto pode ter atingido o tempo limite e foi removido da mem\u00f3ria. Tente carregar a oferta novamente.  Se o problema persistir, entre em contato com o administrador do sistema.
PromotionsManagement.Exception.NoCollectorCanBeAllocated=Por causa das configura\u00e7\u00f5es de restri\u00e7\u00e3o para esta tarefa, n\u00e3o \u00e9 poss\u00edvel processar sua solicita\u00e7\u00e3o. Tente novamente mais tarde ou entre em contato com o administrador do sistema.
PromotionsManagement.Exception.NoCollectorCanBeAllocatedPartialOfferLoaded=Devido \u00e0s configura\u00e7\u00f5es de restri\u00e7\u00e3o para esta tarefa, nem todas as ofertas podem ser carregadas. Tente novamente mais tarde ou entre em contato com o administrador do sistema.
PromotionsManagement.Exception.ProcessTableDataLoadFailed=Erro ao preencher a tabela de processo para o seletor do banco de dados.
PromotionsManagement.Exception.ProcessTableDataDeleteFailed=Erro ao excluir os registros na tabela de processo para o seletor do banco de dados.
PromotionsManagement.Exception.DropProcessTableFailed=Erro ao remover a tabela de processo para o seletor do banco de dados.
PromotionsManagement.Exception.CreateProcessTableFailed=Erro ao criar a tabela de processo para o seletor do banco de dados.
PromotionsManagement.Exception.InsertDataLoadFailed=Erro ao inserir a entrada da tabela de processo do seletor do banco de dados.
PromotionsManagement.Exception.DeleteDataLoadFailed=Erro ao excluir a entrada da tabela de processo do seletor do banco de dados.
PromotionsManagement.Exception.DeleteProcessTablesFailed=Erro ao remover as entradas da tabela e as tabelas do processo do seletor do banco de dados.
PromotionsManagement.Warning.FirstVisitMarkdownAllocation = O percentual total da aloca\u00e7\u00e3o de redu\u00e7\u00e3o da primeira visita deve somar at\u00e9 100%
PromotionsManagement.Warning.BouncebackMarkdownAllocation = O percentual total da aloca\u00e7\u00e3o de redu\u00e7\u00e3o da bounceback deve somar at\u00e9 100%
PromotionsManagement.Exception.UnsupportedVTFDataType=Os dados do tipo {0} n\u00e3o s\u00e3o suportados como atributo de promo\u00e7\u00f5es comerciais.
PromotionsManagement.Exception.LogInException=O servidor de aplicativo solicitou um objeto que n\u00e3o \u00e9 mais v\u00e1lido. O objeto pode ter atingido o tempo limite e foi removido da mem\u00f3ria. Tente carregar a oferta novamente.  Se o problema persistir, entre em contato com o administrador do sistema.
PromotionsManagement.Exception.SavingLockedOffer=A oferta promocional agora est\u00e1 bloqueada. As altera\u00e7\u00f5es feitas \u00e0 oferta n\u00e3o podem ser salvas.
PromotionsManagement.Exception.SavingLockedOfferWithOfferName=A oferta promocional {0} agora est\u00e1 bloqueada. As altera\u00e7\u00f5es feitas \u00e0 oferta n\u00e3o podem ser salvas.
#Warnings
PromotionsManagement.Warning.RedundantPriceStrategy=A estrat\u00e9gia de pre\u00e7o definida \u00e9 redundante.
PromotionsManagement.Warning.Integration.ConnectionProblem=H\u00e1 um problema de conex\u00e3o com o servidor de an\u00fancios, entre em contato com o administrador do sistema.
PromotionsManagement.Warning.InadvisableEdit=Uma ou mais de suas altera\u00e7\u00f5es tornariam a oferta {0} somente leitura com base em seus privil\u00e9gios de seguran\u00e7a.
PromotionsManagement.Warning.ExceededSearchLimit=A combina\u00e7\u00e3o de produtos em locais para a oferta excede {0}. Restrinja o escopo da oferta ou tente criar uma nova.
PromotionsManagement.Warning.NoFeaturedProduct=O produto em destaque \u00e9 necess\u00e1rio para publicar a oferta.
PromotionsManagement.Warning.NoPriceStrategy=A estrat\u00e9gia de pre\u00e7o \u00e9 necess\u00e1ria para publicar o pre\u00e7o.
PromotionsManagement.Warning.NoPriceStrategyOrFeaturedProduct=A estrat\u00e9gia de pre\u00e7o e o produto em destaque s\u00e3o necess\u00e1rios para publicar a oferta.
PromotionsManagement.Warning.NoPriceStrategyPublishOffer=A estrat\u00e9gia de pre\u00e7o \u00e9 necess\u00e1ria para publicar a oferta.
PromotionsManagement.Warning.InvalidFcstStatusMsg=N\u00e3o \u00e9 poss\u00edvel publicar a previs\u00e3o, pois o status da previs\u00e3o est\u00e1 em um estado inv\u00e1lido.
PromotionsManagement.Warning.Approve.InvalidFcstStatusMsg=N\u00e3o \u00e9 poss\u00edvel aprovar a oferta, pois o status da previs\u00e3o est\u00e1 em um estado inv\u00e1lido.
PromotionsManagement.Warning.SumitForApproval.InvalidFcstStatusMsg=N\u00e3o \u00e9 poss\u00edvel enviar a oferta para aprova\u00e7\u00e3o, pois o status da previs\u00e3o est\u00e1 em um estado inv\u00e1lido.
PromotionsManagement.Warning.BlockRetrieval=N\u00e3o foi poss\u00edvel recuperar os dados de bloqueio.  Entre em contato com o administrador do sistema.
PromotionsManagement.Warning.OfferBaseDmdOutOfDate = A demanda de base para esta oferta est\u00e1 desatualizada. Para obter os valores atuais, execute o processo Atualizar ofertas.
PromotionsManagement.Warning.InvalidDisplayLevelMsg = O par\u00e2metro DRM.APM.MARKDOWNALLOCATION.HIERARCHYLEVEL na tabela PriceGlobalParam n\u00e3o est\u00e1 configurado adequadamente. Entre em contato com o administrador do sistema.
PromotionsManagement.Warning.IncompleteMarkingOfBuyGetDFU = Todos os produtos devem ter uma designa\u00e7\u00e3o de compra ou obten\u00e7\u00e3o, com pelo menos um Comprar produto e um Obter produto.
#SRE Promo Offer Export
APM.PromoOfferExport:Exporta\u00e7\u00e3o de oferta promocional
APM.PromoOfferExport.ProcessedOffers=Ofertas processadas
APM.PromoOfferExport.ExportedOffers=Ofertas exportadas
APM.PromoOfferExport.FailedOffers=Ofertas com falhas

#SRE Price Rule Export
APM.PriceRuleExport:Exporta\u00e7\u00e3o de regras de pre\u00e7o

#PromoActivity
PromoActivity.EventType=Tipo de evento inv\u00e1lido para a atividade promocional.

Activity.NoLocations=A atividade {0} n\u00e3o tem locais.  Adicione locais antes de atribuir a oferta.
HierarchyMetadata.NotSetupProperly=MD_LIST_DOMAIN n\u00e3o tem dados REF_TABLE para DOMAIN_NAME 'SCPO_APM_LOCATION_HIERARCHY' e 'SCPO_APM_PRODUCT_HIERARCHY'.

BuyXGetYPriceStrategy.CannotOverrideError=Uma estrat\u00e9gia de pre\u00e7o Comprar X, obter Y n\u00e3o pode ser substitu\u00edda por outra estrat\u00e9gia de pre\u00e7o.
BOGOPriceStrategy.CannotOverrideError=Uma estrat\u00e9gia de pre\u00e7o BOGO n\u00e3o pode ser substitu\u00edda por outra estrat\u00e9gia de pre\u00e7o.
CrossImpacted.ImpactedProducts=Produtos impactados
Total=Total
Activity.NoLocationsForRequest=A atividade {0} n\u00e3o tem locais.  Adicione locais antes de atribuir a solicita\u00e7\u00e3o.
PromotionsManagement.InsufficientLeadTime=Tempo de aprovisionamento insuficiente
Offer.MultipleCurrencies=V\u00e1rias moedas existem para os locais selecionados.
