# Main resource bundle for APM BusinessObject exceptions, status messages, and log messages

#PromoDFUCollector
PromoDFUCollector.DuplicatePromoPriceStrategy=Une Strat\u00e9gie de Prix existe d\u00e9j\u00e0 \u00e0 ce niveau de hi\u00e9rarchie.
PromoDFUCollector.MissingPromoPriceStrategy=La Strat\u00e9gie de Prix n'existe pas au niveau de la hi\u00e9rarchie.
PromoDFUCollector.ConflictWhenAddingProduct=Un ou plusieurs produits \u00e0 ajouter existent d\u00e9j\u00e0.
PromoDFUCollector.NoProductsFound=La recherche de donne aucun produit.
PromoDFUCollector.AssocToActivityResultsInNoProds=Les sites de l'activit\u00e9 s\u00e9lectionn\u00e9e ne correspondent pas aux crit\u00e8res de recherche originaux. Ainsi, tous les produits ont \u00e9t\u00e9 retir\u00e9s de l'offre.
PromoDFUCollector.FilterContainsOR=Votre param\u00e9trage de s\u00e9curit\u00e9 de donn\u00e9es n'est pas correctement \u00e9tabli. Veuillez contacter votre administrateur de syst\u00e8me.
PromoDFUCollector.FilterContainsUnsupportedTables=Votre param\u00e9trage de s\u00e9curit\u00e9 de donn\u00e9es n'est pas correctement \u00e9tabli. Veuillez contacter votre administrateur de syst\u00e8me.

# State
APMStateControl.InvalidTransitionForDate=La Date de D\u00e9but d'Offre de Promotion doit \u00eatre post\u00e9rieure ou identique \u00e0 la date du jour.

#PromoAnalysisParams
PromoAnalysisParams.DefaultForecastName=Pr\u00e9vision

#Exceptions
APM.Exception.AllocationCalendarNotFound=Le Calendrier d''Allocation {0} est introuvable.
APM.Exception.CriteriaNotAvailable=Les Crit\u00e8res de Recherche suivants sont introuvables dans le cache client: {0}
APM.Exception.UnexpectedCriteriaFinderOperation=LocalisateurCrit\u00e8resUDPPromo a \u00e9t\u00e9 appel\u00e9 dans un contexte de recherche. 
PromotionsManagement.Exception.RefreshAggregateAttributeFailed=Erreur de rafra\u00eechissement d''attribut agr\u00e9gation {0}.
PromotionsManagement.Exception.TotalNodeValueApplication=Erreur r\u00e9actualisation d''attribut noeud total {0}.
PromotionsManagement.Exception.retrievePriceZoneListForActivity=Erreur d'extraction de zones de prix pour l'activit\u00e9 associ\u00e9e.
PromotionsManagement.Exception.RefreshSaveStoriesFailed=Erreur lors du rafra\u00eechissement d'enreg.
PromotionsManagement.Exception.RefreshExclusionsFailed=Erreur de rafra\u00eechissement d'exclusions.
PromotionsManagement.Exception.HistoryDataLoadFailed=Erreur de chargement de donn\u00e9es historiques.
PromotionsManagement.Exception.reloadDFUs=Erreur de rechargement d'udp de promo.
PromotionsManagement.Exception.RefreshFcstDataFailed=Erreur de rafra\u00eechissement de pr\u00e9vision pour les udp de promotion.
PromotionsManagement.Exception.UnsupportedMIDataType=Le type de donn\u00e9es {0} n''est pas compatible comme attribut d''instrument de marketing.
PromotionsManagement.Exception.OptimizationFailed=Une erreur s'est produite pendant l'optimisation. Veuillez contacter votre administrateur de syst\u00e8me.
PromotionsManagement.Exception.ExportFailed=Une erreur s'est produite pendant l'exportation. Veuillez contacter votre administrateur de syst\u00e8me.
PromotionsManagement.Exception.CrossImpactsNotSupported=Impossible de r\u00e9concilier les impacts de corresp. de produit \u00e0 travers les niveaux de hi\u00e9rarchie. Chaque niveau de hi\u00e9rarchie peut \u00eatre optimis\u00e9 ind\u00e9pendamment.
PromotionsManagement.Exception.UserInformationNotAvailable=Information Utilisateur pour utilisateur {0} ne peut pas \u00eatre extraite. 

PromotionsManagement.Exception.CollectorServiceNotAvailable=Le syst\u00e8me ne peut pas traiter votre demande parce que le processus SRE Collection Gestion Promotion n'a pas commenc\u00e9. Contactez votre administrateur de syst\u00e8me.
PromotionsManagement.Exception.CollectorAuthenticationFailed=Impossible de se connecter au serveur d'application. Essayez de recharger l'offre. Si le probl\u00e8me persiste, contactez votre administrateur de syst\u00e8me. 
PromotionsManagement.Exception.ConnectionTerminated=La connexion au serveur d'application s'est interrompue brutalement. Essayez de relancer l'offre. Si le probl\u00e8me persiste, contactez votre administrateur de syst\u00e8me. 
PromotionsManagement.Exception.CollectorBeanNotFound=Le serveur d'application exige un objet qui n'est plus valide. L'objet a soit d\u00e9pass\u00e9 le d\u00e9lai soit \u00e9t\u00e9 enlev\u00e9 de la m\u00e9moire. Essayer de recharger l'offre. Si le probl\u00e8me subsiste, contactez votre administrateur de syst\u00e8me.
PromotionsManagement.Exception.NoCollectorCanBeAllocated=En raison des param\u00e8tres de contraintes pour cette t\u00e2che, votre demande ne peut pas \u00eatre trait\u00e9e. Recommencez plus tard ou contactez votre administrateur de syst\u00e8me.
PromotionsManagement.Exception.NoCollectorCanBeAllocatedPartialOfferLoaded=En raison des param\u00e8tres de contraintes pour cette t\u00e2che, toutes les offres ne peuvent pas \u00eatre charg\u00e9es. Recommencez plus tard ou contactez votre administrateur de syst\u00e8me.
PromotionsManagement.Exception.ProcessTableDataLoadFailed=Erreur de remplissage de table pour S\u00e9lection BDD.
PromotionsManagement.Exception.ProcessTableDataDeleteFailed=Erreur suppression d'enregistrement depuis la table de traitement pour S\u00e9lection BDD.
PromotionsManagement.Exception.DropProcessTableFailed=Erreur de retrait de table traitement pour S\u00e9lection BDD.
PromotionsManagement.Exception.CreateProcessTableFailed=Erreur de cr\u00e9ation de table pour S\u00e9lecteur BDD.
PromotionsManagement.Exception.InsertDataLoadFailed=Erreur d'insertion de saisie table processus s\u00e9lection BDD.
PromotionsManagement.Exception.DeleteDataLoadFailed=Erreur de suppression de saisie table processus s\u00e9lection BDD.
PromotionsManagement.Exception.DeleteProcessTablesFailed=Erreur de retrait de tables processus s\u00e9lection BDD et saisies de table.
PromotionsManagement.Warning.FirstVisitMarkdownAllocation = Le pourcentage total d'Allocation Remise Premi\u00e8re Visite doit \u00eatre \u00e9gal \u00e0 100%
PromotionsManagement.Warning.BouncebackMarkdownAllocation = Le pourcentage total d'Allocation Remise Rebond doit \u00eatre \u00e9gal \u00e0 100%
PromotionsManagement.Exception.UnsupportedVTFDataType=Le type de donn\u00e9es {0} n''est pas compatible comme attribut Promotions Commerciales.
PromotionsManagement.Exception.LogInException=Le serveur d'application exige un objet qui n'est plus valide. L'objet a soit d\u00e9pass\u00e9 le d\u00e9lai soit \u00e9t\u00e9 enlev\u00e9 de la m\u00e9moire. Essayer de recharger l'offre. Si le probl\u00e8me subsiste, contactez votre administrateur de syst\u00e8me.
PromotionsManagement.Exception.SavingLockedOffer=L'offre de promotion est maintenant verrouill\u00e9e. Les modifs appliqu\u00e9es sur l'offre ne peuvent pas \u00eatre enregistr\u00e9es.
PromotionsManagement.Exception.SavingLockedOfferWithOfferName=L''offre de promotion {0} est maintenant verrouill\u00e9e. Les modifs appliqu\u00e9es sur l''offre ne peuvent pas \u00eatre enregistr\u00e9es.
#Warnings
PromotionsManagement.Warning.RedundantPriceStrategy=Strat\u00e9gie de Prix d\u00e9finie est en surnombre.
PromotionsManagement.Warning.Integration.ConnectionProblem=Il y a un probl\u00e8me de connexion sur le Serveur Publicit\u00e9, veuillez contacter votre administrateur de syst\u00e8me.
PromotionsManagement.Warning.InadvisableEdit=Une ou plusieurs modifs. rendent l''offre {0} en lecture seule en se basant sur vos privil\u00e8ges de s\u00e9curit\u00e9.
PromotionsManagement.Warning.ExceededSearchLimit=La combinaison de produits sur des sites pour l''offre d\u00e9passe {0}. R\u00e9duire la port\u00e9e de l''offre ou essayer d''en cr\u00e9er une nouvelle.
PromotionsManagement.Warning.NoFeaturedProduct=Le produit pr\u00e9sent\u00e9 est requis pour publier l'offre.
PromotionsManagement.Warning.NoPriceStrategy=La strat\u00e9gie de prix est requise pour publier le prix.
PromotionsManagement.Warning.NoPriceStrategyOrFeaturedProduct=Strat\u00e9gie de prix et produit pr\u00e9sent\u00e9 sont requis pour publier l'offre.
PromotionsManagement.Warning.NoPriceStrategyPublishOffer=La strat\u00e9gie de prix est requise pour publier l'offre.
PromotionsManagement.Warning.InvalidFcstStatusMsg=Vous ne pouvez pas publier une pr\u00e9vision comme \u00e9tant en \u00e9tat pr\u00e9visionnel dans un \u00e9tat invalide.
PromotionsManagement.Warning.Approve.InvalidFcstStatusMsg=Vous ne pouvez pas valider une offre comme \u00e9tant en \u00e9tat pr\u00e9visionnel dans un \u00e9tat invalide.
PromotionsManagement.Warning.SumitForApproval.InvalidFcstStatusMsg=Vous ne pouvez pas soumettre une offre pour approbation parce que l'\u00e9tat pr\u00e9visionnel est invalide.
PromotionsManagement.Warning.BlockRetrieval=Impossible d'extraire des donn\u00e9es. Veuillez contacter votre administrateur de syst\u00e8me.
PromotionsManagement.Warning.OfferBaseDmdOutOfDate = La Demande de Base pour cette offre est p\u00e9rim\u00e9e. Pour obtenir des valeurs actuelles, traiter Rafra\u00eechir les Offres.
PromotionsManagement.Warning.InvalidDisplayLevelMsg = Param\u00e8tre DRM.APM.MARKDOWNALLOCATION.HIERARCHYLEVEL dans la table Param Prix Global n'est pas configur\u00e9 correctement. Veuillez contacter votre administrateur de syst\u00e8me.
PromotionsManagement.Warning.IncompleteMarkingOfBuyGetDFU = Tous les produits doivent avoir une d\u00e9signation d'achat or obtention, avec au moins un produit achet\u00e9 et un produit donn\u00e9.
#SRE Promo Offer Export
APM.PromoOfferExport:Exporter Offre Promo
APM.PromoOfferExport.ProcessedOffers=Offres Trait\u00e9es
APM.PromoOfferExport.ExportedOffers=Offres Export\u00e9es
APM.PromoOfferExport.FailedOffers=Echec Offres

#SRE Price Rule Export
APM.PriceRuleExport:Exporter R\u00e8gle de Prix

#PromoActivity
PromoActivity.EventType=Type d'\u00e9v\u00e9nement invalide pour Activit\u00e9 Promo.

Activity.NoLocations=Activit\u00e9 {0} n''a pas de sites.  Veuillez ajouter des sites avant d''affecter une offre.
HierarchyMetadata.NotSetupProperly=MD_LIST_DOMAIN n'a pas de donn\u00e9es REF_TABLE pour DOMAIN_NAME 'SCPO_APM_LOCATION_HIERARCHY' et 'SCPO_APM_PRODUCT_HIERARCHY'.

BuyXGetYPriceStrategy.CannotOverrideError=Une strat\u00e9gie Acheter X Obtenir Y ne peut pas \u00eatre remplac\u00e9e par une autre strat\u00e9gie de prix.
BOGOPriceStrategy.CannotOverrideError=Une strat\u00e9gie de prix 2 Pour 1 ne peut pas \u00eatre remplac\u00e9e par une autre strat\u00e9gie de prix.
CrossImpacted.ImpactedProducts=Produits avec Impact
Total=Total
Activity.NoLocationsForRequest=Activit\u00e9 {0} n''a pas de sites.  Veuillez ajouter des sites avant d''affecter la demande.
PromotionsManagement.InsufficientLeadTime=D\u00e9lai insuffisant
Offer.MultipleCurrencies=Des devises multiples existent pour des sites choisis.
