# Main resource bundle for APM BusinessObject exceptions, status messages, and log messages

#PromoDFUCollector
PromoDFUCollector.DuplicatePromoPriceStrategy=\u4fa1\u683c\u6226\u7565\u306f\u3053\u306e\u968e\u5c64\u30ec\u30d9\u30eb\u306b\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
PromoDFUCollector.MissingPromoPriceStrategy=\u3053\u306e\u968e\u5c64\u30ec\u30d9\u30eb\u306b\u306f\u4fa1\u683c\u6226\u7565\u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
PromoDFUCollector.ConflictWhenAddingProduct=\u8ffd\u52a0\u3055\u308c\u308b\u88fd\u54c1\u304c\u65e2\u306b 1 \u3064\u307e\u305f\u306f\u8907\u6570\u5b58\u5728\u3057\u307e\u3059\u3002
PromoDFUCollector.NoProductsFound=\u691c\u7d22\u306e\u7d50\u679c\u3001\u88fd\u54c1\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
PromoDFUCollector.AssocToActivityResultsInNoProds=\u9078\u629e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u5143\u306e\u691c\u7d22\u6761\u4ef6\u306e\u3069\u308c\u306b\u3082\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002\u305d\u306e\u7d50\u679c\u3001\u3059\u3079\u3066\u306e\u88fd\u54c1\u304c\u30aa\u30d5\u30a1\u30fc\u304b\u3089\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002
PromoDFUCollector.FilterContainsOR=\u30c7\u30fc\u30bf\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8a2d\u5b9a\u304c\u6b63\u3057\u304f\u884c\u308f\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromoDFUCollector.FilterContainsUnsupportedTables=\u30c7\u30fc\u30bf\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u8a2d\u5b9a\u304c\u6b63\u3057\u304f\u884c\u308f\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# State
APMStateControl.InvalidTransitionForDate=\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u30aa\u30d5\u30a1\u30fc\u958b\u59cb\u65e5\u306f\u4eca\u65e5\u306e\u65e5\u4ed8\u304b\u3001\u307e\u305f\u306f\u305d\u308c\u4ee5\u964d\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002

#PromoAnalysisParams
PromoAnalysisParams.DefaultForecastName=\u4e88\u6e2c

#Exceptions
APM.Exception.AllocationCalendarNotFound=\u5272\u308a\u5f53\u3066\u30ab\u30ec\u30f3\u30c0\u300c{0}\u300d\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
APM.Exception.CriteriaNotAvailable=\u4ee5\u4e0b\u306e\u691c\u7d22\u6761\u4ef6\u304c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u898b\u3064\u304b\u308a\u307e\u305b\u3093\uff1a {0}
APM.Exception.UnexpectedCriteriaFinderOperation=PromoDFUCriteriaFinder \u306f\u30af\u30a8\u30ea\u30b3\u30f3\u30c6\u30af\u30b9\u30c8\u307e\u305f\u306f\u30eb\u30c3\u30af\u30a2\u30c3\u30d7\u30b3\u30f3\u30c6\u30af\u30b9\u30c8\u3092\u4e88\u671f\u3057\u306a\u3044 
PromotionsManagement.Exception.RefreshAggregateAttributeFailed=\u96c6\u8a08\u5c5e\u6027\u300c{0}\u300d\u3092\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.TotalNodeValueApplication=\u5408\u8a08\u30ce\u30fc\u30c9\u5c5e\u6027 {0} \u3092\u6700\u65b0\u60c5\u5831\u306b\u66f4\u65b0\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.retrievePriceZoneListForActivity=\u95a2\u9023\u4ed8\u3051\u3089\u308c\u305f\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306e\u58f2\u4fa1\u30be\u30fc\u30f3\u3092\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.RefreshSaveStoriesFailed=\u30b9\u30c8\u30fc\u30ea\u30fc\u3092\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.RefreshExclusionsFailed=\u9664\u5916\u3092\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.HistoryDataLoadFailed=\u5c65\u6b74\u30c7\u30fc\u30bf\u3092\u30ed\u30fc\u30c9\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.reloadDFUs=Promo DFU \u3092\u518d\u30ed\u30fc\u30c9\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.RefreshFcstDataFailed=Promo DFU \u306e\u4e88\u6e2c\u3092\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.UnsupportedMIDataType=\u30c7\u30fc\u30bf\u30bf\u30a4\u30d7{0} \u306f\u5e83\u544a\u5c5e\u6027\u3068\u3057\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
PromotionsManagement.Exception.OptimizationFailed=\u6700\u9069\u5316\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Exception.ExportFailed=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Exception.CrossImpactsNotSupported=\u968e\u5c64\u30ec\u30d9\u30eb\u5168\u4f53\u306b\u308f\u305f\u308b\u88fd\u54c1\u306e\u30a4\u30f3\u30d1\u30af\u30c8\u3092\u8abf\u6574\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u500b\u3005\u306e\u968e\u5c64\u30ec\u30d9\u30eb\u306e\u6700\u9069\u5316\u306f\u305d\u308c\u305e\u308c\u884c\u3044\u307e\u3059\u3002
PromotionsManagement.Exception.UserInformationNotAvailable=\u30e6\u30fc\u30b6\u300c{0}\u300d\u306e\u30e6\u30fc\u30b6\u60c5\u5831\u306f\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 

PromotionsManagement.Exception.CollectorServiceNotAvailable=\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u7ba1\u7406\u30b3\u30ec\u30af\u30bf SRE \u30d7\u30ed\u30bb\u30b9\u304c\u30b9\u30bf\u30fc\u30c8\u3057\u3066\u3044\u306a\u3044\u305f\u3081\u8981\u6c42\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Exception.CollectorAuthenticationFailed=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002\u30aa\u30fc\u30c0\u30d5\u30a1\u30a4\u30eb\u3092\u518d\u5ea6\u30ed\u30fc\u30c9\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002\u554f\u984c\u304c\u7d9a\u304f\u3088\u3046\u306a\u3089\u3070\u3001\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
PromotionsManagement.Exception.ConnectionTerminated=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u3078\u306e\u63a5\u7d9a\u304c\u4e88\u671f\u3057\u306a\u3044\u7d42\u4e86\u3092\u3057\u307e\u3057\u305f\u3002\u30aa\u30d5\u30a1\u30fc\u3092\u518d\u5ea6\u30ed\u30fc\u30c9\u3057\u3066\u304f\u3066\u304f\u3060\u3055\u3044\u3002\u554f\u984c\u304c\u7d9a\u304f\u3088\u3046\u306a\u3089\u3070\u3001\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
PromotionsManagement.Exception.CollectorBeanNotFound=\u6709\u52b9\u3067\u306f\u306a\u3044\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u304c\u8981\u6c42\u3057\u307e\u3057\u305f\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304b\u3001\u30e1\u30e2\u30ea\u304b\u3089\u524a\u9664\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30aa\u30d5\u30a1\u30fc\u3092\u518d\u5ea6\u30ed\u30fc\u30c9\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002\u554f\u984c\u304c\u7d9a\u304f\u3088\u3046\u306a\u3089\u3070\u3001\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Exception.NoCollectorCanBeAllocated=\u3053\u306e\u30b8\u30e7\u30d6\u306e\u5236\u7d04\u8a2d\u5b9a\u306e\u305f\u3081\u306b\u8981\u6c42\u304c\u51e6\u7406\u3055\u308c\u307e\u305b\u3093\u3002\u5f8c\u3067\u3082\u3046\u4e00\u5ea6\u8a66\u884c\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Exception.NoCollectorCanBeAllocatedPartialOfferLoaded=\u3053\u306e\u30b8\u30e7\u30d6\u306e\u5236\u7d04\u8a2d\u5b9a\u306e\u305f\u3081\u306b\u4e00\u90e8\u306e\u30aa\u30d5\u30a1\u30fc\u304c\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002\u5f8c\u3067\u3082\u3046\u4e00\u5ea6\u8a66\u884c\u3059\u308b\u304b\u3001\u307e\u305f\u306f\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Exception.ProcessTableDataLoadFailed=DB \u30bb\u30ec\u30af\u30bf\u306e\u51e6\u7406\u30c6\u30fc\u30d6\u30eb\u306b\u30c7\u30fc\u30bf\u6295\u5165\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.ProcessTableDataDeleteFailed=DB \u30bb\u30ec\u30af\u30bf\u306e\u51e6\u7406\u30c6\u30fc\u30d6\u30eb\u304b\u3089\u30ec\u30b3\u30fc\u30c9\u3092\u524a\u9664\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.DropProcessTableFailed=DB \u30bb\u30ec\u30af\u30bf\u306e\u51e6\u7406\u30c6\u30fc\u30d6\u30eb\u3092\u524a\u9664\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.CreateProcessTableFailed=DB \u30bb\u30ec\u30af\u30bf\u306e\u51e6\u7406\u30c6\u30fc\u30d6\u30eb\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.InsertDataLoadFailed=DB \u30bb\u30ec\u30af\u30bf\u306e\u51e6\u7406\u30c6\u30fc\u30d6\u30eb\u306e\u30a8\u30f3\u30c8\u30ea\u3092\u633f\u5165\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.DeleteDataLoadFailed=DB \u30bb\u30ec\u30af\u30bf\u306e\u51e6\u7406\u30c6\u30fc\u30d6\u30eb\u306e\u30a8\u30f3\u30c8\u30ea\u3092\u524a\u9664\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Exception.DeleteProcessTablesFailed=DB \u30bb\u30ec\u30af\u30bf\u51e6\u7406\u30c6\u30fc\u30d6\u30eb\u3068\u30c6\u30fc\u30d6\u30eb\u30a8\u30f3\u30c8\u30ea\u3092\u524a\u9664\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
PromotionsManagement.Warning.FirstVisitMarkdownAllocation = \u521d\u56de\u8a2a\u554f\u306e\u30de\u30fc\u30af\u30c0\u30a6\u30f3\u5272\u5f53\u306e\u5408\u8a08\u306f 100% \u306b\u306a\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
PromotionsManagement.Warning.BouncebackMarkdownAllocation = \u30d0\u30a6\u30f3\u30b9\u30d0\u30c3\u30af\u30de\u30fc\u30af\u30c0\u30a6\u30f3\u5272\u5f53\u306e\u5408\u8a08\u306f 100% \u306b\u306a\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
PromotionsManagement.Exception.UnsupportedVTFDataType=\u30c7\u30fc\u30bf\u30bf\u30a4\u30d7{0} \u306f\u30c8\u30ec\u30fc\u30c9\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u5c5e\u6027\u3068\u3057\u3066\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
PromotionsManagement.Exception.LogInException=\u6709\u52b9\u3067\u306f\u306a\u3044\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30b5\u30fc\u30d0\u304c\u8981\u6c42\u3057\u307e\u3057\u305f\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304b\u3001\u30e1\u30e2\u30ea\u304b\u3089\u524a\u9664\u3055\u308c\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30aa\u30d5\u30a1\u30fc\u3092\u518d\u5ea6\u30ed\u30fc\u30c9\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002\u554f\u984c\u304c\u7d9a\u304f\u3088\u3046\u306a\u3089\u3070\u3001\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Exception.SavingLockedOffer=\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u30aa\u30d5\u30a1\u30fc\u306f\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30aa\u30d5\u30a1\u30fc\u3078\u306e\u5909\u66f4\u306f\u4fdd\u5b58\u3067\u304d\u307e\u305b\u3093\u3002
PromotionsManagement.Exception.SavingLockedOfferWithOfferName=\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u30aa\u30d5\u30a1\u30fc {0} \u306f\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002\u30aa\u30d5\u30a1\u30fc\u3078\u306e\u5909\u66f4\u306f\u4fdd\u5b58\u3067\u304d\u307e\u305b\u3093\u3002
#Warnings
PromotionsManagement.Warning.RedundantPriceStrategy=\u5b9a\u7fa9\u3055\u308c\u305f\u4fa1\u683c\u6226\u7565\u304c\u5197\u9577\u3067\u3059\u3002
PromotionsManagement.Warning.Integration.ConnectionProblem=Advertising \u30b5\u30fc\u30d0\u3078\u306e\u63a5\u7d9a\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3059\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Warning.InadvisableEdit=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u6a29\u9650\u306b\u57fa\u3065\u304d\u30011 \u3064\u3042\u308b\u3044\u306f\u8907\u6570\u306e\u5909\u66f4\u3092\u884c\u3046\u3068 {0} \u30aa\u30d5\u30a1\u30fc\u304c\u8aad\u307f\u53d6\u308a\u5c02\u7528\u306b\u306a\u308a\u307e\u3059\u3002
PromotionsManagement.Warning.ExceededSearchLimit=\u30aa\u30d5\u30a1\u30fc\u306b\u5bfe\u3059\u308b\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u306e\u88fd\u54c1\u7d44\u307f\u5408\u308f\u305b\u304c {0} \u3092\u8d85\u904e\u3057\u3066\u3044\u307e\u3059\u3002\u30aa\u30d5\u30a1\u30fc\u306e\u30b9\u30b3\u30fc\u30d7\u3092\u7d5e\u308a\u8fbc\u3080\u304b\u3001\u307e\u305f\u306f\u65b0\u3057\u304f\u4f5c\u6210\u3057\u3066\u307f\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Warning.NoFeaturedProduct=\u30aa\u30d5\u30a1\u30fc\u3092\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3059\u308b\u306b\u306f\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u5bfe\u8c61\u88fd\u54c1\u304c\u5fc5\u8981\u3067\u3059\u3002
PromotionsManagement.Warning.NoPriceStrategy=\u4fa1\u683c\u3092\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3059\u308b\u306b\u306f\u4fa1\u683c\u6226\u7565\u304c\u5fc5\u8981\u3067\u3059\u3002
PromotionsManagement.Warning.NoPriceStrategyOrFeaturedProduct=\u30aa\u30d5\u30a1\u30fc\u3092\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3059\u308b\u306b\u306f\u4fa1\u683c\u6226\u7565\u3068\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u5bfe\u8c61\u88fd\u54c1\u304c\u5fc5\u8981\u3067\u3059\u3002
PromotionsManagement.Warning.NoPriceStrategyPublishOffer=\u30aa\u30d5\u30a1\u30fc\u3092\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3059\u308b\u306b\u306f\u4fa1\u683c\u6226\u7565\u304c\u5fc5\u8981\u3067\u3059\u3002
PromotionsManagement.Warning.InvalidFcstStatusMsg=\u4e88\u6e2c\u72b6\u6cc1\u304c\u7121\u52b9\u306a\u306e\u3067\u4e88\u6e2c\u3092\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3067\u304d\u307e\u305b\u3093\u3002
PromotionsManagement.Warning.Approve.InvalidFcstStatusMsg=\u305d\u306e\u30aa\u30d5\u30a1\u30fc\u306f\u4e88\u6e2c\u72b6\u6cc1\u3068\u3057\u3066\u627f\u8a8d\u3067\u304d\u305a\u7121\u52b9\u3067\u3059\u3002
PromotionsManagement.Warning.SumitForApproval.InvalidFcstStatusMsg=\u4e88\u6e2c\u72b6\u6cc1\u304c\u7121\u52b9\u306a\u306e\u3067\u30aa\u30d5\u30a1\u30fc\u306e\u627f\u8a8d\u7533\u8acb\u304c\u3067\u304d\u307e\u305b\u3093
PromotionsManagement.Warning.BlockRetrieval=\u30d6\u30ed\u30c3\u30af\u30c7\u30fc\u30bf\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Warning.OfferBaseDmdOutOfDate = \u3053\u306e\u30aa\u30d5\u30a1\u30fc\u306e\u30d9\u30fc\u30b9\u9700\u8981\u306f\u53e4\u3044\u3067\u3059\u3002\u73fe\u5728\u306e\u5024\u3092\u53d6\u5f97\u3059\u308b\u306b\u306f\u3001\u30aa\u30d5\u30a1\u30fc\u306e\u30ea\u30d5\u30ec\u30c3\u30b7\u30e5\u3092\u5b9f\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Warning.InvalidDisplayLevelMsg = PriceGlobalParam \u30c6\u30fc\u30d6\u30eb\u306e DRM.APM.MARKDOWNALLOCATION.HIERARCHYLEVEL \u30d1\u30e9\u30e1\u30fc\u30bf\u304c\u6b63\u3057\u304f\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.Warning.IncompleteMarkingOfBuyGetDFU = \u3059\u3079\u3066\u306e\u88fd\u54c1\u304c\u8cfc\u8cb7\u307e\u305f\u306f\u53d6\u5f97\u306e\u6307\u5b9a\u3092\u5c11\u306a\u304f\u3068\u3082 1 \u8cfc\u8cb7\u88fd\u54c1\u30011 \u53d6\u5f97\u88fd\u54c1\u6301\u305f\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
#SRE Promo Offer Export
APM.PromoOfferExport:\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u30aa\u30d5\u30a1\u30fc\u30a8\u30af\u30b9\u30dd\u30fc\u30c8
APM.PromoOfferExport.ProcessedOffers=\u51e6\u7406\u6e08\u30aa\u30d5\u30a1\u30fc
APM.PromoOfferExport.ExportedOffers=\u30a8\u30af\u30b9\u30dd\u30fc\u30c8\u6e08\u30aa\u30d5\u30a1\u30fc
APM.PromoOfferExport.FailedOffers=\u5931\u6557\u3057\u305f\u30aa\u30d5\u30a1\u30fc

#SRE Price Rule Export
APM.PriceRuleExport:\u4fa1\u683c\u30eb\u30fc\u30eb\u30a8\u30af\u30b9\u30dd\u30fc\u30c8

#PromoActivity
PromoActivity.EventType=\u30d7\u30ed\u30e2\u30fc\u30b7\u30e7\u30f3\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u306e\u30a4\u30d9\u30f3\u30c8\u30bf\u30a4\u30d7\u304c\u7121\u52b9\u3067\u3059\u3002

Activity.NoLocations=\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u300c{0}\u300d\u306b\u306f\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u30aa\u30d5\u30a1\u30fc\u3092\u5272\u308a\u5f53\u3066\u308b\u524d\u306b\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
HierarchyMetadata.NotSetupProperly=MD_LIST_DOMAIN \u306b\u306f\u3001DOMAIN_NAME 'SCPO_APM_LOCATION_HIERARCHY' \u3068 'SCPO_APM_PRODUCT_HIERARCHY' \u306e REF_TABLE \u30c7\u30fc\u30bf\u306f\u3042\u308a\u307e\u305b\u3093\u3002

BuyXGetYPriceStrategy.CannotOverrideError=Buy X Get Y \u4fa1\u683c\u6226\u7565\u306f\u4ed6\u306e\u4fa1\u683c\u6226\u7565\u3067\u88dc\u6b63\u3067\u304d\u307e\u305b\u3093\u3002
BOGOPriceStrategy.CannotOverrideError=Buy X Get Y \u4fa1\u683c\u6226\u7565\u306f\u4ed6\u306e\u4fa1\u683c\u6226\u7565\u3067\u88dc\u6b63\u3067\u304d\u307e\u305b\u3093\u3002
CrossImpacted.ImpactedProducts=\u5f71\u97ff\u3042\u308a\u306e\u88fd\u54c1
Total=\u5408\u8a08
Activity.NoLocationsForRequest=\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u300c{0}\u300d\u306b\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002\u8981\u6c42\u3092\u5272\u308a\u5f53\u3066\u308b\u524d\u306b\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u8ffd\u52a0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PromotionsManagement.InsufficientLeadTime=\u4e0d\u5341\u5206\u306a\u30ea\u30fc\u30c9\u30bf\u30a4\u30e0
Offer.MultipleCurrencies=\u9078\u629e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u306f\u8907\u6570\u306e\u901a\u8ca8\u304c\u5b58\u5728\u3057\u307e\u3059\u3002
