# Main resource bundle for APM BusinessObject exceptions, status messages, and log messages

#PromoDFUCollector
PromoDFUCollector.DuplicatePromoPriceStrategy=Auf dieser Hierarchieebene ist bereits eine Preisstrategie vorhanden.
PromoDFUCollector.MissingPromoPriceStrategy=Die Preisstrategie ist auf dieser Hierarchieebene nicht vorhanden.
PromoDFUCollector.ConflictWhenAddingProduct=Es sind ein oder mehrere hinzuzuf\u00fcgende Produkte bereits vorhanden.
PromoDFUCollector.NoProductsFound=Die Suche ergab keine Produkte.
PromoDFUCollector.AssocToActivityResultsInNoProds=Die Standorte in der ausgew\u00e4hlten Aktivit\u00e4t stimmen mit keiner Ihrer urspr\u00fcnglichen Suchkriterien \u00fcberein. Aus diesem Grund wurden alle Produkte aus diesem Angebot entfernt.
PromoDFUCollector.FilterContainsOR=Ihre Datenschutzeinstellungen sind fehlerhaft. Wenden Sie sich an Ihren Systemadministrator.
PromoDFUCollector.FilterContainsUnsupportedTables=Ihre Datenschutzeinstellungen sind fehlerhaft. Wenden Sie sich an Ihren Systemadministrator.

# State
APMStateControl.InvalidTransitionForDate=Das Startdatum des Werbekampagnen-Angebots muss nach oder an dem heutigen Datum liegen.

#PromoAnalysisParams
PromoAnalysisParams.DefaultForecastName=Prognose

#Exceptions
APM.Exception.AllocationCalendarNotFound=Der Zuweisungskalender {0} kann nicht gefunden werden.
APM.Exception.CriteriaNotAvailable=Die folgenden Suchkriterien k\u00f6nnen im Client-Cache nicht gefunden werden: {0}
APM.Exception.UnexpectedCriteriaFinderOperation='PromoDFUCriteriaFinder' wurde unerwartet f\u00fcr einen Anfrage- oder Suchkontext ausgef\u00fchrt. 
PromotionsManagement.Exception.RefreshAggregateAttributeFailed=Fehler beim Aktualisieren des Aggregierungsattributs {0}.
PromotionsManagement.Exception.TotalNodeValueApplication=Fehler beim Auffrischen des Gesamtknotenattributs {0}.
PromotionsManagement.Exception.retrievePriceZoneListForActivity=Fehler beim Ermitteln der Preiszonen f\u00fcr die verkn\u00fcpfte Aktivit\u00e4t.
PromotionsManagement.Exception.RefreshSaveStoriesFailed=Fehler beim Aktualisieren von 'Artikel speichern'.
PromotionsManagement.Exception.RefreshExclusionsFailed=Fehler beim Aktualisieren der Ausschl\u00fcsse.
PromotionsManagement.Exception.HistoryDataLoadFailed=Fehler beim Laden der historischen Daten.
PromotionsManagement.Exception.reloadDFUs=Fehler beim erneuten Laden der Werbekampagnen-DFUs.
PromotionsManagement.Exception.RefreshFcstDataFailed=Fehler beim Aktualisieren der Prognose f\u00fcr die Werbekampagnen-DFU.
PromotionsManagement.Exception.UnsupportedMIDataType=Der Datentyp {0} wird nicht als Marketinginstrumentattribut unterst\u00fctzt.
PromotionsManagement.Exception.OptimizationFailed=Bei der Optimierung ist ein Fehler aufgetreten. Wenden Sie sich an Ihren Systemadministrator.
PromotionsManagement.Exception.ExportFailed=Beim Export ist ein Fehler aufgetreten. Wenden Sie sich an Ihren Systemadministrator.
PromotionsManagement.Exception.CrossImpactsNotSupported=\u00dcberkreuzprodukteinfl\u00fcsse konnten nicht \u00fcber Hierarchieebenen abgeglichen werden. Jede Hierarchieebene kann unabh\u00e4ngig von den anderen optimiert werden.
PromotionsManagement.Exception.UserInformationNotAvailable=Benutzerinformationen f\u00fcr Benutzer {0} konnten nicht ermittelt werden. 

PromotionsManagement.Exception.CollectorServiceNotAvailable=Das System kann Ihre Anfrage nicht bearbeiten, da der SRE-Abholprozess des Werbekampagnenmanagement nicht gestartet wurde. Wenden Sie sich an Ihren Systemadministrator.
PromotionsManagement.Exception.CollectorAuthenticationFailed=Es konnte keine Verbindung zum Anwendungsserver hergestellt werden. Es wird versucht, das Angebot erneut zu laden. Wenden Sie sich an Ihren Systemadministrator, wenn dieses Problem weiterhin besteht. 
PromotionsManagement.Exception.ConnectionTerminated=Die Verbindung zum Anwendungsserver wurde unerwartet beendet. Es wird versucht, das Angebot erneut zu laden. Wenden Sie sich an Ihren Systemadministrator, wenn das Problem weiterhin besteht. 
PromotionsManagement.Exception.CollectorBeanNotFound=Der Anwendungsserver hat ein Objekt angefordert, das nicht mehr g\u00fcltig ist. Das Objekt hat m\u00f6glicherweise das Zeitlimit \u00fcberschritten oder wurde aus dem Speicher entfernt. Es wird versucht, das Angebot erneut zu laden. Wenden Sie sich an Ihren Systemadministrator, wenn das Problem weiterhin besteht.
PromotionsManagement.Exception.NoCollectorCanBeAllocated=Aufgrund der Beschr\u00e4nkungseinstellungen f\u00fcr diesen Auftrag kann Ihre Anfrage nicht verarbeitet werden. Versuchen Sie es sp\u00e4ter erneut, oder wenden Sie sich an Ihren Systemadministrator.
PromotionsManagement.Exception.NoCollectorCanBeAllocatedPartialOfferLoaded=Aufgrund der Beschr\u00e4nkungseinstellungen f\u00fcr diesen Auftrag konnten nicht alle Angebote geladen werden. Versuchen Sie es sp\u00e4ter erneut, oder wenden Sie sich an Ihren Systemadministrator.
PromotionsManagement.Exception.ProcessTableDataLoadFailed=Fehler beim Auff\u00fcllen der Prozesstabelle f\u00fcr die DB-Auswahl.
PromotionsManagement.Exception.ProcessTableDataDeleteFailed=Fehler beim L\u00f6schen der Datens\u00e4tze aus der Prozesstabelle f\u00fcr die DB-Auswahl.
PromotionsManagement.Exception.DropProcessTableFailed=Fehler beim Entfernen der Prozesstabelle f\u00fcr die DB-Auswahl.
PromotionsManagement.Exception.CreateProcessTableFailed=Fehler beim Erstellen der Prozesstabelle f\u00fcr die DB-Auswahl.
PromotionsManagement.Exception.InsertDataLoadFailed=Fehler beim Einf\u00fcgen des Prozesstabelleneintrags f\u00fcr die DB-Auswahl.
PromotionsManagement.Exception.DeleteDataLoadFailed=Fehler beim L\u00f6schen des Prozesstabelleneintrags f\u00fcr die DB-Auswahl.
PromotionsManagement.Exception.DeleteProcessTablesFailed=Fehler beim Entfernen der Prozesstabellen und deren Eintr\u00e4ge f\u00fcr die DB-Auswahl.
PromotionsManagement.Warning.FirstVisitMarkdownAllocation = Preissenkungszuweisung - Erster Besuch muss insgesamt 100 % ergeben
PromotionsManagement.Warning.BouncebackMarkdownAllocation = Bounceback-Preissenkungszuweisung muss insgesamt 100 % ergeben
PromotionsManagement.Exception.UnsupportedVTFDataType=Der Datentyp {0} wird nicht als Handelskampagnenattribut unterst\u00fctzt.
PromotionsManagement.Exception.LogInException=Der Anwendungsserver hat ein Objekt angefordert, das nicht mehr g\u00fcltig ist. Das Objekt hat m\u00f6glicherweise das Zeitlimit \u00fcberschritten oder wurde aus dem Speicher entfernt. Es wird versucht, das Angebot erneut zu laden. Wenden Sie sich an Ihren Systemadministrator, wenn das Problem weiterhin besteht.
PromotionsManagement.Exception.SavingLockedOffer=Das Werbeangebot ist jetzt gesperrt. Die am Angebot vorgenommenen \u00c4nderungen k\u00f6nnen nicht gespeichert werden.
PromotionsManagement.Exception.SavingLockedOfferWithOfferName=Das Werbeangebot {0} ist jetzt gesperrt. Die am Angebot vorgenommenen \u00c4nderungen k\u00f6nnen nicht gespeichert werden.
#Warnings
PromotionsManagement.Warning.RedundantPriceStrategy=Die definierte Preisstrategie ist redundant.
PromotionsManagement.Warning.Integration.ConnectionProblem=Es besteht ein Problem mit der Verbindung zum Werbeserver, wenden Sie sich an Ihren Systemadministrator.
PromotionsManagement.Warning.InadvisableEdit=Eine oder mehrere Ihrer \u00c4nderungen w\u00fcrden dazu f\u00fchren, dass Angebot {0} in Ihren Zugriffsberechtigungen im Nur-Lese-Modus verf\u00fcgbar ist.
PromotionsManagement.Warning.ExceededSearchLimit=Die Kombination von Produkten an Standorten f\u00fcr das Angebot \u00fcbersteigt {0}. Begrenzen Sie den Bereich des Angebots, oder erstellen Sie ein neues.
PromotionsManagement.Warning.NoFeaturedProduct=F\u00fcr das Ver\u00f6ffentlichen eines Angebots ist ein Top-Produkt erforderlich.
PromotionsManagement.Warning.NoPriceStrategy=F\u00fcr das Ver\u00f6ffentlichen eines Preises ist eine Preisstrategie erforderlich.
PromotionsManagement.Warning.NoPriceStrategyOrFeaturedProduct=F\u00fcr das Ver\u00f6ffentlichen eines Angebots sind eine Preisstrategie und ein Top-Produkt erforderlich.
PromotionsManagement.Warning.NoPriceStrategyPublishOffer=F\u00fcr das Ver\u00f6ffentlichen eines Angebots ist eine Preisstrategie erforderlich.
PromotionsManagement.Warning.InvalidFcstStatusMsg=Sie k\u00f6nnen die Prognose nicht ver\u00f6ffentlichen, da der Prognosestatus auf 'Ung\u00fcltig' gesetzt ist.
PromotionsManagement.Warning.Approve.InvalidFcstStatusMsg=Sie k\u00f6nnen das Angebot nicht genehmigen, da der Prognosestatus auf 'Ung\u00fcltig' gesetzt ist.
PromotionsManagement.Warning.SumitForApproval.InvalidFcstStatusMsg=Sie k\u00f6nnen das Angebot nicht zur Genehmigung \u00fcbermitteln, da der Prognosestatus auf 'Ung\u00fcltig' gesetzt ist.
PromotionsManagement.Warning.BlockRetrieval=Die Blockdaten konnten nicht ermittelt werden. Wenden Sie sich an Ihren Systemadministrator.
PromotionsManagement.Warning.OfferBaseDmdOutOfDate = Der Basisbedarf f\u00fcr dieses Angebot ist veraltet. F\u00fchren Sie den Prozess 'Angebote aktualisieren' aus, um die aktuellen Werte zu erhalten.
PromotionsManagement.Warning.InvalidDisplayLevelMsg = Parameter DRM.APM.MARKDOWNALLOCATION.HIERARCHYLEVEL in PriceGlobalParam-Tabelle ist nicht ordnungsgem\u00e4\u00df konfiguriert. Wenden Sie sich an Ihren Systemadministrator.
PromotionsManagement.Warning.IncompleteMarkingOfBuyGetDFU = Alle Produkte m\u00fcssen eine 'Kaufen'- oder 'Bekommen'-Kennzeichnung haben, dabei muss es mindestens ein 'Kaufen'-Produkt und ein 'Bekommen'-Produkt geben.
#SRE Promo Offer Export
APM.PromoOfferExport:Export des Werbekampagnen-Angebots
APM.PromoOfferExport.ProcessedOffers=Verarbeitete Angebote
APM.PromoOfferExport.ExportedOffers=Exportierte Angebote
APM.PromoOfferExport.FailedOffers=Fehlgeschlagene Angebote

#SRE Price Rule Export
APM.PriceRuleExport:Preisregelexport

#PromoActivity
PromoActivity.EventType=Ung\u00fcltiger Ereignistyp f\u00fcr Kampagnenaktivit\u00e4t.

Activity.NoLocations=Aktivit\u00e4t {0} hat keine Standorte. F\u00fcgen Sie Standorte hinzu, bevor Sie das Angebot zuweisen.
HierarchyMetadata.NotSetupProperly=MD_LIST_DOMAIN hat keine REF_TABLE-Daten f\u00fcr DOMAIN_NAME 'SCPO_APM_LOCATION_HIERARCHY' und 'SCPO_APM_PRODUCT_HIERARCHY'.

BuyXGetYPriceStrategy.CannotOverrideError=Eine 'X kaufen, Y bekommen'-Preisstrategie kann nicht durch eine andere Preisstrategie \u00fcberschrieben werden.
BOGOPriceStrategy.CannotOverrideError=Eine BOGO-Preisstrategie kann nicht durch eine andere Preisstrategie \u00fcberschrieben werden.
CrossImpacted.ImpactedProducts=Beeinflusste Produkte
Total=Gesamt
Activity.NoLocationsForRequest=Aktivit\u00e4t {0} hat keine Standorte. F\u00fcgen Sie Standorte hinzu, bevor Sie die Anfrage zuweisen.
PromotionsManagement.InsufficientLeadTime=Unzureichende Durchlaufzeit
Offer.MultipleCurrencies=F\u00fcr die ausgew\u00e4hlten Orte sind mehrere W\u00e4hrungen vorhanden.
