# Main resource bundle for BusinessObject exceptions, status messages, and log messages
0000= Exception syst\u00e8me inconnue - {0}.

Metadata.LoadFailure=Chargement metadata a \u00e9chou\u00e9 avec le message : {0}
Metadata.DimensionLoadFailure=Chargement dimension metadata a \u00e9chou\u00e9 avec le message : {0}

#BusinessObjectMetadata
DataDomain.ParseNumeric=Filtrer une valeur num\u00e9rique {0} a \u00e9chou\u00e9.
DataDomain.LoadFailure=Chargement DataDomain a \u00e9chou\u00e9 avec le message : {0}
Database.LoadMetadataFailure=Une erreur de base de donn\u00e9es s'est produite lors de l'enregistrement Business Object Metadata: {0}
Database.SchemaException=Une erreur de base de donn\u00e9es s'est produite en acc\u00e9dant \u00e0 l'information de colonne : {0}.{1}.{2}
Database.CollectionOfCollectionError=Collection de CollectionAttributeMetadata n'est pas actuellement compatible.
ClientDataManager.InvalidMetadataType=Erreur interne : type d''attribut incorrect : {0}

RemoteException.general=Une erreur syst\u00e8me s''est produite en vous connectant au serveur App avec erreur : {0}

DataManager.BusinessObjectNotFound=BusinessObject requis avec GenericKey {0} introuvable.
DataManager.InvalidAttributeState=L''attribut {0} pour GenericKey {1} est dans un statut incorrect de {2} pour attribut {3}.
DataManager.InvalidOwner=L''attribut {0} pour GenericKey {1} a une r\u00e9f\u00e9rence de propri\u00e9taire incorrecte.
DataManager.invalidChildAsked=La dimension requise {0} a moins d''enfants que {1}.

TVQ.EditorNotSet=EditOperator non sp\u00e9cifi\u00e9 pour le composite avec dimension de temps.  TimePhasedComposite.setValue() est une op\u00e9ration incompatible si EditOperator n'est pas indiqu\u00e9.
TVQ.Unresolveable=L''attribut {0} ne peut \u00eatre r\u00e9solu avec ITimePhasedData

Attribute.SetTimeValueNotSupported=Impossible de d\u00e9terminer une valeur temps pour PrimitiveAttribute, op\u00e9ration incompatible.

Action.ClassNotFound=La classe Action {2} d\u00e9finie pour BusinessObject {0}, Action {1} est introuvable.
Action.ClassNotIAction=La classe Action {2} d\u00e9finie pour BusinessObject {0}, Action {1} n''impl\u00e9mente pas l''interface IAction.
Action.DuplicateMethodNames=La classe Action {2} d\u00e9finie pour BusinessObject {0}, Action {1} a des impl\u00e9mentations multiples de la m\u00e9thode {3}.  Les m\u00e9thodes surcharg\u00e9es ne sont pas compatibles avec les Actions.
Action.MethodNotFound=La m\u00e9thode Action {2}.{3}, d\u00e9finie pour BusinessObject {0}, Action {1}, est introuvable.
Action.MethodNotDefined=La m\u00e9thode Action {2}.{3}, d\u00e9finie pour BusinessObject {0}, Action {1}, n''a pas \u00e9t\u00e9 d\u00e9fini.
Action.ParameterLengthMismatch=Le nombre de param\u00e8tres pour m\u00e9thode Action {2}.{3}, d\u00e9fini pour  BusinessObject {0}, Action {1}, ne correspond pas au nombre de param\u00e8tres dans la m\u00e9thode.
Action.ParameterTypeMismatch=Le type de param\u00e8tres {5} pour m\u00e9thode Action {2}.{3}, d\u00e9fini pour BusinessObject {0}, Action {1}, ne correspond pas au type d\u00e9fini dans la m\u00e9thode qui est {4}.

#Properties
Database.LoadDSPPropertiesFailure=Une erreur de base de donn\u00e9es s'est produite lors de l'acc\u00e8s aux propri\u00e9t\u00e9s DSP : {0}

#Exceptions for edit operators
SpliceOperator.IllegalBooleanCombination=Impossible de calculer une valeur compos\u00e9e pour valeur compos\u00e9e de temps parce que un des composants ne peut pas \u00eatre converti en valeur bol\u00e9enne.
SpliceOperator.IncompatibleTypes=Impossible de calculer une valeur compos\u00e9e pour un valeur compos\u00e9e de temps parce qu'un des composants est d'un type inattendu.
Operator.InvalidTVQCount=Impossible de calculer une valeur compos\u00e9e pour un valeur compos\u00e9e de temps parce qu'un op\u00e9rateur a re\u00e7u un nombre de composants incorrect.
Operator.InvalidType=Impossible de calculer une valeur compos\u00e9e pour un valeur compos\u00e9e de temps parce qu'un des composants est d'un type inattendu.
Operator.InvalidCalendar=Calendrier incorrect.  La date de d\u00e9but ou la date de fin sont situ\u00e9es en dehors de la port\u00e9e de calendrier s\u00e9lectionn\u00e9.

Error.Timeout=Session interrompue parce que inactive.
