# Main resource bundle for BusinessObject exceptions, status messages, and log messages
0000= Excepci\u00f3n de sistema desconocida - {0}.

Metadata.LoadFailure=Error de carga de metadatos con mensaje: {0}
Metadata.DimensionLoadFailure=Error de carga de los metadatos de dimensi\u00f3n con mensaje: {0}

#BusinessObjectMetadata
DataDomain.ParseNumeric=Fall\u00f3 el an\u00e1lisis de {0} de un valor num\u00e9rico.
DataDomain.LoadFailure=Error de carga de DataDomain con mensaje: {0}
Database.LoadMetadataFailure=Se ha producido un error en la base de datos al cargar Business Object Metadata: {0}
Database.SchemaException=Se ha producido un error en la base de datos mientras se obten\u00eda la informaci\u00f3n de la columna: {0}.{1}.{2}
Database.CollectionOfCollectionError=Un conjunto de CollectionAttributeMetadata no se admite actualmente.
ClientDataManager.InvalidMetadataType=Error interno: tipo de atributo incorrecto: {0}

RemoteException.general=Se ha producido un error del sistema durante la conexi\u00f3n al servidor de la aplicaci\u00f3n con error: {0}

DataManager.BusinessObjectNotFound=BusinessObject solicitado con GenericKey {0} no encontrado.
DataManager.InvalidAttributeState=El atributo {0} de Clavegen\u00e9rica {1} tiene un estado inv\u00e1lido de {2} para el atributo propietario {3}.
DataManager.InvalidOwner=El atributo {0} de ClaveGen\u00e9rica {1} tiene una referencia de propietario inv\u00e1lida.
DataManager.invalidChildAsked=La dimensi\u00f3n solicitada {0} tiene menos hijos que {1}.

TVQ.EditorNotSet=Un EditOperator no especificado para el valor compuesto por etapas.  TimePhasedComposite.setValue() es una operaci\u00f3n no admitida si el EditOperator no est\u00e1 especificado.
TVQ.Unresolveable=El atributo {0} no se puede resolver a ITimePhasedData

Attribute.SetTimeValueNotSupported=No se puede fijar un valor de tiempo para un AtributoPrimitivo, la operaci\u00f3n no es compatible.

Action.ClassNotFound=No se ha encontrado la clase de acci\u00f3n {2} definida para BusinessObject {0}, acci\u00f3n {1}.
Action.ClassNotIAction=La clase de acci\u00f3n {2} definida para BusinessObject {0}, acci\u00f3n {1} no implementa la interfaz de IAction.
Action.DuplicateMethodNames=La clase de acci\u00f3n {2} definida para BusinessObject {0}, acci\u00f3n {1} tiene m\u00faltiples implementaciones del m\u00e9todo {3}.  Las acciones no admiten m\u00e9todos sobrecargados.
Action.MethodNotFound=No se ha encontrado el m\u00e9todo de acci\u00f3n {2}.{3}, definido para BusinessObject {0}, acci\u00f3n {1}.
Action.MethodNotDefined=No se ha definido el m\u00e9todo de acci\u00f3n {2}.{3}, definido para BusinessObject {0}, acci\u00f3n {1}.
Action.ParameterLengthMismatch=El n\u00famero de par\u00e1metros pasado al m\u00e9todo de acci\u00f3n {2}.{3}, definido para BusinessObject {0}, la acci\u00f3n {1}, no corresponde al n\u00famero de par\u00e1metros en el m\u00e9todo.
Action.ParameterTypeMismatch=El tipo de par\u00e1metro {5} para el m\u00e9todo de acci\u00f3n {2}.{3}, definido para BusinessObject {0}, la acci\u00f3n {1}, no corresponde al tipo definido en el m\u00e9todo {4}.

#Properties
Database.LoadDSPPropertiesFailure=Se ha producido un error en la base de datos al acceder a las propiedades DSP: {0}

#Exceptions for edit operators
SpliceOperator.IllegalBooleanCombination=No se pudo calcular el valor del compuesto por etapas porque uno de los componentes no se puede convertir a un valor booleano.
SpliceOperator.IncompatibleTypes=No se pudo calcular el valor del compuesto por etapas porque uno de los componentes devolvi\u00f3 un tipo inesperado.
Operator.InvalidTVQCount=No se pudo calcular el valor del compuesto por etapas porque el operador recibi\u00f3 el n\u00famero incorrecto de componentes.
Operator.InvalidType=No se pudo calcular el valor del compuesto por etapas porque uno de los componentes devolvi\u00f3 un tipo inesperado.
Operator.InvalidCalendar=Calendario inv\u00e1lido. Fecha de inicio o fin est\u00e1 fuera del rango del calendario seleccionado.

Error.Timeout=La sesi\u00f3n ha terminado por falta de actividad.
