# Main resource bundle for BusinessObject exceptions, status messages, and log messages
0000= Unbekannte Systemausnahme - {0}.

Metadata.LoadFailure=Laden von Metadaten mit folgender Meldung fehlgeschlagen: {0}
Metadata.DimensionLoadFailure=Laden von Dimensionsmetadaten mit folgender Meldung fehlgeschlagen: {0}

#BusinessObjectMetadata
DataDomain.ParseNumeric=Parsen eines numerischen Werts {0} fehlgeschlagen.
DataDomain.LoadFailure=Laden von DataDomain mit folgender Meldung fehlgeschlagen: {0}
Database.LoadMetadataFailure=Beim Laden von Gesch\u00e4ftsobjekt-Metadaten ist ein Datenbankfehler aufgetreten: {0}
Database.SchemaException=Beim Abrufen von Spalteninformationen ist ein Datenbankfehler aufgetreten: {0}.{1}.{2}
Database.CollectionOfCollectionError=Die Sammlung von CollectionAttributeMetadata wird momentan nicht unterst\u00fctzt.
ClientDataManager.InvalidMetadataType=Interner Fehler: falscher Attributtyp: {0}

RemoteException.general=Nach dem fehlgeschlagenen Versuch, eine Verbindung zum Anwendungsserver herzustellen, ist ein Systemfehler aufgetreten: {0}

DataManager.BusinessObjectNotFound=Das angeforderte BusinessObject mit GenericKey {0} wurde nicht gefunden.
DataManager.InvalidAttributeState=Das Attribut {0} f\u00fcr GenericKey {1} hat einen ung\u00fcltigen Zustand von {2} f\u00fcr das besitzende Attribut {3}.
DataManager.InvalidOwner=Das Attribut {0} f\u00fcr GenericKey {1} hat eine ung\u00fcltige Besitzerreferenz.
DataManager.invalidChildAsked=Die angeforderte Dimension {0} hat weniger untergeordnete Elemente als {1}.

TVQ.EditorNotSet=F\u00fcr das zeitlich abgestimmte Composite wurde kein EditOperator angegeben. Die Operation TimePhasedComposite.setValue() wird nicht unterst\u00fctzt, wenn der EditOperator nicht angegeben wurde.
TVQ.Unresolveable=Das Attribut {0} kann nicht in ITimePhasedData aufgel\u00f6st werden

Attribute.SetTimeValueNotSupported=F\u00fcr ein PrimitiveAttribute kann kein Zeitwert festgelegt werden. Die Operation wird nicht unterst\u00fctzt.

Action.ClassNotFound=Die f\u00fcr Gesch\u00e4ftsobjekt {0}, Aktion {1} definierte Aktionsklasse {2} wurde nicht gefunden.
Action.ClassNotIAction=Die f\u00fcr Gesch\u00e4ftsobjekt {0}, Aktion {1} definierte Aktionsklasse {2} implementiert die IAction-Schnittstelle nicht.
Action.DuplicateMethodNames=Die f\u00fcr Gesch\u00e4ftsobjekt {0}, Aktion {1} definierte Aktionsklasse {2} verf\u00fcgt \u00fcber mehrere Implementierungen der Methode {3}. \u00dcberladene Methoden werden f\u00fcr Aktionen nicht unterst\u00fctzt.
Action.MethodNotFound=Die f\u00fcr Gesch\u00e4ftsobjekt {0}, Aktion {1} definierte Aktionsmethode {2}.{3} wurde nicht gefunden.
Action.MethodNotDefined=Die f\u00fcr Gesch\u00e4ftsobjekt {0}, Aktion {1} definierte Aktionsmethode {2}.{3} wurde nicht definiert.
Action.ParameterLengthMismatch=Die Anzahl der Parameter, die an die f\u00fcr Gesch\u00e4ftsobjekt {0}, Aktion {1} definierte Aktionsmethode {2}.{3} weitergegeben wurden, stimmt nicht mit der Anzahl der Parameter in der Methode \u00fcberein.
Action.ParameterTypeMismatch=Der Typ des Parameters {5} f\u00fcr die Aktionsmethode {2}.{3}, die f\u00fcr Gesch\u00e4ftsobjekt {0}, Aktion {1}, definiert wurde, stimmt nicht mit dem in der Methode definierten Typ {4} \u00fcberein.

#Properties
Database.LoadDSPPropertiesFailure=Beim Zugreifen auf die DSP-Eigenschaften ist ein Datenbankfehler aufgetreten: {0}

#Exceptions for edit operators
SpliceOperator.IllegalBooleanCombination=Der Composite-Wert f\u00fcr das zeitlich abgestimmte Composite konnte nicht berechnet werden, weil eine der Komponenten nicht in einen booleschen Wert umgewandelt werden konnte.
SpliceOperator.IncompatibleTypes=Der Composite-Wert f\u00fcr das zeitlich abgestimmte Composite konnte nicht berechnet werden, weil eine der Komponenten einen unerwarteten Typ zur\u00fcckgegeben hat.
Operator.InvalidTVQCount=Der Composite-Wert f\u00fcr das zeitlich abgestimmte Composite konnte nicht berechnet werden, weil der Operator die falsche Anzahl von Komponenten erhalten hat.
Operator.InvalidType=Der Composite-Wert f\u00fcr das zeitlich abgestimmte Composite konnte nicht berechnet werden, weil eine der Komponenten einen unerwarteten Typ zur\u00fcckgegeben hat.
Operator.InvalidCalendar=Ung\u00fcltiger Kalender. Start- oder Enddatum liegt au\u00dferhalb des ausgew\u00e4hlten Kalenderbereichs.

Error.Timeout=Sitzung ist wegen Zeit\u00fcberschreitung aufgrund von Inaktivit\u00e4t abgelaufen.
