# Main resource bundle for IGP (and related utilities) exceptions, status messages, 
# and log messages
#
# Error Messages 
IGP0001=IGP0001: No se ha encontrado la tabla especificada en el archivo xml: 
IGP0002=IGP0002: No se ha definido ninguna URL en el archivo de propiedades para AppName: 
IGP0003=IGP0003: El archivo de configuraci\u00f3n XML contiene el nombre de tabla de destino duplicado: 
IGP0004=IGP0004: El \u00edndice no debe contener el OID de clave primaria: 
IGP0005=IGP0005: El archivo XML no contiene ning\u00fan OID para la columna: 
IGP0006=IGP0006: El archivo XML tiene OID indefinido: 
IGP0007=IGP0007: La columna definida por el usuario ya existe en el esquema de destino: 
IGP0008=IGP0008: El archivo XML contiene una columna no existente: 
IGP0009=IGP0009: El archivo XML contiene una tabla no existente: 
IGP0010=IGP0010: El archivo XML contiene un \u00edndice no existente: 
IGP0011=IGP0011: El archivo XML especifica una tabla de encabezados no existente: 
IGP0012=IGP0012: El nombre corto de tabla especificado en el archivo XML no debe tener m\u00e1s de 18 caracteres: 
IGP0013=IGP0013: El nombre corto de tabla ya se ha especificado en el archivo XML: 
IGP0014=IGP0014: Par\u00e1metro n\u00ba
IGP0015= no encontrado
IGP0016=Compruebe que se ha establecido un valor correcto para la propiedad: 
IGP0017=IGP0017:IGP no puede recuperar el valor para NLS_NCHAR_CHARACTERSET de V$NLS_PARAMETERS
IGP0018=IGP0018: IGP no puede recuperar el valor para la columna NCHAR o NVARCHAR2 en la tabla: 
IGP0019=IGP0019: La base de datos no se ha inicializado correctamente.  Ejecute igp_init de nuevo.
IGP0020=IGP0020: 
IGP0021=El OID definido en el archivo XML
IGP0022=contiene una columna 
IGP0023=que no existe en la tabla 
IGP0024=Consulte el archivo de configuraci\u00f3n XML para obtener una lista de restricciones completa.


#############################################
#############################################
#
#
#          !!!Notice!!!
#
# Before printing any error messages
#to the screen, ensure that you've 
#indicated which table the error pertains
#to. Call the getExternalizedText()
#routine with IGP0025 and append the
#current table name.
#
#############################################
#############################################

IGP0025=ERROR AL PROCESAR LA TABLA: 



IGP0026=IGP0026: No se ha encontrado ning\u00fan \u00edndice de clave primaria para la tabla: 
IGP0027=IGP0027: No se puede analizar la funci\u00f3n de nivel de columna para: 
IGP0028=IGP0028: 
IGP0029=no se ha encontrado la columna para la funci\u00f3n de columna especificada.
IGP0030=IGP0030:No se ha encontrado el nombre de espacio de tabla en la base de datos: 
IGP0031=IGP0031: No se ha especificado ning\u00fan alias en el archivo XML
IGP0032=para el OID de auto-referencia: 
IGP0033=Error con UDC n\u00ba
IGP0034=IGP0034: No se ha encontrado el tipo en la propiedad UDC.
IGP0035=IGP0035: Se ha especificado un valor DEFAULT no v\u00e1lido.
IGP0036=IGP0036: Especificaci\u00f3n de valor NO NULO no v\u00e1lido.
IGP0037=IGP0037: No se ha encontrado ninguna definici\u00f3n UDC en el archivo de propiedades.
IGP0038=IGP0038: No se han encontrado par\u00e9ntesis coincidentes para la especificaci\u00f3n de tipo.
IGP0039=IGP0039: Se ha encontrado una cadena desconocida o no admitida.
IGP0040=IGP0040: El prefijo de tabla para la creaci\u00f3n de datos de referencia
IGP0041=no debe tener m\u00e1s de 6 caracteres.
IGP0042=IGP0042: El procedimiento almacenado n\u00ba
IGP0043=no se ha encontrado en el archivo de propiedades para
IGP0044=IGP0044: La columna a la que se hace referencia 
IGP0045=no existe en el esquema de destino.
IGP0046=IGP0046: sub_oid 
IGP0047=, sin coincidencia en el archivo XML.
IGP0048=IGP0048: Tipo de estad\u00edstica no reconocido:
IGP0049=IGP0049: Consulte los errores anteriores relacionados con el ajuste del SQL generado.
IGP0050=IGP0050: El invocador del IGP debe tener concedido SELECT_CATALOG_ROLE.



###########################################################################
# General Error messages for PERC, JRU
#
# We don't want specific text to be printed because of the possibility
#    of being called in different ways
###########################################################################

##
# General Errors and PERC errors start at 0001
##
IGPUTIL0001=0001: El valor FAILURE RATE debe oscilar entre 0 y 100 (ambos inclusive) y debe ser un n\u00famero entero
IGPUTIL0002=0002: No se ha definido ninguna URL en el archivo de propiedades para AppName: 
IGPUTIL0003=0003: No se ha podido establecer conexi\u00f3n con la base de datos:
IGPUTIL0004=0004: Error al recuperar una fila de la tabla INTJOBS: 
IGPUTIL0005=0005: No se han encontrado filas en INTJOBS para las claves coincidentes:
IGPUTIL0006=<nombre de usuario> <contrase\u00f1a> <appName>
IGPUTIL0007=Muestra este mensaje y sale del programa
IGPUTIL0008=nombre de usuario
IGPUTIL0009=Nombre de usuario de Oracle
IGPUTIL0010=contrase\u00f1a
IGPUTIL0011=Contrase\u00f1a de Oracle
IGPUTIL0012=appName
IGPUTIL0013=Nombre de aplicaci\u00f3n que permite la conexi\u00f3n con la base de datos
IGPUTIL0014=Informaci\u00f3n de IGPProperty.properties
IGPUTIL0015=Uso:
IGPUTIL0016=Especificado para cambiar nombre de Ide. de trabajo
IGPUTIL0017=0017: El primer par\u00e1metro de igpjobmanager debe ser -r o -s
IGPUTIL0018=<nombre_tabla_destino>
IGPUTIL0019=<nombre_tabla_interfaz> <idtrabajo> [<tasa_error_aceptable>]
IGPUTIL0020=Especificado para recuperaci\u00f3n de c\u00f3digo de error
IGPUTIL0021=nombre_tabla_destino
IGPUTIL0022=Nombre de tabla activa para la que
IGPUTIL0023=IGP est\u00e1 procesando las filas en
IGPUTIL0024=nombre_tabla_interfaz
IGPUTIL0025=Tabla de interfaz cuyas filas est\u00e1
IGPUTIL0026=procesando IGP
IGPUTIL0027=id de trabajo
IGPUTIL0028=La Ide. de trabajo que identifica esta ejecuci\u00f3n de 
IGPUTIL0029=IGP-procedimientos almacenados generados
IGPUTIL0030=tasa_error_aceptable
IGPUTIL0031=Tasa de error 
IGPUTIL0032=aceptable para continuar con el procesamiento
IGPUTIL0033=Valor predeterminado
IGPUTIL0034=No se han encontrado filas en INTJOBS para las claves coincidentes:


##
# Errors pertaining to JRU start at 1001
##
IGPUTIL1001=1001: No se ha podido crear un nuevo ID DE TRABAJO predeterminado: 
IGPUTIL1002=1002: Se ha producido un error al cambiar el nombre de las Ide. DE TRABAJO:
IGPUTIL1003=1003: No se ha cambiado el nombre de ninguna Ide. de trabajo.
IGPUTIL1004=Compruebe que la Ide. de trabajo existe en la tabla INTJOBS.
IGPUTIL1005=Los ID DE TRABAJO distinguen entre may\u00fasculas y min\u00fasculas. 
IGPUTIL1006=[<id de trabajo anterior> [<nuevo id de trabajo>]]
IGPUTIL1007=id de trabajo anterior
IGPUTIL1008=ID de trabajo que se va a sustituir - se establece de forma predeterminada en 'INT_JOB'
IGPUTIL1009=nuevo id de trabajo
IGPUTIL1010=Ide. de trabajo de sustituci\u00f3n - se establece de forma predeterminada en el valor jobid_datestamp anterior


###
# XML Generator Error Messages
#
# These errors start at 8001
###
IGPXML8001=IGPXML8001: Falta el valor FROM_TAB en la relaci\u00f3n para
IGPXML8002=IGPXML8002: Falta el valor FROM_COL en la relaci\u00f3n para
IGPXML8003=IGPXML8003: Falta el valor TO_COL en la relaci\u00f3n EXTERNAL o FOREIGN KEY para
IGPXML8004=IGPXML8004: Falta el valor TO_TAB en la relaci\u00f3n FOREIGN KEY para
IGPXML8005=IGPXML8005: Falta el valor de la columna VALUE en la relaci\u00f3n RANGE para
IGPXML8006=IGPXML8006: Falta el valor OPERATOR en la relaci\u00f3n RANGE para
IGPXML8007=IGPXML8007: Falta el valor SUB_OID en la relaci\u00f3n OC para
IGPXML8008=IGPXML8008: Falta el valor DESIRED_TAB para
IGPXML8009=IGPXML8009: Falta el valor DESIRED_COL para
IGPXML8010=IGPXML8010: Falta el valor COL_NAME para
IGPXML8011=IGPXML8011: Falta el valor FN_NAME para
IGPXML8012=IGPXML8012: Falta el valor OID_NAME para
IGPXML8013=IGPXML8013: Falta el valor SP_NAME para
IGPXML8014=IGPXML8014: Falta el valor REF_TAB_NAME para
IGPXML8015=IGPXML8015: No se ha encontrado un valor SCHEMA_NAME coincidente para
IGPXML8016=IGPXML8016: 
IGPXML8017=no existe. La base de datos no se ha configurado correctamente.

IGPXML8500=Comprobar
IGPXML8501=vista para corregir el error.
IGPXML9998=Uso: igpxmlgen [-h] <nombreusuario> <contrase\u00f1a> <APPNAME> <NombreEsquema> [<nombrearchivo>]
IGPXML9999=-h = Imprime este mensaje


##
# Utilities should look at these to determine what to prepend the error message with
# 
# These errors start at 9001
##
IGPUTIL9001=IJM
IGPUTIL9002=PERC
IGPUTIL9003=JRU
IGPUTIL9004=igpjobmanager
IGPUTIL9005=porc
IGPUTIL9006=jru


# Help Messages
IGP1001=Uso: igp [-h] [-u] <nombre de usuario> <contrase\u00f1a> <nombre de archivo de configuraci\u00f3n> <APPNAME> [<nombre de tabla>]
IGP1002=-h = Imprime este mensaje
IGP1003=-u = Imprime una lista de los usuarios que se encuentran conectados con el mismo nombre de inicio de sesi\u00f3n

