# General Server-side messages
Unknown_Error=Ocorreu um erro desconhecido.\n
Database_Error=Ocorreu um erro de banco de dados.\n

# These messages are common to all batch processes
Batch002=Problema no login com o servidor \"{0}\". Saindo com erro.
Batch003=Erro de autentica\u00e7\u00e3o do usu\u00e1rio.  Saindo com erro.
Batch006=N\u00e3o \u00e9 poss\u00edvel abrir o arquivo de propriedades: {0}.  Saindo com erro.
Batch007=N\u00e3o \u00e9 poss\u00edvel ler o arquivo de propriedades: {0}.  Saindo com erro.
Batch008={0} n\u00e3o tem permiss\u00e3o para executar esta opera\u00e7\u00e3o.  Saindo com erro.
Batch009=O {0} no arquivo \nde propriedades {1} est\u00e1 em branco ou com espa\u00e7os em branco.  Saindo com erro.
Batch010=O TraceFileDirectory especificado no\n arquivo propriedades {0} n\u00e3o existe.  Saindo com erro.
Batch011=O valor associado a {0} no arquivo \nde propriedades {1} \u00e9 inv\u00e1lido. \nEle deve ser verdadeiro ou falso.  Saindo com erro.
Batch012=O valor associado a {0} no arquivo \nde propriedades {1} \u00e9 inv\u00e1lido. \nEle deve ser desligado, conciso ou detalhado.  Saindo com erro.
Batch013=O valor associado a traceDateFormat no\n arquivo de propriedades {0} \u00e9 inv\u00e1lido.\nSaindo com erro.
Batch014={0} foi conclu\u00eddo com \u00eaxito.
Batch015={0} foi conclu\u00eddo com avisos.  Saindo com avisos.
Batch016={0} foi conclu\u00eddo com erros.  Saindo com erro.
Batch019={0} colocou todas as regras de neg\u00f3cio em fila com \u00eaxito.
Batch020=Nenhuma regra de neg\u00f3cios foi colocada em fila.
Batch021={0} foi conclu\u00eddo com erros. O usu\u00e1rio conectado n\u00e3o tem permiss\u00e3o para executar as regras no processo de neg\u00f3cio:{1};

# These messages are used by the NWProcessBusinessRule batch process
BR001=Uso:\nNWProcessBusinessRule\n[-user <user>]\n[-credentials <encrypted credentials file>]\n[-M]  Exibir mapeamento do tipo de regra de neg\u00f3cio.\n[-A]  Processar todas as regras de neg\u00f3cio definidas. V\u00e1lido somente com -C e/ou -E.\n[-B\"application1,application2\"]   Processar todas as regras de neg\u00f3cio\n definidas para os processos de neg\u00f3cio especificados (ou seja, aplicativos). Digite\n cada nome de processo separado por um caractere separador definido pelo usu\u00e1rio.\n O caractere separador padr\u00e3o \u00e9 uma \",\" v\u00edrgula. Para usar um caractere\n separador diferente, modifique o arquivo NWProcessBusinessRule.properties.\n N\u00e3o \u00e9 v\u00e1lido com -A ou -N.\n [-T\"ruleType1, ruleType2\"]   Processe todas as regras de neg\u00f3cio definidas\n dos tipos de regras de neg\u00f3cio especificados, para um determinado aplicativo.\n -B \u00e9 necess\u00e1rio com -T, e apenas um aplicativo pode ser especificado.\n Digite cada tipo de regra separado por um caractere separador definido pelo usu\u00e1rio.\n O caractere separador padr\u00e3o \u00e9 uma \",\" v\u00edrgula. Para usar um caractere\n separador diferente, modifique o arquivo NWProcessBusinessRule.properties.\n [-N\"ruleName1, ruleName2\"]   Processe as regras de neg\u00f3cio nomeadas.\n Digite o nome de cada\n regra de neg\u00f3cio separada por um caractere separador definido pelo usu\u00e1rio. O caractere separador\n padr\u00e3o \u00e9 uma \",\" v\u00edrgula. Para usar um caractere separador diferente\n, modifique o arquivo NWProcessBusinessRule.properties.\n V\u00e1lido somente com -C e/ou -E.\n [-E\"enterpriseName\"]   Processe as regras pertencentes \u00e0 empresa determinada,\nem vez da empresa do usu\u00e1rio. A empresa determinada deve estar na\n hierarquia da empresa do usu\u00e1rio.\n [-C]  Processe tamb\u00e9m regras de processos pertencentes a empresas filhas.\n [-H] Mostrar uso.\n\n\n Ex. 1: NWProcessBusinessRule -credentials credentials.txt -A\n\n Ex. 2: NWProcessBusinessRule -credentials credentials.txt -user userName -A\n\n Ex. 3: NWProcessBusinessRule -credentials credentials.txt\n -B\"Collaborate,MarketManager\"\n\n Ex. 4: NWProcessBusinessRule -credentials credentials.txt\n -B\"Collaborate\" -T\"ComparisonEvent,PlanningItemChange\"\n\n Ex. 5: NWProcessBusinessRule -credentials credentials.txt -NWestCoastComparisonRule \n\" \n

BR002=Nenhuma regra de neg\u00f3cio correspondente a \"{0}\" encontrada para a empresa \"{1}\".
BR006=A regra de neg\u00f3cio \"{0}\" na empresa \"{1}\" n\u00e3o pode ser processada. As regras de neg\u00f3cio em tempo real s\u00e3o processadas apenas internamente.
BR009=Tipo de regra de neg\u00f3cio \"{0}\" associado ao processo de neg\u00f3cio \"{1}\" n\u00e3o encontrado.
BR015=Regras de processamento para o processo de neg\u00f3cio \"{0}\", empresa \"{1}\".
BR016=Regras de processamento para processos de neg\u00f3cios \"{0}\", tipo de regra \"{1}\", empresa \"{2}\".
BR026=Op\u00e7\u00e3o -B<businessProcessName> necess\u00e1rio com -T<RuleType>. Consulte Uso.
BR027=Op\u00e7\u00e3o inv\u00e1lida. Consulte Uso.
BR029=A op\u00e7\u00e3o -N\"ruleName\" exige um nome de regra de neg\u00f3cio. Consulte Uso.
BR030=A op\u00e7\u00e3o -B\"businessProcessName\" exige um nome de processo de neg\u00f3cios. Consulte Uso.
BR031=A op\u00e7\u00e3o -T\"RuleType\" exige um tipo de regra de neg\u00f3cio. Consulte Uso.
BR032=Erro ao processar a regra: {0}.
BR033=A op\u00e7\u00e3o -E\"enterpriseName\" exige um nome de empresa. Consulte Uso.
BR066=Pelo menos uma das op\u00e7\u00f5es -A, -B, -N \u00e9 necess\u00e1ria com a op\u00e7\u00e3o -E.
BR067=Pelo menos uma das op\u00e7\u00f5es -A, -B, -N \u00e9 necess\u00e1ria com a op\u00e7\u00e3o -C.
BR068=Pelo menos uma das op\u00e7\u00f5es -M, -A, -B, -N \u00e9 necess\u00e1ria.
BR069=A op\u00e7\u00e3o -A \u00e9 v\u00e1lida apenas com -C e/ou -E.
BR070=A op\u00e7\u00e3o -N \u00e9 v\u00e1lida somente com -C e/ou -E.
BR071=Os tipos de regra podem ser especificados somente para um \u00fanico processo de neg\u00f3cio.
BR072=Processo de neg\u00f3cio \"{0}\" n\u00e3o encontrado.
BR075=Nome do conjunto de conex\u00e3o n\u00e3o definido para o processo de neg\u00f3cio \"{0}\".
BR077=Empresa \"{0}\" n\u00e3o encontrada, ou n\u00e3o est\u00e1 na hierarquia de empresas do usu\u00e1rio.
BR078=Processo de neg\u00f3cio \"{0}\" n\u00e3o encontrado, ou n\u00e3o est\u00e1 acess\u00edvel para o usu\u00e1rio.
JobIdDisplay=A ID do trabalho para este processo \u00e9:
TimeOutMsg=O tempo de espera de {0} segundos \u00e9 maior do que o tempo definido:{1} segundos.
FailureDetailMsg=NWPRocessBusinessRule:ID da tarefa:{0}; ID da regra de neg\u00f3cio:{1}; Status da regra: Motivo para falha de {2}: {3}
WarningDetailMsg=NWPRocessBusinessRule:ID da tarefa:{0}; ID da regra de neg\u00f3cio:{1}; Status da regra: Mensagem de aviso de {2}: {3}
SuccessDetailMsg=NWPRocessBusinessRule:ID da tarefa:{0}; ID da regra de neg\u00f3cio:{1}; Status da regra: Mensagem informativa de {2}: {3}
StatusSummaryStart=*** Resumo do status da regra de neg\u00f3cio - In\u00edcio ***
StatusSummaryEnd=*** Resumo do status da regra de neg\u00f3cio - Fim ***
RuleErrorOrWarning=Regra conclu\u00edda com erro ou aviso. Clique no status para ver os detalhes.

# These messages are used by the Notification process
NE008=Arquivo de modelo \"{0}\" n\u00e3o encontrado. Voc\u00ea deve verificar se o arquivo est\u00e1 localizado no diret\u00f3rio definido por mailTemplateDir no arquivo monitor.properties.
ResolutionPath=Caminho da Resolu\u00e7\u00e3o
ResolutionPathWithColon=Caminho da Resolu\u00e7\u00e3o:
SystemAlertSub=Alerta do Sistema Monitor
SystemAlertBody=O seguinte usu\u00e1rio/(destino do escalonamento) n\u00e3o recebeu um alerta do Monitor devido a um endere\u00e7o de e-mail ausente/inv\u00e1lido: {0}.
Invalid_SMTP_Server=Este servidor SMTP \u00e9 inv\u00e1lido ou est\u00e1 inativo:{0}.
SummaryEMailSubject=Informa\u00e7\u00f5es de resumo do alerta do sistema.

# These messages are used by the NWReloadServer batch process
SM001=Uso:\nNWReloadServer\n[-user <user>]\n[-credentials <encrypted credentials file>]\n[-T] Recarregar modelos para a notifica\u00e7\u00e3o\n[-X<serverName>] Nome do servidor\n[-H] Exibir uso.\n\n\nEx. 1: NWReloadServer -credentials credentials.txt -T\n\nEx 2: NWReloadServer -credentials credentials.txt -user userName -T\n\nEx 3: NWReloadServer -credentials credentials.txt -T -XmyServer\n\n
SM002=Erro ao recarregar os modelos.
SM003=A op\u00e7\u00e3o -X\"serverName\" exige um nome de servidor. Consulte Uso.
SM004=Pelo menos uma das op\u00e7\u00f5es -T, -X, -H \u00e9 necess\u00e1ria.
MappingHeader=\nMapeamento do tipo de regra de neg\u00f3cio:\n- Ao especificar um tipo de regra de neg\u00f3cio usando o par\u00e2metro -T, use o\nnome exibido entre '(' ')'.\n.\n
MappingDetail=\t {0} {1} ({2})


# These messages are used by the NWWakeBackgroundProcess batch process
WB001=Uso:\nNWWakeBackgroundProcess\n[-user <user>]\n[-credentials <encrypted credentials file>]\n[-N] Ativar o processo de notifica\u00e7\u00e3o de exce\u00e7\u00f5es de segundo plano\n[-R] Ativar o processo de resolu\u00e7\u00e3o autom\u00e1tica de exce\u00e7\u00f5es em segundo plano\n[-H] Exibir uso.\n\n\nEx. 1: NWWakeBackgroundProcess -credentials credentials.txt -N\n\nEx 2: NWWakeBackgroundProcess -credentials credentials.txt -user userName -R\n\n
WB002=Pelo menos uma das op\u00e7\u00f5es -N ou -R \u00e9 necess\u00e1ria.
WB003=A op\u00e7\u00e3o -N n\u00e3o \u00e9 v\u00e1lida com -R.
WB004=A op\u00e7\u00e3o -R n\u00e3o \u00e9 v\u00e1lida com -N.
WB005=Erro ao processar ativa\u00e7\u00e3o: {0}.

