# General Server-side messages
Unknown_Error=Se ha producido un error desconocido.\n
Database_Error=Se ha producido un error de base de datos.\n

# These messages are common to all batch processes
Batch002=Problema al iniciar sesi\u00f3n en el Servidor \"{0}\". Saliendo con errores.
Batch003=Error al autenticar el usuario.  Saliendo con errores.
Batch006=No se ha podido abrir el archivo de propiedades: {0}.  Saliendo con errores.
Batch007=No se ha podido leer el archivo de propiedades: {0}.  Saliendo con errores.
Batch008={0} no dispone de permiso para realizar esta operaci\u00f3n.  Saliendo con errores.
Batch009={0} en archivo de propiedades {1} \nest\u00e1 en blanco o tiene espacios en blanco.  Saliendo con errores.
Batch010=El traceFileDirectory especificado en el archivo de \npropiedades {0} no existe.  Saliendo con errores.
Batch011=El valor asociado con {0} en el archivo de \npropiedades {1} no es v\u00e1lido. \nDebe ser verdadero o falso.  Saliendo con errores.
Batch012=El valor asociado con {0} en el archivo de \npropiedades {1} no es v\u00e1lido. \nDebe ser del tipo desactivado, conciso o detallado. Saliendo con errores.
Batch013=El valor asociado con traceDateFormat en el \narchivo de propiedades {0} no es v\u00e1lido.\nSaliendo con errores.
Batch014={0} se complet\u00f3 correctamente.
Batch015={0} completado(s) con advertencias.  Saliendo con advertencias.
Batch016={0} completado(s) con errores.  Saliendo con errores.
Batch019={0} a\u00f1adi\u00f3 todas las reglas de negocios a la cola correctamente.
Batch020=Ninguna de las reglas de negocios se a\u00f1adi\u00f3 a la cola.
Batch021={0} completado(s) con errores. El usuario conectado no dispone de permisos para ejecutar reglas en el proceso de negocios:{1};

# These messages are used by the NWProcessBusinessRule batch process
BR001=Uso:\nNWProcessBusinessRule\n[-user <usuario>]\n[-credentials <archivo de credenciales cifrado>]\n[-M] Mostrar mapeo de tipo de regla de negocios.\n[-A]  Procesar todas las reglas de negocios definidas. S\u00f3lo tiene validez con -C y/o -E.\n[-B\"application1,application2\"]  Procesar todas las reglas de negocios definidas\n para los procesos de negocios dados (es decir, aplicaciones). Introduzca cada\n nombre de proceso separado por un caracter separador definido por el usuario.\n El caracter separador predeterminado es una \",\" coma. Para usar un caracter\n separador diferente, modifique el archivo NWProcessBusinessRule.properties.\n No tiene validez con -A o -N.\n[-T\"ruleType1,ruleType2\"]  Procesar todas las reglas de negocios definidas\n de los tipos de reglas de negocios dados, para una aplicaci\u00f3n dada.\n -B se requiere con -T, y se puede especificar s\u00f3lo una aplicaci\u00f3n.\n Introduzca cada tipo de regla separado por un caracter separador definido por el usuario.\n El caracter separador predeterminado es una \",\" coma. Para usar un caracter\n separador diferente, modifique el archivo NWProcessBusinessRule.properties.\n[-N\"ruleName1,ruleName2\"]   Procesar las reglas de negocios llamadas.\n Introduzca cada nombre de regla de negocios\n separado por un caracter separador definido por el usuario. El caracter separador\n predeterminado es una \",\" coma. Para usar un caracter separador diferente, \n modifique el archivo NWProcessBusinessRule.properties.\n Tiene validez s\u00f3lo con -C y/o -E.\n[-E\"enterpriseName\"]   Procesar reglas que pertenecen a la empresa dada,\nen lugar de la empresa del usuario. La empresa dada debe estar en la\njerarqu\u00eda de empresa del usuario.\n [-C]  Tambi\u00e9n procese reglas pertenecientes a empresas secundarias.\n [-H]  Mostrar uso.\n \n\n Ej 1: NWProcessBusinessRule -credentials credentials.txt -A\n\n Ej 2: NWProcessBusinessRule -credentials credentials.txt -user userName -A\n\n Ej 3: NWProcessBusinessRule -credentials credentials.txt\n -B\"Collaborate,MarketManager\"\n\n Ej 4: NWProcessBusinessRule -credentials credentials.txt\n -B\"Collaborate\" -T\"ComparisonEvent,PlanningItemChange\"\n\n Ej 5: NWProcessBusinessRule -credentials credentials.txt -NWestCoastComparisonRule \n

BR002=No se ha encontrado una regla de negocios coincidente con \"{0}\" para la empresa \"{1}\".
BR006=No se puede procesar regla de negocios \"{0}\" en empresa \"{1}\". Las reglas de negocios en tiempo real s\u00f3lo se procesan internamente.
BR009=No se pudo encontrar el tipo de regla de negocios \"{0}\" asociado con el proceso de negocios \"{1}\".
BR015=Procesando reglas para el proceso de negocios \"{0}\", empresa \"{1}\".
BR016=Procesando reglas para el proceso de negocios \"{0}\", tipo de regla \"{1}\", empresa \"{2}\".
BR026=Opci\u00f3n -B<NombreProcesoNegocios> se requiere con -T<TipoRegla>. Ver usos.
BR027=Opci\u00f3n no v\u00e1lida. Ver usos.
BR029=La opci\u00f3n -N\"NombreRegla\" requiere de un nombre de regla. Ver usos.
BR030=La opci\u00f3n -B\"NombreProcesoNegocio\" requiere de un nombre de proceso de negocios. Ver usos.
BR031=La opci\u00f3n -T\"TipoRegla\" requiere de un tipo de regla. Ver usos.
BR032=Error al procesar la regla: {0}.
BR033=La opci\u00f3n -E\"NombreEmpresa\"  requiere de un nombre de empresa. Ver usos.
BR066=Se requiere por lo menos una de las opciones -A, -B, -N con la opci\u00f3n -E.
BR067=Se requiere por lo menos una de las opciones -A, -B, -N con la opci\u00f3n -C.
BR068=Se requiere por lo menos una de las opciones -M, -A, -B, -N.
BR069=La opci\u00f3n -A es v\u00e1lida s\u00f3lo con -C y/o -E.
BR070=Opci\u00f3n -N es v\u00e1lida s\u00f3lo con -C y/o -E.
BR071=Los tipos de reglas se pueden especificar s\u00f3lo para un proceso de negocios individual.
BR072=No se pudo encontrar el Proceso de negocios \"{0}\".
BR075=El nombre de grupo de la conexi\u00f3n no est\u00e1 definido para el Proceso de negocios \"{0}\".
BR077=No se pudo encontrar la empresa \"{0}\" o no existe en la jerarqu\u00eda de empresas del usuario.
BR078=No se pudo encontrar el Proceso de negocios \"{0}\" o el usuario no puede acceder a \u00e9l.
JobIdDisplay=Ide. de trabajo de este proceso es:
TimeOutMsg=El tiempo de espera de {0} segundos es mayor que el tiempo de espera establecido:{1} segundos.
FailureDetailMsg=NWPRocessBusinessRule:Ide. de trabajo:{0}; Ide. de regla de negocios:{1}; Estado de regla: {2} Raz\u00f3n del error: {3}
WarningDetailMsg=NWPRocessBusinessRule:Ide. de trabajo:{0}; Ide. de regla de negocios:{1}; Estado de regla: {2} Mensaje de advertencia: {3}
SuccessDetailMsg=NWPRocessBusinessRule:Ide. de trabajo:{0}; Ide. de regla de negocios:{1}; Estado de regla: {2} Mensaje informativo: {3}
StatusSummaryStart=*** Resumen de estado de regla de negocios - Inicio ***
StatusSummaryEnd=*** Resumen de estado de regla de negocios - Fin ***
RuleErrorOrWarning=La regla se complet\u00f3 con un error o una advertencia; haga clic en el estado para ver los detalles.

# These messages are used by the Notification process
NE008=No se ha encontrado el archivo de plantillas \"{0}\". Compruebe si el archivo est\u00e1 ubicado en el directorio definido por mailTemplateDir en el archivo monitor.properties.
ResolutionPath=Ruta de resoluci\u00f3n
ResolutionPathWithColon=Ruta de resoluci\u00f3n:
SystemAlertSub=Alerta del sistema Monitor
SystemAlertBody=El siguiente usuario/(objetivo escalada) no recibi\u00f3 una alerta de Monitor porque su direcci\u00f3n de correo electr\u00f3nico no existe/es inv\u00e1lida: {0}.
Invalid_SMTP_Server=Este servidor SMTP no es v\u00e1lido o est\u00e1 inactivo:{0}.
SummaryEMailSubject=Informaci\u00f3n resumen de la alerta del sistema.

# These messages are used by the NWReloadServer batch process
SM001=Uso:\nNWReloadServer\n[-user <usuario>]\n[-credentials <archivo de credenciales cifrado>]\n[-T] Volver a cargar plantillas para notificaci\u00f3n\n[-X<NombreServidor>] Server Name\n[-H] Mostrar uso.\n\n\nEj 1: NWReloadServer -credentials credentials.txt -T\n\nEj 2: NWReloadServer -credentials credentials.txt -user userName -T\n\nEj 3: NWReloadServer -credentials credentials.txt -T -XmyServer\n\n
SM002=Error al volver a cargar las plantillas.
SM003=La opci\u00f3n -X\"NombreServidor\" requiere de un nombre de servidor. Ver usos.
SM004=Se requiere por lo menos una de las opciones -T, -X, -H.
MappingHeader=\nMapeo de tipo de regla de negocios:\n- Al especificar un tipo de regla de negocios utilizando el -par\u00e1metro T, coloque el\nnombre entre '(' ')'.\n
MappingDetail=\t {0} {1} ({2})


# These messages are used by the NWWakeBackgroundProcess batch process
WB001=Uso:\nNWWakeBackgroundProcess\n[-user <usuario>]\n[-credentials <archivo de credenciales cifrado>]\n[-N] Reactivar proceso de notificaci\u00f3n de excepciones de fondo\n[-R] Reactivar proceso de resoluci\u00f3n autom\u00e1tica de excepciones de fondo\n[-H] Mostrar uso.\n\n\nEj 1: NWWakeBackgroundProcess -credentials credentials.txt -N\n\nEj 2: NWWakeBackgroundProcess -credentials credentials.txt -user userName -R\n\n
WB002=Se requiere por lo menos una de las opciones -N o -R.
WB003=Opci\u00f3n -N no es v\u00e1lida con -R.
WB004=Opci\u00f3n -R no es v\u00e1lida con -N.
WB005=Error al procesar despertador: {0}.

