#############################################
## NPO Process Exceptions
#############################################

############################
### NPO Exceptions
############################
NPOException.1= \u0414\u0430\u0442\u0430 \u043d\u0430\u0447\u0430\u043b\u0430 DFU \u0440\u0430\u043d\u044c\u0448\u0435 \u0434\u0430\u0442\u044b \u043d\u0430\u0447\u0430\u043b\u0430 \u043f\u0435\u0440\u0438\u043e\u0434\u0430
NPOException.2= \u0422\u0438\u043f MENUOFFSETTYPE \u0434\u043b\u044f DFU \u043d\u0435 \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u043d\u0438 \u0430\u0434\u0434\u0438\u0442\u0438\u0432\u043d\u044b\u043c, \u043d\u0438 \u043c\u0443\u043b\u044c\u0442\u0438\u043f\u043b\u0438\u043a\u0430\u0442\u0438\u0432\u043d\u044b\u043c, \u043d\u0438 \u0431\u0435\u0437 \u043c\u0435\u043d\u044e
NPOException.3= \u041f\u0430\u0440\u0430\u043c\u0435\u0442\u0440 EVALUATE CURRENT CONTROLS ONLY (\u0423\u0447\u0438\u0442\u044b\u0432\u0430\u0442\u044c \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0435\u043a\u0443\u0449\u0438\u0435 \u043f\u0430\u0440\u0430\u043c\u0435\u0442\u0440\u044b \u0443\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u044f) \u0432\u043a\u043b\u044e\u0447\u0435\u043d, PGP CFE.RUN \u0438\u043c\u0435\u0435\u0442 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u0435 FALSE
NPOException.4= \u041c\u0438\u043d\u0438\u043c\u0430\u043b\u044c\u043d\u0430\u044f \u0446\u0435\u043d\u0430 \u0440\u0435\u0441\u0443\u0440\u0441\u0430 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0430, \u0442\u0435\u043a\u0443\u0449\u0430\u044f \u0446\u0435\u043d\u0430 \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u0441\u044f \u0437\u0430 \u043f\u0440\u0435\u0434\u0435\u043b\u0430\u043c\u0438 \u0446\u0435\u043d\u043e\u0432\u043e\u0433\u043e \u0434\u0438\u0430\u043f\u0430\u0437\u043e\u043d\u0430
NPOException.5= \u041c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u0430\u044f \u0446\u0435\u043d\u0430 \u0440\u0435\u0441\u0443\u0440\u0441\u0430 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0430, \u0442\u0435\u043a\u0443\u0449\u0430\u044f \u0446\u0435\u043d\u0430 \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u0441\u044f \u0437\u0430 \u043f\u0440\u0435\u0434\u0435\u043b\u0430\u043c\u0438 \u0446\u0435\u043d\u043e\u0432\u043e\u0433\u043e \u0434\u0438\u0430\u043f\u0430\u0437\u043e\u043d\u0430
NPOException.6= \u0412 \u0445\u043e\u0434\u0435 \u043e\u043f\u0442\u0438\u043c\u0438\u0437\u0430\u0446\u0438\u0438 \u0440\u0435\u0448\u0435\u043d\u0438\u0435 \u043d\u0435 \u043d\u0430\u0439\u0434\u0435\u043d\u043e
NPOException.7= \u041e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0442 \u0437\u0430\u043f\u0438\u0441\u0438 \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 FCST
NPOException.8= \u041e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0442 \u0434\u0430\u043d\u043d\u044b\u0435 \u043e \u0442\u0435\u043a\u0443\u0449\u0438\u0445 \u0431\u0440\u043e\u043d\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u044f\u0445
NPOException.9= \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044e\u0442\u0441\u044f \u043d\u0443\u043b\u0435\u0432\u044b\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0434\u043b\u044f \u0432\u0441\u0435\u0445 \u043e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u0445 \u043f\u043e\u043b\u0435\u0439 \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 NPO_RESRC_CAL_PARAM
NPOException.10= \u041e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0442 \u0437\u0430\u043f\u0438\u0441\u0438 \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 DFUEFFPRICE
NPOException.11= \u041e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0442 \u0437\u0430\u043f\u0438\u0441\u0438 \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 DFUREFPRICE
NPOException.12= \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044e\u0442\u0441\u044f \u043d\u0443\u043b\u0435\u0432\u044b\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0434\u043b\u044f \u0432\u0441\u0435\u0445 \u043e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u0445 \u043f\u043e\u043b\u0435\u0439 \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 NPO_DFU_PARAM
NPOException.13= \u0414\u0430\u043d\u043d\u044b\u0435 \u0434\u043e\u0441\u0442\u0443\u043f\u043d\u044b \u043d\u0435 \u0434\u043b\u044f \u0432\u0441\u0435\u0433\u043e \u043f\u0435\u0440\u0438\u043e\u0434\u0430 \u043f\u043b\u0430\u043d\u0438\u0440\u043e\u0432\u0430\u043d\u0438\u044f
NPOException.14= \u041d\u0435\u0434\u043e\u0441\u0442\u0430\u0442\u043e\u0447\u043d\u043e \u0434\u0430\u043d\u043d\u044b\u0445 \u0434\u043b\u044f \u043e\u043f\u0442\u0438\u043c\u0438\u0437\u0430\u0446\u0438\u0438 \u0432\u0441\u0435\u0433\u043e \u043f\u0435\u0440\u0438\u043e\u0434\u0430. \u041e\u0431\u0440\u0430\u0431\u0430\u0442\u044b\u0432\u0430\u0435\u0442\u0441\u044f \u0442\u043e\u043b\u044c\u043a\u043e \u0447\u0430\u0441\u0442\u044c \u0434\u0438\u0430\u043f\u0430\u0437\u043e\u043d\u0430 \u0434\u0430\u0442.
NPOException.15= \u0421\u043f\u0440\u0430\u0432\u043e\u0447\u043d\u0430\u044f \u0446\u0435\u043d\u0430 \u043c\u0435\u043d\u044c\u0448\u0435 \u0438\u043b\u0438 \u0440\u0430\u0432\u043d\u0430 0,000001
NPOException.16= \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044e\u0442\u0441\u044f \u043d\u0443\u043b\u0435\u0432\u044b\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0434\u043b\u044f \u0432\u0441\u0435\u0445 \u043e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u0445 \u043f\u043e\u043b\u0435\u0439 \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 NPO_PKG_CAL_PARAM
NPOException.17=  \u041c\u0438\u043d\u0438\u043c\u0430\u043b\u044c\u043d\u0430\u044f \u0446\u0435\u043d\u0430 \u043f\u0430\u043a\u0435\u0442\u0430 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0430, \u0442\u0435\u043a\u0443\u0449\u0430\u044f \u0446\u0435\u043d\u0430 \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u0441\u044f \u0437\u0430 \u043f\u0440\u0435\u0434\u0435\u043b\u0430\u043c\u0438 \u0446\u0435\u043d\u043e\u0432\u043e\u0433\u043e \u0434\u0438\u0430\u043f\u0430\u0437\u043e\u043d\u0430
NPOException.18=  \u041c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u0430\u044f \u0446\u0435\u043d\u0430 \u043f\u0430\u043a\u0435\u0442\u0430 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0430, \u0442\u0435\u043a\u0443\u0449\u0430\u044f \u0446\u0435\u043d\u0430 \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u0441\u044f \u0437\u0430 \u043f\u0440\u0435\u0434\u0435\u043b\u0430\u043c\u0438 \u0446\u0435\u043d\u043e\u0432\u043e\u0433\u043e \u0434\u0438\u0430\u043f\u0430\u0437\u043e\u043d\u0430
NPOException.19= \u041e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0442 \u0434\u0430\u043d\u043d\u044b\u0435 \u0434\u043b\u044f rep_price \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 NPO_DFU_DT.
NPOException.20= \u0414\u0430\u043d\u043d\u0430\u044f \u0435\u0434\u0438\u043d\u0438\u0446\u0430 DFU \u043d\u0435 \u0441\u0432\u044f\u0437\u0430\u043d\u0430 \u043d\u0438 \u0441 \u043e\u0434\u043d\u0438\u043c \u0442\u0438\u043f\u043e\u043c \u0441\u043f\u0440\u043e\u0441\u0430.
NPOException.21= \u041e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0442 \u0434\u0430\u043d\u043d\u044b\u0435 \u0434\u043b\u044f rec_auth \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 NPO_RESRC_DT_INTERVAL.
NPOException.22= \u0417\u043d\u0430\u0447\u0435\u043d\u0438\u0435 Incremental_Survival_Rate \u0434\u043e\u043b\u0436\u043d\u043e \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u0441\u044f \u0432 \u043f\u0440\u0435\u0434\u0435\u043b\u0430\u0445 0 \u0438 1.
NPOException.23= \u041e\u0431\u043d\u0430\u0440\u0443\u0436\u0435\u043d\u0430 \u043f\u043e \u043c\u0435\u043d\u044c\u0448\u0435\u0439 \u043c\u0435\u0440\u0435 \u043e\u0434\u043d\u0430 \u043d\u0443\u043b\u0435\u0432\u0430\u044f \u043a\u043e\u043d\u0442\u0440\u043e\u043b\u044c\u043d\u0430\u044f \u0446\u0435\u043d\u0430.
NPOException.24= \u0418\u0437\u043c\u0435\u043d\u0435\u043d\u0430 \u043c\u0438\u043d\u0438\u043c\u0430\u043b\u044c\u043d\u0430\u044f \u0446\u0435\u043d\u0430 \u0434\u043b\u044f \u0434\u0430\u0442\u044b \u043f\u0443\u0431\u043b\u0438\u043a\u0430\u0446\u0438\u0438 DFU
NPOException.25= \u0418\u0437\u043c\u0435\u043d\u0435\u043d\u0430 \u043c\u0430\u043a\u0441\u0438\u043c\u0430\u043b\u044c\u043d\u0430\u044f \u0446\u0435\u043d\u0430 \u0434\u043b\u044f \u0434\u0430\u0442\u044b \u043f\u0443\u0431\u043b\u0438\u043a\u0430\u0446\u0438\u0438 DFU
NPOException.26= \u041d\u0435 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d \u0442\u0438\u043f \u0441\u043c\u0435\u0449\u0435\u043d\u0438\u044f \u043c\u0435\u043d\u044e
NPOException.27= \u041d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 \u0444\u043e\u0440\u043c\u0430\u0442 \u0446\u0435\u043d\u044b \u0434\u043b\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0430.
NPOException.28= \u041d\u0435\u0434\u043e\u043f\u0443\u0441\u0442\u0438\u043c\u044b\u0439 \u0444\u043e\u0440\u043c\u0430\u0442 \u0446\u0435\u043d\u044b \u0434\u043b\u044f DFU.
NPOException.29= \u041d\u043e\u043c\u0435\u0440 \u043f\u0430\u043a\u0435\u0442\u0430 \u0438 \u0446\u0435\u043d\u043e\u0432\u044b\u0435 \u0442\u043e\u0447\u043a\u0438 DFU \u043d\u0435 \u0441\u043e\u0432\u043f\u0430\u0434\u0430\u044e\u0442
NPOException.30= \u041e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0442 \u0446\u0435\u043d\u043e\u0432\u044b\u0435 \u0442\u043e\u0447\u043a\u0438 \u0434\u043b\u044f \u0440\u0435\u0441\u0443\u0440\u0441\u0430
NPOException.31= \u041e\u0448\u0438\u0431\u043a\u0430 \u0432 \u0444\u043e\u0440\u043c\u0430\u0442\u0435 \u043e\u043a\u0440\u0443\u0433\u043b\u0435\u043d\u0438\u044f \u0446\u0435\u043d\u044b. \u041f\u043e\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044e\u0442\u0441\u044f \u0442\u043e\u043b\u044c\u043a\u043e \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0435 \u0444\u043e\u0440\u043c\u0430\u0442\u044b: #9.99, .#9, #9.#9
NPOException.32= \u0418\u0441\u043f\u043e\u043b\u044c\u0437\u0443\u044e\u0442\u0441\u044f \u043d\u0443\u043b\u0435\u0432\u044b\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f \u0434\u043b\u044f \u043e\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0438\u0445 \u043f\u043e\u043b\u0435\u0439 \u0441\u0442\u043e\u0438\u043c\u043e\u0441\u0442\u0438 \u0438 \u0441\u043e\u043f\u0443\u0442\u0441\u0442\u0432\u0443\u044e\u0449\u0435\u0433\u043e \u0434\u043e\u0445\u043e\u0434\u0430 \u0432 \u0442\u0430\u0431\u043b\u0438\u0446\u0435 NPO_DFU_DT
NPOException.33=\u041d\u0435\u043d\u0430\u0434\u043b\u0435\u0436\u0430\u0449\u0438\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f PGP \u0443\u0440\u0435\u0437\u0430\u043d\u0438\u044f \u0446\u0435\u043d\u044b

##############################
### NPO Functions
##############################
FunctionName.1= NPODFUFcstSurvivalRetrievalDAO.loadQtyDataSet
FunctionName.2= NPOProcessingThread.bookedAcceptedRsrc
FunctionName.3= NPOProcessingThread.processAction
FunctionName.4= VariablesCreator.derivedParametersCalculation
FunctionName.5= SolveModel.solveQP
FunctionName.6= NPOReaderThread.getDfuPriceChangeAllowableArray
FunctionName.7= NPOProcessOptUtility.constructDFUBeanList
FunctionName.8= NPORsrcCalParamRetrievalDAO.loadForBatch
FunctionName.9= NPODFUParamRetrievalDAO.loadOptimizeDataSet
FunctionName.10= NPORscCalParamRetrievalDAO.loadRsrcCalParamDataSet
FunctionName.11= NPOProcessOptUtility.constructResourceBeanList
FunctionName.12= NPOReaderThread.checkHorizonDuration
FunctionName.13= NPOPkgCalParamRetrievalDAO.loadForBatch
FunctionName.14= NPORsrcEvalCapPtdtRetvalDAO.getResrcPostdateInfo
FunctionName.15 = NPODFURefPriceRetrievalDAO.loadPriceDataSet
FunctionName.16 = NPOCfe.initialize
FunctionName.17 = NPOCfe.updateSimPrices
FunctionName.18 = NPOProcessRunner.chkPkgPricePtValidity
FunctionName.19 = NPOPriceRoundingRules.finalRoundedPrice
FunctionName.20 = NPOReaderRunner.calculateDFULenOfStay

################GEM#################
GroupEvaluation.EnterpriseAndOptionMatchError=\u041d\u0435 \u0443\u0434\u0430\u043b\u043e\u0441\u044c \u0437\u0430\u0432\u0435\u0440\u0448\u0438\u0442\u044c \u043f\u0440\u043e\u0446\u0435\u0441\u0441 \u0438\u0437-\u0437\u0430 \u043e\u0448\u0438\u0431\u043a\u0438. \u0421\u0432\u0435\u0434\u0435\u043d\u0438\u044f \u0441\u043c. \u0432 \u0444\u0430\u0439\u043b\u0430\u0445 \u0436\u0443\u0440\u043d\u0430\u043b\u0430.  

###########################################
#### What-If Module Exceptions
#############################################

CFEException.1=\u041d\u0435\u043d\u0430\u0434\u043b\u0435\u0436\u0430\u0449\u0438\u0435 \u0437\u043d\u0430\u0447\u0435\u043d\u0438\u044f PGP \u0443\u0440\u0435\u0437\u0430\u043d\u0438\u044f \u0446\u0435\u043d\u044b


## Functions

CFEFunctionName.1 = CFEReaderRunner.calculateDFULenOfStay
