#############################################
## NPO Process Exceptions
#############################################

############################
### NPO Exceptions
############################
NPOException.1= DFU \u958b\u59cb\u65e5\u304c\u671f\u9593\u958b\u59cb\u65e5\u3088\u308a\u3082\u5148\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u3002
NPOException.2= DFU \u306e MENUOFFSETTYPE \u306f\u52a0\u7b97\u3067\u3082\u3001\u4e57\u7b97\u3067\u3082\u975e\u30e1\u30cb\u30e5\u30fc\u3067\u3082\u3042\u308a\u307e\u305b\u3093
NPOException.3= EVALUATE CURRENT CONTROLS ONLY \u304c\u30aa\u30f3\u306b\u306a\u3063\u3066\u3044\u308b\u305f\u3081\u3001PGP CFE.RUN \u304c FALSE \u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002
NPOException.4= \u30ea\u30bd\u30fc\u30b9\u6700\u5c0f\u6599\u91d1\u304c\u62e1\u5927\u3055\u308c\u305f\u305f\u3081\u3001\u73fe\u5728\u306e\u6599\u91d1\u304c\u6599\u91d1\u7bc4\u56f2\u5916\u3068\u306a\u3063\u3066\u3044\u307e\u3059\u3002
NPOException.5= \u30ea\u30bd\u30fc\u30b9\u6700\u5927\u6599\u91d1\u304c\u62e1\u5927\u3055\u308c\u305f\u305f\u3081\u3001\u73fe\u5728\u306e\u6599\u91d1\u304c\u6599\u91d1\u7bc4\u56f2\u5916\u3068\u306a\u3063\u3066\u3044\u307e\u3059\u3002
NPOException.6= \u6700\u9069\u5316\u3067\u89e3\u304c\u5f97\u3089\u308c\u307e\u305b\u3093\u3067\u3057\u305f
NPOException.7= FCST \u30c6\u30fc\u30d6\u30eb\u306b\u30ec\u30b3\u30fc\u30c9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
NPOException.8= \u73fe\u5728\u306e\u4e88\u7d04\u30c7\u30fc\u30bf\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
NPOException.9= NPO_RESRC_CAL_PARAM \u30c6\u30fc\u30d6\u30eb\u3067\u898b\u3064\u304b\u3089\u306a\u3044\u3059\u3079\u3066\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u306f\u30bc\u30ed\u5024\u3092\u60f3\u5b9a\u3057\u3066\u3044\u307e\u3059
NPOException.10= DFUEFFPRICE \u30c6\u30fc\u30d6\u30eb\u306b\u30ec\u30b3\u30fc\u30c9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
NPOException.11= DFUREFPRICE \u30c6\u30fc\u30d6\u30eb\u306b\u30ec\u30b3\u30fc\u30c9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
NPOException.12= NPO_DFU_PARAM \u30c6\u30fc\u30d6\u30eb\u3067\u898b\u3064\u304b\u3089\u306a\u3044\u3059\u3079\u3066\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u30bc\u30ed\u5024\u3092\u60f3\u5b9a\u3057\u3066\u3044\u307e\u3059
NPOException.13= \u8a08\u753b\u5bfe\u8c61\u671f\u9593\u5168\u4f53\u306b\u308f\u305f\u3063\u3066\u30c7\u30fc\u30bf\u304c\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093
NPOException.14= \u5168\u671f\u9593\u3092\u6700\u9069\u5316\u3059\u308b\u306b\u306f\u30c7\u30fc\u30bf\u304c\u4e0d\u5341\u5206\u3067\u3059\u3002\u4e00\u90e8\u306e\u65e5\u4ed8\u306e\u307f\u3092\u51e6\u7406\u3057\u307e\u3059\u3002
NPOException.15= \u53c2\u8003\u6599\u91d1\u306f 0.000001 \u3068\u540c\u3058\u304b\u3001\u307e\u305f\u306f\u305d\u308c\u4ee5\u4e0b\u3067\u3059
NPOException.16= NPO_PKG_CAL_PARAM \u30c6\u30fc\u30d6\u30eb\u3067\u898b\u3064\u304b\u3089\u306a\u3044\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3059\u3079\u3066\u5024\u304c\u30bc\u30ed\u3068\u4eee\u5b9a\u3057\u3066\u3044\u307e\u3059
NPOException.17=  \u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u6700\u5c0f\u6599\u91d1\u304c\u62e1\u5927\u3055\u308c\u3066\u73fe\u884c\u6599\u91d1\u304c\u6599\u91d1\u7bc4\u56f2\u5916\u306b\u306a\u3063\u3066\u3044\u307e\u3059
NPOException.18=  \u30d1\u30c3\u30b1\u30fc\u30b8\u306e\u6700\u5927\u6599\u91d1\u304c\u62e1\u5927\u3055\u308c\u3066\u73fe\u884c\u6599\u91d1\u304c\u6599\u91d1\u67a0\u5916\u306b\u306a\u3063\u3066\u3044\u307e\u3059
NPOException.19= NPO_DFU_DT \u30c6\u30fc\u30d6\u30eb\u306e rep_price \u306b\u30c7\u30fc\u30bf\u304c\u3042\u308a\u307e\u305b\u3093\u3002
NPOException.20= \u3053\u306e DFU \u306f\u3069\u306e\u9700\u8981\u30bf\u30a4\u30d7\u3068\u3082\u95a2\u9023\u4ed8\u3051\u3089\u308c\u3066\u3044\u307e\u305b\u3093\u3002
NPOException.21= NPO_RESRC_DT_INTERVAL \u30c6\u30fc\u30d6\u30eb \u306e rec_auth \u306b\u30c7\u30fc\u30bf\u304c\u3042\u308a\u307e\u305b\u3093\u3002
NPOException.22= Incremental_Survival_Rate \u306f 0 \u3068 1 \u306e\u9593\u3067\u3059\u3002
NPOException.23= \u30bc\u30ed\u53c2\u7167\u306e\u6599\u91d1\u304c\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
NPOException.24= DFU \u767b\u9332\u65e5\u306b\u5408\u308f\u305b\u305f\u6700\u5c0f\u6599\u91d1
NPOException.25= DFU \u767b\u9332\u65e5\u306b\u5408\u308f\u305b\u305f\u6700\u5927\u6599\u91d1
NPOException.26= \u30e1\u30cb\u30e5\u30fc\u306e\u30aa\u30d5\u30bb\u30c3\u30c8\u30bf\u30a4\u30d7\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093
NPOException.27= \u30ea\u30bd\u30fc\u30b9\u306b\u306f\u7121\u52b9\u306a\u6599\u91d1\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3067\u3059\u3002
NPOException.28= DFU \u306b\u306f\u7121\u52b9\u306a\u6599\u91d1\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3067\u3059\u3002
NPOException.29= \u30d1\u30c3\u30b1\u30fc\u30b8\u6570\u3068 DFU \u306e\u30d7\u30e9\u30a4\u30b9\u30dd\u30a4\u30f3\u30c8\u304c\u4e00\u81f4\u3057\u3066\u3044\u307e\u305b\u3093
NPOException.30= \u30ea\u30bd\u30fc\u30b9\u306b\u898b\u3064\u304b\u3089\u306a\u3044\u30d7\u30e9\u30a4\u30b9\u30dd\u30a4\u30f3\u30c8
NPOException.31= \u6599\u91d1\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306e\u7aef\u6570\u51e6\u7406\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u308b\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306f\u3001 #9.99\u3001 .#9\u3001 #9.#9 \u3060\u3051\u3067\u3059\u3002
NPOException.32= NPO_DFU_DT table
NPOException.33=Price Clipping PGP \u306e\u30a8\u30f3\u30c8\u30ea\u304c\u9069\u5207\u3067\u306f\u3042\u308a\u307e\u305b\u3093

##############################
### NPO Functions
##############################
FunctionName.1= NPODFUFcstSurvivalRetrievalDAO.loadQtyDataSet
FunctionName.2= NPOProcessingThread.bookedAcceptedRsrc
FunctionName.3= NPOProcessingThread.processAction
FunctionName.4= VariablesCreator.derivedParametersCalculation
FunctionName.5= SolveModel.solveQP
FunctionName.6= NPOReaderThread.getDfuPriceChangeAllowableArray
FunctionName.7= NPOProcessOptUtility.constructDFUBeanList
FunctionName.8= NPORsrcCalParamRetrievalDAO.loadForBatch
FunctionName.9= NPODFUParamRetrievalDAO.loadOptimizeDataSet
FunctionName.10= NPORscCalParamRetrievalDAO.loadRsrcCalParamDataSet
FunctionName.11= NPOProcessOptUtility.constructResourceBeanList
FunctionName.12= NPOReaderThread.checkHorizonDuration
FunctionName.13= NPOPkgCalParamRetrievalDAO.loadForBatch
FunctionName.14= NPORsrcEvalCapPtdtRetvalDAO.getResrcPostdateInfo
FunctionName.15 = NPODFURefPriceRetrievalDAO.loadPriceDataSet
FunctionName.16 = NPOCfe.initialize
FunctionName.17 = NPOCfe.updateSimPrices
FunctionName.18 = NPOProcessRunner.chkPkgPricePtValidity
FunctionName.19 = NPOPriceRoundingRules.finalRoundedPrice
FunctionName.20 = NPOReaderRunner.calculateDFULenOfStay

################GEM#################
GroupEvaluation.EnterpriseAndOptionMatchError=\u30a8\u30e9\u30fc\u306e\u305f\u3081\u306b\u51e6\u7406\u304c\u5b8c\u4e86\u3057\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002  

###########################################
#### What-If Module Exceptions
#############################################

CFEException.1=Price Clipping PGP \u306e\u30a8\u30f3\u30c8\u30ea\u304c\u9069\u5207\u3067\u306f\u3042\u308a\u307e\u305b\u3093


## Functions

CFEFunctionName.1 = CFEReaderRunner.calculateDFULenOfStay
