#
# Main resource bundle for the Parameter Workbench.
#

##
# Client Resources
##

# Security/Directory entries
ParameterWorkbench=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1
ParameterWorkbenchProcess=\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0
Util=\u30e6\u30fc\u30c6\u30a3\u30ea\u30c6\u30a3
ParameterWorkbenchRanking=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\uff1a \u30e9\u30f3\u30ad\u30f3\u30b0\u30bf\u30d6
ParameterWorkbenchParameterGroup=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\uff1a \u30d1\u30e9\u30e1\u30fc\u30bf\u30b0\u30eb\u30fc\u30d7\u30bf\u30d6
ParameterWorkbenchRule=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\uff1a \u30eb\u30fc\u30eb\u30bf\u30d6
ParameterWorkbenchRuleWeightOverride=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\uff1a \u30eb\u30fc\u30eb\u6bd4\u91cd\u306e\u88dc\u6b63
ParameterWorkbenchAlgorithm=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\uff1a \u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0
ParameterWorkbenchRuleReport=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\uff1a \u30eb\u30fc\u30eb\u30ec\u30dd\u30fc\u30c8


# Client tabs
Tab.Rules=\u30d1\u30e9\u30e1\u30fc\u30bf\u30eb\u30fc\u30eb
Tab.Groups=\u30d1\u30e9\u30e1\u30fc\u30bf\u30b0\u30eb\u30fc\u30d7
Tab.Ranks=\u30e9\u30f3\u30ad\u30f3\u30b0
Tab.RuleReport=\u30eb\u30fc\u30eb\u30ec\u30dd\u30fc\u30c8
Tab.RuleDetails=\u8a73\u7d30
Tab.RuleHierarchies=\u968e\u5c64
Tab.RuleGroups=\u30d1\u30e9\u30e1\u30fc\u30bf\u30b0\u30eb\u30fc\u30d7
Tab.RuleValues=\u30d1\u30e9\u30e1\u30fc\u30bf\u5024

# Labels
Application.Title=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1
Hierarchy.LoadingMsg=\u30ed\u30fc\u30c9\u4e2d\u3067\u3059...
Hierarchy.NoValue=[\u672a\u8a2d\u5b9a]
Hierarchy.TooManyValues=[...]
Info.All=[\u3059\u3079\u3066]
Info.Name=[\u540d\u524d]
Info.Comments=\u30b3\u30e1\u30f3\u30c8
Info.Copy=\u30b3\u30d4\u30fc
Info.HierarchyValues=\u968e\u5c64\u5024
Info.AvailableValues=\u4f7f\u7528\u53ef\u80fd\u306a\u5024
Info.SelectedValues=\u9078\u629e\u5024
Info.PageSize=\u30da\u30fc\u30b8\u30b5\u30a4\u30ba
Info.Parameters=\u30d1\u30e9\u30e1\u30fc\u30bf
Info.ParameterGroup=\u30d1\u30e9\u30e1\u30fc\u30bf\u30b0\u30eb\u30fc\u30d7
Info.ParameterRule=\u30d1\u30e9\u30e1\u30fc\u30bf\u30eb\u30fc\u30eb
Info.ParameterUsage=\u30d1\u30e9\u30e1\u30fc\u30bf\u4f7f\u7528
Info.TimePhasedParameterValue=\u671f\u9593\u5225\u30d1\u30e9\u30e1\u30fc\u30bf\u5024
Info.Column=\u5217
Info.Table=\u30c6\u30fc\u30d6\u30eb
Info.Schema=\u30b9\u30ad\u30fc\u30de
Info.AuditHierarchyPopup=\u30eb\u30fc\u30eb\u306e\u968e\u5c64\u8a73\u7d30
Comment.CreatedBy=\u4f5c\u6210\u8005
Comment.CreatedOn=\u4f5c\u6210\u65e5
Comment.UpdatedBy=\u7de8\u96c6\u8005
Comment.UpdatedOn=\u66f4\u65b0\u65e5
Parameter.DefaultValue=[\u7de8\u96c6\u3057\u306a\u3044]
ParameterGroup.Name=\u540d\u524d
ParameterGroup.Description=\u8aac\u660e
ParameterGroup.BaseTable=\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb
ParameterGroup.BaseSchema=\u30d9\u30fc\u30b9\u30b9\u30ad\u30fc\u30de
ParameterGroup.Columns=\u30d1\u30e9\u30e1\u30fc\u30bf
ParameterGroup.Comment=\u30b3\u30e1\u30f3\u30c8\u306e\u5909\u66f4
ParameterGroup.AvailableColumns=\u9078\u629e\u53ef\u80fd\u30d1\u30e9\u30e1\u30fc\u30bf
ParameterGroup.SelectedColumns=\u9078\u629e\u30d1\u30e9\u30e1\u30fc\u30bf
ParameterGroup.TimePhased=\u671f\u9593\u5225
ParameterGroup.TimePhasedTable=\u671f\u9593\u5225\u30c6\u30fc\u30d6\u30eb
Ranking.Column=\u5217
Ranking.ColumnRanking=\u5217\u30e9\u30f3\u30ad\u30f3\u30b0
Ranking.SupportsFilters=\u30d5\u30a3\u30eb\u30bf\u3092\u30b5\u30dd\u30fc\u30c8
Ranking.Dimension=\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3
Ranking.Hierarchy=\u968e\u5c64
Ranking.HierarchyRanking=\u968e\u5c64\u30e9\u30f3\u30ad\u30f3\u30b0
Ranking.Order=\u30aa\u30fc\u30c0
Ranking.NotSet=[\u672a\u8a2d\u5b9a]
Rule.Name=\u540d\u524d
Rule.GroupName=\u30b0\u30eb\u30fc\u30d7\u540d
Rule.NewName=\u65b0\u3057\u3044\u540d\u524d
Rule.UsageName=\u30eb\u30fc\u30eb\u540d
Rule.Description=\u8aac\u660e
Rule.BaseTable=\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb
Rule.BaseSchema=\u30d9\u30fc\u30b9\u30b9\u30ad\u30fc\u30de
Rule.DiscontinueDate=\u6709\u52b9\u7d42\u4e86\u65e5
Rule.EffectiveDate=\u6709\u52b9\u958b\u59cb\u65e5
Rule.LastUpdated=\u6700\u7d42\u66f4\u65b0\u65e5
Rule.Comment=\u30b3\u30e1\u30f3\u30c8\u306e\u5909\u66f4
Rule.Group=\u30b0\u30eb\u30fc\u30d7
Rule.Hierarchy=\u968e\u5c64
Rule.Parmeter=\u30d1\u30e9\u30e1\u30fc\u30bf
Rule.Value=\u5024
Rule.NetWeight=\u30cd\u30c3\u30c8\u6bd4\u91cd
Rule.Weight=\u8a08\u7b97\u6bd4\u91cd
Rule.WeightOverride=\u6bd4\u91cd\u88dc\u6b63

SKUReport.Item=\u30a2\u30a4\u30c6\u30e0
SKUReport.Location=\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3
SKUReport.Parameter=\u30d1\u30e9\u30e1\u30fc\u30bf
SKUReport.LastDays=\u76f4\u8fd1 (N) \u65e5\u9593
SKUReport.DMDUNIT=\u9700\u8981\u30e6\u30cb\u30c3\u30c8
SKUReport.DMDGROUP=\u9700\u8981\u30b0\u30eb\u30fc\u30d7
SKUReport.Model=\u30e2\u30c7\u30eb

SKUReport.RuleName=\u30eb\u30fc\u30eb\u540d
SKUReport.ParameterValue=\u30d1\u30e9\u30e1\u30fc\u30bf\u5024
SKUReport.RuleWeight=\u30eb\u30fc\u30eb\u6bd4\u91cd
SKUReport.ColumnOrOverride=\u5217/\u88dc\u6b63
SKUReport.EffectiveDate=\u6709\u52b9\u958b\u59cb\u65e5
SKUReport.LastUpdatedDate=\u6700\u7d42\u66f4\u65b0\u65e5
SKUReport.HierarchyRank=\u968e\u5c64\u30e9\u30f3\u30af
SKUReport.RuleTieBreaker=\u30eb\u30fc\u30eb\u30bf\u30a4\u30d6\u30ec\u30fc\u30ab
SKUReport.LastUpdatedBy=\u6700\u7d42\u66f4\u65b0\u8005
SKUReport.Active=\u30a2\u30af\u30c6\u30a3\u30d6
SKUReport.MatchedRules=\u4e00\u81f4\u30eb\u30fc\u30eb
SKUReport.OptionSet=\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8
SKUReport.OptionCriteria=\u30aa\u30d7\u30b7\u30e7\u30f3\u6761\u4ef6
SKUReport.SelectionCriteria=\u9078\u629e\u6761\u4ef6
SKUReport.ModifiedDays=\u6307\u5b9a\u65e5\u6570\u4ee5\u5185\u306e\u5909\u66f4\u3092\u5f37\u8abf\u8868\u793a
SKUReport.HierarchyWeight=\u968e\u5c64\u6bd4\u91cd
SKUReport.PrimaryHierarchy=\u7b2c 1 \u968e\u5c64
SKUReport.SecondaryHierarchy=\u7b2c 2 \u968e\u5c64
SKUReport.MatchedRulesAuditDate1=\u7b2c 1 \u76e3\u67fb\u65e5\u306e\u4e00\u81f4\u30eb\u30fc\u30eb
SKUReport.MatchedRulesAuditDate2=\u7b2c 2 \u76e3\u67fb\u65e5\u306e\u4e00\u81f4\u30eb\u30fc\u30eb



# Info/Error messages.
General.DeleteConfirmation=\u9078\u629e\u30a2\u30a4\u30c6\u30e0\u3092\u524a\u9664\u3057\u307e\u3059\u304b\uff1f
General.DeleteError=\u9078\u629e\u30a2\u30a4\u30c6\u30e0\u3092\u524a\u9664\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
General.DeleteMessage=\u9078\u629e\u30a2\u30a4\u30c6\u30e0\u304c\u524a\u9664\u3055\u308c\u307e\u3057\u305f\u3002
General.MissingRequiredFields=\u30a2\u30b9\u30bf\u30ea\u30b9\u30af (*) \u304c\u4ed8\u3044\u305f\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3059\u3079\u3066\u5fc5\u9808\u30d5\u30a3\u30fc\u30eb\u30c9\u3067\u3059\u3002
General.NoItemSelected=\u30a2\u30a4\u30c6\u30e0\u3092\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
General.RetrievalError=\u30c7\u30fc\u30bf\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
General.SaveError=\u5909\u66f4\u3092\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
General.SaveMessage=\u5909\u66f4\u304c\u4fdd\u5b58\u3055\u308c\u307e\u3057\u305f\u3002
General.SavingMessage=\u5909\u66f4\u3092\u4fdd\u5b58\u3057\u3066\u3044\u307e\u3059\u3002\u3057\u3070\u3089\u304f\u304a\u5f85\u3061\u304f\u3060\u3055\u3044...
General.TooManyItemsSelected=\u7de8\u96c6\u3059\u308b\u30a2\u30a4\u30c6\u30e0\u3092 1 \u3064\u3060\u3051\u9078\u629e\u3057\u307e\u3059\u3002
General.TableRetrievalError=\u30c6\u30fc\u30d6\u30eb\u4e00\u89a7\u3092\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
General.ColumnRetrievalError=\u5217\u306e\u4e00\u89a7\u3092\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
General.PageXofYMessage=\u30da\u30fc\u30b8 {0} / {1}
General.InsufficientPermission=\u30e6\u30fc\u30b6\u306f\u3053\u306e\u64cd\u4f5c\u3092\u5b9f\u884c\u3059\u308b\u306e\u306b\u5fc5\u8981\u306a\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
General.InsufficientColumnPermission=\u30e6\u30fc\u30b6\u306f\u3069\u306e\u5217\u306b\u3082\u5fc5\u8981\u306a\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
General.InsufficientColumnUpdatePermission= \u30e6\u30fc\u30b6\u306f 1 \u3064\u307e\u305f\u306f\u8907\u6570\u306e\u5217\u306b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
General.NoPermissionError=\u3053\u306e\u30da\u30fc\u30b8\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002
General.AuditDataWarning=\u5217\u3084\u968e\u5c64\u306e\u30e9\u30f3\u30ad\u30f3\u30b0\u3092\u66f4\u65b0\u3059\u308b\u3068\u65e2\u5b58\u306e\u76e3\u67fb\u30ec\u30b3\u30fc\u30c9\u304c\u7121\u52b9\u306b\u306a\u308a\u307e\u3059\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u3068\u3068\u3082\u306b\u76e3\u67fb\u30c6\u30fc\u30d6\u30eb\u3092\u4e00\u6383\u3057\u3066\u3001\u65b0\u3057\u304f\u76e3\u67fb\u30d9\u30fc\u30b9\u30e9\u30a4\u30f3\u30ec\u30b3\u30fc\u30c9\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u3092\u304a\u52e7\u3081\u3057\u307e\u3059\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u300eJDA Platform Installation/Administration Guide\u300f\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
Rank.SaveChangesConfirmation=\u4fdd\u5b58\u3055\u308c\u3066\u3044\u306a\u3044\u30e9\u30f3\u30ad\u30f3\u30b0\u306e\u5909\u66f4\u304c\u3042\u308a\u307e\u3059\u3002\u4fdd\u5b58\u3057\u307e\u3059\u304b\uff1f
Rank.ResetConfirmation=\u4fdd\u5b58\u3057\u3066\u3044\u306a\u3044\u30e9\u30f3\u30ad\u30f3\u30b0\u5909\u66f4\u3092\u3059\u3079\u3066\u30ea\u30bb\u30c3\u30c8\u3057\u307e\u3059\u304b\uff1f
Rank.MissingRanksMessage=\u3059\u3079\u3066\u306e\u5217\u3068\u968e\u5c64\u3092\u30e9\u30f3\u30af\u4ed8\u3051\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
ParameterGroup.MissingColumnsError=\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
ParameterGroup.DuplicateError=\u305d\u306e\u540d\u524d\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30b0\u30eb\u30fc\u30d7\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
ParameterGroup.ParameterRuleReferenceError=1 \u3064\u307e\u305f\u306f\u8907\u6570\u306e\u30eb\u30fc\u30eb\u304c\u30b0\u30eb\u30fc\u30d7\u304b\u3089\u524a\u9664\u4e2d\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u3092\u53c2\u7167\u3059\u308b\u305f\u3081\u3001\u5909\u66f4\u306f\u4fdd\u5b58\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u5148\u305a\u3001\u30eb\u30fc\u30eb\u3092\u66f4\u65b0\u3057\u3066\u304f\u3060\u3055\u3044\u3002
Rule.MissingHierarchyNode=\u7b2c 1 \u968e\u5c64\u304b\u3089\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u30ce\u30fc\u30c9\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
Rule.MissingParameterGroup=\u30d1\u30e9\u30e1\u30fc\u30bf\u30b0\u30eb\u30fc\u30d7\u3092\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
Rule.MissingParameterValue=\u30d1\u30e9\u30e1\u30fc\u30bf\u5024\u3092\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
Rule.MissingTPParameterValues=\u5024\u306f\u3059\u3079\u3066\u671f\u9593\u5225\u884c\u306b\u5165\u529b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
Rule.InvalidDates=\u7121\u52b9\u306a\u65e5\u4ed8\u5024\u304c\u5165\u529b\u3055\u308c\u307e\u3057\u305f\u3002
Rule.DateMismatch=\u6709\u52b9\u7d42\u4e86\u65e5\u306f\u6709\u52b9\u958b\u59cb\u65e5\u306e\u5f8c\u3067\u306a\u304f\u3066\u306f\u306a\u308a\u307e\u305b\u3093\u3002
Rule.DuplicateError=\u305d\u306e\u540d\u524d\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u30eb\u30fc\u30eb\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
Rule.HierarchyRetrievalError=\u968e\u5c64\u4e00\u89a7\u3092\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
Rule.HierarchyExpansionError=\u9078\u629e\u968e\u5c64\u30ce\u30fc\u30c9\u3092\u5c55\u958b\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
Rule.GroupRetrievalError=\u30d1\u30e9\u30e1\u30fc\u30bf\u30b0\u30eb\u30fc\u30d7\u306e\u4e00\u89a7\u3092\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
Rule.ParameterRetrievalError=\u9078\u629e\u30b0\u30eb\u30fc\u30d7\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u4e00\u89a7\u3092\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
Hierarchy.LimitExceeded={0} \u306e\u6700\u5927\u30b5\u30a4\u30ba\u5236\u9650\u306b\u3088\u308a\u7d50\u679c\u306f\u5236\u9650\u3055\u308c\u307e\u3057\u305f\u3002
RuleReport.NoRulesMatched=\u5165\u529b\u3055\u308c\u305f\u6761\u4ef6\u306b\u4e00\u81f4\u3059\u308b\u30eb\u30fc\u30eb\u306f\u3042\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
RuleReport.EmptyOptionSet=\u9078\u629e\u3057\u305f\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8\u306f\u7a7a\u3067\u3057\u305f\u3002
RuleReport.MissingOptionSetFields=\u30a2\u30b9\u30bf\u30ea\u30b9\u30af (*) \u306e\u4ed8\u3044\u305f\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3059\u3079\u3066\u5fc5\u9808\u3067\u3059\u3002
RuleReport.OperationTimedOut=\u30e6\u30fc\u30b6\u64cd\u4f5c\u304c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3057\u307e\u3057\u305f\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002


##
# Server Resources
##
PWB0000=\u4e0d\u660e\u306a\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\u30b7\u30b9\u30c6\u30e0\u4f8b\u5916\u306b\u906d\u9047\u3057\u307e\u3057\u305f\u3002

Error.InvalidDimension=\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3 {0} \u306e\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3\u30e1\u30bf\u30c7\u30fc\u30bf\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002
Error.InvalidHierarchy=\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3 {0}\u3001\u968e\u5c64 {1} \u306e\u968e\u5c64\u30e1\u30bf\u30c7\u30fc\u30bf\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002
Error.InvalidOldHierarchy=\u968e\u5c64 {0} \u306f\u73fe\u5728\u306f\u7121\u52b9\u3067\u3059\u3002 
Error.InvalidHierarchyExpansion=\u8981\u6c42\u3055\u308c\u305f\u968e\u5c64\u5c55\u958b\u306f\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3 {0}\u3001\u968e\u5c64 {1} \u306b\u306f\u7121\u52b9\u3067\u3059\u3002
Error.NoPrimaryRelationForHierarchyExpansion=\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3 {2}\u3001\u968e\u5c64 {3} \u306e\u5c55\u958b\u4e2d\u3001\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb {0}\u3001\u5217{1} \u306e\u30c6\u30fc\u30d6\u30eb\u306e\u9593\u306b\u306f\u4e3b\u8981\u306a\u95a2\u4fc2\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
Error.InvalidPredicate=\u30eb\u30fc\u30eb{0} \u306e\u9078\u629e\u968e\u5c64\u5024\u304c\u968e\u5c64 {1} \u306e\u5b9a\u7fa9\u30b9\u30c8\u30e9\u30af\u30c1\u30e3\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
Error.InvalidColumn=\u5217 {0} \u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093\u3002
Error.NoPredicates=\u30eb\u30fc\u30eb\u306b\u968e\u5c64\u304c\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
Error.MissingColumnRankData=\u5217\u30e9\u30f3\u30ad\u30f3\u30b0\u306e {0} \u306e\u30e9\u30f3\u30af\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
Error.MissingHierarchyRankData=\u968e\u5c64\u30e9\u30f3\u30ad\u30f3\u30b0\u306e {0} \u306e\u30e9\u30f3\u30af\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
Error.InvalidRowAccess={0} \u306e\u30eb\u30fc\u30eb\u968e\u5c64\u30ec\u30d9\u30eb\u30c7\u30fc\u30bf\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306f\u3001\u73fe\u5728\u306e\u30d5\u30a3\u30eb\u30bf\u8a2d\u5b9a\u3067\u5236\u9650\u3055\u308c\u307e\u3059\u3002
Error.InufficientFiltersUsedPrimary=\u30eb\u30fc\u30eb\u3067\u306f\u3001\u73fe\u5728\u306e\u30d5\u30a3\u30eb\u30bf\u3067\u8a2d\u5b9a\u3055\u308c\u305f\u30ec\u30d9\u30eb\u306b\u8ff0\u90e8\u304c\u8a2d\u5b9a\u3055\u308c\u307e\u305b\u3093\u3002
Error.NoPWBDimensionExists=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\u304c\u6709\u52b9\u3068\u306a\u3063\u3066\u3044\u308b\u30c7\u30a3\u30e1\u30f3\u30b7\u30e7\u30f3\u306b\u306f\u4e0d\u53ef\u3002

##
# SRE Resources
##
Gensys.ParamWB.ParameterUpdate=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\uff1a \u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0
Gensys.ParamWB.RuleReport=\u30d1\u30e9\u30e1\u30fc\u30bf\u30ef\u30fc\u30af\u30d9\u30f3\u30c1\uff1a \u30eb\u30fc\u30eb\u30ec\u30dd\u30fc\u30c8
Gensys.ParamWB.Option.BaseSchema=\u30d9\u30fc\u30b9\u30b9\u30ad\u30fc\u30de
Gensys.ParamWB.Option.BaseTable=\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb
Gensys.ParamWB.Option.RunDate=\u5b9f\u884c\u65e5
Gensys.ParamWB.Option.RuleGroup=\u30eb\u30fc\u30eb\u30b0\u30eb\u30fc\u30d7
Gensys.ParamWB.Option.RuleGroupControl=\u30eb\u30fc\u30eb\u30b0\u30eb\u30fc\u30d7\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb
Gensys.ParamWB.Option.RunDataType=\u30aa\u30fc\u30c7\u30a3\u30c3\u30c8\u30c8\u30ec\u30a4\u30eb
Gensys.ParamWB.Option.AuditDate1=\u7b2c 1 \u76e3\u67fb\u65e5
Gensys.ParamWB.Option.AuditDate2=\u7b2c 2 \u76e3\u67fb\u65e5
Gensys.ParamWB.Option.AuditDate=\u76e3\u67fb\u65e5

SREOption.NoSearchIndicator=\u691c\u7d22\u304c\u3042\u308a\u307e\u305b\u3093
SREOption.NoSearchSpecified=\u691c\u7d22\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
SREOption.OptionsChanged=\u4e00\u90e8\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8\u3092\u4fdd\u5b58\u3057\u3066\u51e6\u7406\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SREOption.InvalidData=\u7121\u52b9\u306a\u6587\u5b57\u3084\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3001\u307e\u305f\u306f\u672a\u5165\u529b\u306e\u30c7\u30fc\u30bf\u304c\u306a\u3044\u304b\u3069\u3046\u304b\u5f37\u8abf\u8868\u793a\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SREOption.SaveOptions=\u30d7\u30ed\u30bb\u30b9\u5b9f\u884c\u524d\u306b\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8\u3092\u4fdd\u5b58\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SREOption.MissingGroup=\u30eb\u30fc\u30eb\u30b0\u30eb\u30fc\u30d7\u30b3\u30f3\u30c8\u30ed\u30fc\u30eb\u306e [\u540d\u524d] \u304c\u9078\u629e\u3055\u308c\u308b\u3068\u3001\u30eb\u30fc\u30eb\u30b0\u30eb\u30fc\u30d7\u3092\u5165\u529b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
JobRequestError.NoSearches=\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0\u30d7\u30ed\u30bb\u30b9\u306b\u3064\u3044\u3066\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u691c\u7d22\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
JobRequestError.InvalidSearches=\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0\u30d7\u30ed\u30bb\u30b9\u306b\u6307\u5b9a\u3055\u308c\u305f\u691c\u7d22\u304c\u7121\u52b9\u3067\u3059\u3002
JobRequestError.OptionsRetrieval=\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0\u30d7\u30ed\u30bb\u30b9\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JobRequestError.InvalidBaseTableOption=\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0\u30d7\u30ed\u30bb\u30b9\u306b\u6307\u5b9a\u3055\u308c\u305f\u30d9\u30fc\u30b9\u30b9\u30ad\u30fc\u30de\u30aa\u30d7\u30b7\u30e7\u30f3\u3068\u30c6\u30fc\u30d6\u30eb\u30aa\u30d7\u30b7\u30e7\u30f3\u3001\u307e\u305f\u306f\u305d\u306e\u3069\u3061\u3089\u304b\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3059\u3002
JobRequestError.InvalidRunDateOption=\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0\u30d7\u30ed\u30bb\u30b9\u306b\u6307\u5b9a\u3055\u308c\u305f\u5b9f\u884c\u65e5\u4ed8\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3059\u3002
JobRequestError.InvalidSearchForBaseTableOption=\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0\u30d7\u30ed\u30bb\u30b9\u3067\u306f\u3001\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb {1} \u306b\u691c\u7d22{0} \u306f\u7121\u52b9\u3067\u3059\u3002
JobRequestError.InvalidRuleGroupOption=\u30d1\u30e9\u30e1\u30fc\u30bf\u306e\u66f4\u65b0\u30d7\u30ed\u30bb\u30b9\u306e\u30eb\u30fc\u30eb\u30b0\u30eb\u30fc\u30d7\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u305d\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3059\u3002
JobRequestError.EffectiveRulesLoadException=\u6709\u52b9\u306a\u30eb\u30fc\u30eb\u4e00\u89a7\u3092\u53d6\u5f97\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
JobRequestError.EffectiveRuleException=1 \u3064\u307e\u305f\u306f\u8907\u6570\u306e\u6709\u52b9\u30eb\u30fc\u30eb\u306b\u30a8\u30e9\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
JobRequestError.NoEffectiveRuleException=\u6307\u5b9a\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8\u306b\u6709\u52b9\u306a\u30eb\u30fc\u30eb\u304c\u3042\u308a\u307e\u305b\u3093\u3002

JobSummaryExtension.NumberOfEffectiveRules=\u6709\u52b9\u30eb\u30fc\u30eb\u6570\uff1a
