PatchinstallMessage=Inici\u00f3 instalaci\u00f3n de parche....
jarUnavailabel=No se ha podido ubicar el archivo jar del parche en la ubicaci\u00f3n especificada. Aseg\u00farese de que la ubicaci\u00f3n y los nombres del archivo jar del parche son v\u00e1lidos y correctos.
installing=Instalando parche....
alreadyInstalled=Este parche ya est\u00e1 instalado. Anulando la instalaci\u00f3n del parche.
serverRunning=Se ha detectado que el Servidor de JDA o el Administrador de grupo de nodos est\u00e1n en ejecuci\u00f3n. Detenga el Servidor/Administrador de grupo de nodos antes de instalar el parche. Si est\u00e1 en un cl\u00faster, todos los otros servidores relevantes deben detenerse, incluyendo otros servidores en el cl\u00faster, servidor admin (Weblogic), agentes de nodo (WebSphere) y administrador de implementaci\u00f3n (WebSphere) 
monitorInstalled=Delegando el control a la aplicaci\u00f3n Monitor
scpoInstalled=Delegando el control a la aplicaci\u00f3n SCPO
collabInstalled=Delegando el control a la aplicaci\u00f3n Collaborate/Market Manager
bimodelInstalled=Delegando el control a la aplicaci\u00f3n Reporting/Analytics
readDoc=Revise el archivo L\u00e9ame correspondiente a este parche para informarse sobre posibles cambios manuales requeridos despu\u00e9s de aplicar el parche
patchLabel=Instalando versi\u00f3n
buildDate=Fecha de generaci\u00f3n         
appSerevr=Servidor de la aplicaci\u00f3n 
patchType=Tipo de parche
SRE=SRE
server=Servidor
help=Ayuda
backup=Creando archivo de copia de seguridad
installconfirm=\u00bfEst\u00e1 seguro de que desea instalar el parche?
installabort=Anul\u00f3 instalaci\u00f3n de parche
verifyForCorrectInstall=Verifique que est\u00e1 instalando el parche correcto...
currentPatchLabel=Versi\u00f3n actual instalada
invalidRevert=Reversi\u00f3n no v\u00e1lida. Para esta versi\u00f3n de instalaci\u00f3n s\u00f3lo puede revertir archivo
canNotRevertMore=No puede revertir m\u00e1s all\u00e1 de esto
wrongAppServer=Se detect\u00f3 un servidor de aplicaci\u00f3n no compatible
corruptedZip=El archivo zip del parche est\u00e1 da\u00f1ado o no es v\u00e1lido
verifyForCorrectDbPatchInstall=El parche no es v\u00e1lido. Verifique que est\u00e1 proporcionado la combinaci\u00f3n correcta para las opciones de la base de datos y el archivo de parche.
