PatchinstallMessage=Patch de Instala\u00e7\u00e3o iniciado...
jarUnavailabel=N\u00e3o foi poss\u00edvel localizar o vaso de patch no local especificado. Certifique-se de que os nomes da localiza\u00e7\u00e3o do patch e do vaso de patch sejam v\u00e1lidos e corretos.
installing=Instalando patch...
alreadyInstalled=Este patch j\u00e1 est\u00e1 instalado. Anulando instala\u00e7\u00e3o do patch.
serverRunning=Detectou que o Servidor JDA ou o Gerenciador de Pool de N\u00f3 est\u00e1 em execu\u00e7\u00e3o. Pare os gerenciadores de Pool de N\u00f3/Servidor antes de instalar o patch. Se voc\u00ea estiver em um grupo, todos os outros servidores relevantes devem ser interrompidos, incluindo outros servidores no grupo, servidor administrador (Weblogic), agentes de n\u00f3s (WebSphere) e gerenciador de implementa\u00e7\u00e3o (WebSphere) 
monitorInstalled=Delegar controle para o aplicativo de Monitora\u00e7\u00e3o
scpoInstalled=Delegar controle para o aplicativo SCPO
collabInstalled=Delegar controle para o aplicativo Gerenciador de Colabora\u00e7\u00e3o/Mercado
bimodelInstalled=Delegar controle para o aplicativo Relat\u00f3rios/Analytics
readDoc=Verifique o Readme do Patch para quaisquer altera\u00e7\u00f5es manuais necess\u00e1rias depois de aplicar este patch.
patchLabel=Instalar Vers\u00e3o
buildDate=Data da Compila\u00e7\u00e3o         
appSerevr=Servidor de Aplicativos 
patchType=Tipo de Patch
SRE=SRE
server=Servidor
help=Ajuda
backup=Cria\u00e7\u00e3o do arquivo de backup
installconfirm=Tem certeza de que deseja instalar o patch?
installabort=Instala\u00e7\u00e3o do patch abortada
verifyForCorrectInstall=Verifique se voc\u00ea est\u00e1 instalando o patch correto...
currentPatchLabel=Vers\u00e3o Instalada Atual
invalidRevert=Revers\u00e3o Inv\u00e1lida. Para esta vers\u00e3o da instala\u00e7\u00e3o, voc\u00ea s\u00f3 pode reverter o arquivo
canNotRevertMore=N\u00e3o \u00e9 poss\u00edvel reverter para al\u00e9m disso
wrongAppServer=Servidor de aplicativos incompat\u00edvel detectado
corruptedZip=O arquivo compactado do patch est\u00e1 corrompido ou n\u00e3o \u00e9 v\u00e1lido
verifyForCorrectDbPatchInstall=Patch inv\u00e1lido. Verifique se voc\u00ea est\u00e1 fornecendo a combina\u00e7\u00e3o correta de op\u00e7\u00f5es de banco de dados e arquivo de patch.
