
PlanningException.0:
PlanningException.1: Red inexistente
PlanningException.2: Ubicaci\u00f3n cerrada en LlegPlan:FechaEnvProgr
PlanningException.3: UDA:TipoReabast no v\u00e1lido
PlanningException.4: No se pudo planificar esta UDA
PlanningException.5: Par\u00e1mPlanifUDA:NormaDRP no v\u00e1lida
PlanningException.6: Ubicaci\u00f3n cerrada en LlegPlan:FechaLlegProgr
PlanningException.7: No se encuentran or\u00edgenes para esta ubicaci\u00f3n
PlanningException.8: Par\u00e1mPlanifUDA:CantDRPM\u00edn no v\u00e1lida
PlanningException.9: RegisEA no v\u00e1lido
PlanningException.10: Ubicaci\u00f3n inexistente
PlanningException.11: UDA inexistente
PlanningException.12: UDA base. Sin planificar
PlanningException.13: EnvRecom no se pudo programar antes de la Duraci\u00f3n de env\u00edos recomendados y por consiguiente fue cancelado
PlanningException.14: Ubicaci\u00f3n cerrada en EnvRecom:FechaLlegProgr
PlanningException.15: Par\u00e1mPlanifUDA:NormaPPP no v\u00e1lida
PlanningException.16: Par\u00e1mPlanifUDA:CantPPPM\u00edn no v\u00e1lida
PlanningException.17: Producci\u00f3n cerrada
PlanningException.18: Se neg\u00f3 el acceso a planificaci\u00f3n PPP
PlanningException.19: Se neg\u00f3 el acceso a planificaci\u00f3n DRP
PlanningException.20: EnvRecom limitados no implementados
PlanningException.21: Duraci\u00f3n de EnvRecom no es v\u00e1lida
PlanningException.22: Estrategia de asignaci\u00f3n no v\u00e1lida
PlanningException.23: Suministro:CantEnvMyr menor de 1; el valor usado es 1
PlanningException.24: EnvRecom:FechaEnvProgr movido
PlanningException.25: ParamRepartici\u00f3nUDA:CalEnvRecom no v\u00e1lida
PlanningException.26: No se pudo recomendar esta UDA
PlanningException.27: LlegPlan:FechaEnvRequer en o anterior a RegisEA
PlanningException.28: Par\u00e1mPlanifUDA:DurPlan < tiempoespera/l\u00edmite de per\u00edodo
PlanningException.29: Par\u00e1mPlanifUDA:EAM\u00e1x < stock de seguridad
PlanningException.30: UDA con LDM/Red circular o configuraci\u00f3n inviable de UDA en LDM y Reemplazo
PlanningException.31: LlegPlan:Dest no v\u00e1lida
PlanningException.32: Par\u00e1mPlanifUDA:IncCantPPP no v\u00e1lida
PlanningException.33: Par\u00e1mPlanifUDA:IncCantDRP no v\u00e1lida
PlanningException.34: LPMAXPLAN alcanzado
PlanningException.35: Suministro/OrigRepartDin:CalLleg no v\u00e1lido
PlanningException.36: ParamDemandaUDA:CalAsign no v\u00e1lido
PlanningException.37: Par\u00e1mPlanifUDA:CalProd no v\u00e1lido
PlanningException.38: ProyUDAStat:EAProy > Par\u00e1mPlanifUDA:EAM\u00e1x
PlanningException.39: Stock disp. limit.; estrategia asign. usada

PlanningException.40: EnvRecom:FechaLlegProgr movido
PlanningException.41: ParamRepartici\u00f3nUDA:M\u00ednDurAsign mayor que la opci\u00f3n DurEnvRecom
PlanningException.42: LlegPlan:FechaEnvProgr movido
PlanningException.43: LlegPlan:FechaLlegProgr movido
PlanningException.44: EnvRecom:FechaEnvRequer en o anterior a RegisEA
PlanningException.45: LlegPlan eliminada debido a valor en Par\u00e1mPlanifUDA:EAM\u00e1x
PlanningException.46: LlegPlan sin fila de suministro coincidente
PlanningException.47: DurStockDisp > M\u00ednDurAsign; se util. M\u00ednDurAsign
PlanningException.48: ParamRepartici\u00f3nUDA:FactorSSExced < ParamRepartici\u00f3nUDA:FactorSSEscasez
PlanningException.49: DurRepDin y ParamRepartici\u00f3nUDA:DurStockDisp no son v\u00e1lidos
PlanningException.50: UDA:DurEscasez excede el hor. (DurAsigDin o SAD)
PlanningException.51: Existe escasez en el horizonte y no se satisface
PlanningException.52: DurM\u00e1xSistPedClien para NormaAjtPrev 6 no v\u00e1lida
PlanningException.53: Repartici\u00f3n din\u00e1mica - Problema inviable
PlanningException.54: Dem. ignorada antes de la prim. fecha reab.
PlanningException.55: DurCobDRP se ha ajustado
PlanningException.56: No se pudo satisfacer requisitos de vida \u00fatil
PlanningException.57: DurCobMP se ha ajustado
PlanningException.58: Se ha encontrado un inv. en firme no utilizable
PlanningException.59: Se ha encontrado un inventario vencido
PlanningException.60: Tolerancia de vida \u00fatil en utilizada
PlanningException.61: No se pudo satisfacer los requisitos en firme
PlanningException.62: Cantidad reducida para evitar desechos
PlanningException.63: DurPrev excede 1 a\u00f1o; compruebe CalDem UPD
PlanningException.64: SustArt:CantConsumo <= 0; por defecto 1
PlanningException.65: Origen no procesado debido a destino suprimido
PlanningException.66: Nivel de plan no v\u00e1lido
PlanningException.67: DurVida\u00datil no v\u00e1lida
PlanningException.68: GrupoVida\u00datil no v\u00e1lido
PlanningException.69: PrimFechaReabast es posterior a Par\u00e1mPlanifUDA:FechaCad
PlanningException.70: La escasez se satisface con env\u00edo posterior
PlanningException.71: Excedente en ubicaci\u00f3n alternativa sin suministro
PlanningException.72: Art\u00edculo:CantAsigDin no v\u00e1lido; est. predet. 1
PlanningException.73: Demanda fuera de la FechaFinProd
PlanningException.74: Las demandas en la fecha de caducidad o posteriores se ignorar\u00e1n
PlanningException.75: Fecha de caducidad no v\u00e1lida
PlanningException.76: Cantidad no utilizable en reabastecimiento programado
PlanningException.77: No se pudo satisfacer la fecha de caducidad de la demanda, demanda ignorada
PlanningException.78: No se han generado las proyecciones de UDA
PlanningException.79: La estrategia de asignaci\u00f3n tiene una prioridad no v\u00e1lida
PlanningException.80: No se pudo satisfacer dem FechaCaduc, dem satisfecha de todas formas
PlanningException.81: Fecha de caducidad de oferta no v\u00e1lida (FECHAANTICIPADA), Se asumir\u00e1 FechaRetrasada
PlanningException.82: Fecha de vencimiento de demanda de distribuci\u00f3n no v\u00e1lida (FECHAANTICIPADA o FECHARETRASADA), Se asumir\u00e1 como Demanda independiente
PlanningException.83: No se encontr\u00f3 un suministro efectivo para la UDA alternativa

PlanningException.84: Relaci\u00f3n LDM inv\u00e1lida:Se hall\u00f3 una superposici\u00f3n de LDM
PlanningException.85: UDA perecederas repartidas usando la NormaAsignEnvRecomSec 3; no se respetan los requisitos de frescura del producto o las limitaciones de desecho
PlanningException.86: NormaAsignEnvRecomSec 3 no admiten NivelDetRepart > 1. Se usa de forma predeterminada NivelDetRepart 1
PlanningException.87: NormaAsignEnvRecomSec 3 no se admite con Reemplazo. Se usa de forma predeterminada NormaAsignEnvRecomSec 1
PlanningException.88: Suministro no efectivo en RegisEA
PlanningException.89: Suministro no v\u00e1lido: UDA origen no v\u00e1lida
PlanningException.90: No se calcul\u00f3 el Tiempo de espera acumulado debido a registros de Suministros no v\u00e1lidos

PlanningException.91: DurEnvRecom menor que M\u00ednDurAsign, ampliar el horizonte de repartici\u00f3n hasta M\u00ednDurAsign
PlanningException.92: Reemplazo no se admite con DSI; se ignorar\u00e1 la relaci\u00f3n de Reemplazo.
PlanningException.93: Se ignor\u00f3 la llegada planificada de UDA de movimiento lento
PlanningException.100: Suministro:CalEnv o OrigRepartDin:CalEnv no v\u00e1lidos
PlanningException.101: Datos incompletos en tabla UDA relacionada
PlanningException.102: Pedido suplementario creado para un TIPO DE UDA inv\u00e1lido
PlanningException.103: Pedido suplementario: ReleaseStartDate es previa a NeedArrivDate
PlanningException.104: Pedido suplementario parcialmente retrasado o no satisfecho; Se necesitaba antes de FirstReplenDate
PlanningException.105: El pedido suplementario activo est\u00e1 dentro de la duraci\u00f3n de la cobertura para la UDA
#Added the description for exception type 107 - MaxCovDur constraint.
PlanningException.107: Infracci\u00f3n de DurCobM\u00e1x
PlanningException.106: El pedido suplementario no se admite para UDA perecederas
PlanningException.108: Par\u00e1mPlanifUDA:CalTrabajo no v\u00e1lido
PlanningException.109: Las Existencias actuales proyectadas infringen la limitaci\u00f3n EAM\u00e1x
PlanningException.110: Los pedidos suplementarios forzados no se admiten para las UPD de reemplazo
PlanningException.111: Los pedidos suplementarios no se respetan al implementar las UDA con SecRSAllocRule 3
PlanningException.112: Plantilla SS incorrecta
PlanningException.113: Oferta restante en Origen Push Inmediato en DurStockDisp
PlanningException.114: EDC tiene precedencia sobre Reemplazo.

#Added the descriptions for Plan exceptions for Convenience Rounding
PlanningException.115: CantEnvConveniente no es un m\u00faltiplo de CantDRPIncr.
PlanningException.116: El redondeo a conveniencia no se respeta cuando la NormaDRP se ha fijado en Ordenar hasta cantidad.
PlanningException.117: No se admite reemplazo circular con reducci\u00f3n de demanda.


PlanningException.203: Par\u00e1mPlanifUDA:DurRecepProgrRecom no v\u00e1lida

# FlowThrough Plan Exceptions .... 149-162
PlanningException.149: CalEnvRecom no est\u00e1 en sincronizaci\u00f3n con CaLlegl o CalProd para UDARepartoDirecto en DurPlan
PlanningException.150: La demanda de distribuci\u00f3n (salidas en tr\u00e1nsito) en UDA de reparto directo no se puede satisfacer con ofertas en firme
PlanningException.151: Oferta de reabastecimiento planificada no se puede asignar a ninguno de los destinos
PlanningException.152: La oferta en firme no se puede asignar a ninguno de los destinos 
PlanningException.153: Se ignor\u00f3 la l\u00f3gica del plan de reparto directo para la UDA de NivelPedidoHasta
PlanningException.154: En el plan de reparto directo no se respet\u00f3 la limitaci\u00f3n de EAM\u00e1x
PlanningException.155: En el plan de reparto directo no se respet\u00f3 la limitaci\u00f3n del factor de redondeo
PlanningException.156: En el plan de reparto directo no se respet\u00f3 la limitaci\u00f3n de DURCOBM\u00c1X
PlanningException.157: En el plan de reparto directo no se respet\u00f3 la limitaci\u00f3n de reducci\u00f3n de demanda
PlanningException.158: En el plan de reparto directo no se respet\u00f3 la l\u00f3gica de restricci\u00f3n del plan
PlanningException.159: Se ignor\u00f3 la l\u00f3gica del plan de reparto directo para UDA perecedera
PlanningException.160: Se ignor\u00f3 la l\u00f3gica del plan de reemplazo para la UDA de reparto directo
PlanningException.161: Se extendi\u00f3 Tiempoespera de LlegPlan a UDA de reparto directo para poder alinear FechaLlegProgr con CalEnvRecom
PlanningException.162: La demanda de distribuci\u00f3n en UDA de reparto directo no se puede satisfacer con ofertas en firme o planificadas

# MAX Wastage Calculations - Ignored Demands Exception 
PlanningException.163: Se ignor\u00f3 la demanda debido al FactorM\u00e1xDesecho
PlanningException.164: Se ignor\u00f3 el stock de seguridad debido al FactorM\u00e1xDesecho

# exception for ignoring rounding factor,maxcovdur,maxoh constraint for perishable item
PlanningException.165: No se respet\u00f3 la restricci\u00f3n del factor de redondeo para el art\u00edculo perecedero
PlanningException.166: No se respet\u00f3 la restricci\u00f3n de DurCobM\u00e1x para art\u00edculos perecederos
PlanningException.167: No se respet\u00f3 la restricci\u00f3n de EAM\u00e1x para art\u00edculos perecederos

#Added the description for exception type 204, 220758
PlanningException.204: No se encontr\u00f3 la UDA en la tabla EstadUDAEstat.

# Inventory management validation exceptions start here....
# Calculate SKU MSE Exceptions: 241 - 250
PlanningException.221: No hay calendario diario
PlanningException.222: No hay coincidencias
PlanningException.223: No hay previsi\u00f3n
PlanningException.224: No hay historia
PlanningException.225: Faltan datos en HistUDA
PlanningException.226: Faltan datos en PrevHistUDA/HistUDA
PlanningException.227: No se encontraron destinos efectivos para esta ubi

PlanningException.241: Falta UPDaUDA
PlanningException.242: No hay fecha de registro de demanda o dicha fecha es 01/01/1970
PlanningException.243: Faltan datos en Hist o PrevHist
PlanningException.244: Valor no v\u00e1lido de Cal:N\u00famPerPrev en el calendario de demanda
PlanningException.245: Fecha de registro de demanda inconsistente en UPD/Par\u00e1mStockSegurUDA
PlanningException.246: Calendario de demanda inconsistente en UPD
PlanningException.247: Los datos del calendario de demanda no son v\u00e1lidos
PlanningException.248: Par\u00e1mBD nombre de calendario no v\u00e1lido
PlanningException.249: Par\u00e1mStockSegurUDA:PeriodEMC no v\u00e1lido
PlanningException.250: No hay ninguna UPDaUDA efectiva en el per\u00edodo
PlanningException.251: Combinaci\u00f3n TipoDemDist/M\u00e9trNDS no v\u00e1lida
PlanningException.252: NDSEstadSS no v\u00e1lida
PlanningException.253: EMC no v\u00e1lida
PlanningException.254: DurPrev no v\u00e1lida
PlanningException.255: Tiempo de espera no v\u00e1lido
PlanningException.256: N\u00famReabastA\u00f1o no v\u00e1lido
PlanningException.257: PromN\u00famL\u00edneas no v\u00e1lido
PlanningException.258: Previsi\u00f3n no v\u00e1lida
PlanningException.259: VarDem no v\u00e1lida
PlanningException.260: PromDem no v\u00e1lido
PlanningException.261: L\u00edmite de cobertura utilizado
PlanningException.262: El c\u00e1lculo de cobertura futura no se admite en EstadSS por etapas
PlanningException.263: El c\u00e1lculo de cobertura futura no se admite en PromDem por etapas
PlanningException.264: No se admite el alisado/c\u00e1lculo de EMC por etapas
PlanningException.265: Par\u00e1mStockSegurUDA:EMCAntic no v\u00e1lido
PlanningException.266: Par\u00e1mStockSegurUDA:DEtiempoespera no v\u00e1lido
PlanningException.267: Par\u00e1mStockSegurUDA:CalDemMed no v\u00e1lido
PlanningException.268: Par\u00e1mStockSegurUDA:FechaRegisDem es mayor que RegisEA
PlanningException.269: Norma EMC no es v\u00e1lida
PlanningException.270: N\u00famero escaso de observaciones al calcular EMC de UDA
PlanningException.271: Los valores MIN/MAX para la exclusi\u00f3n de proporci\u00f3n no son v\u00e1lidos
PlanningException.272: Los valores MIN/MAX para la exclusi\u00f3n de porcentaje no son v\u00e1lidos

PlanningException.273: Existen varias entradas de LDM para el mismo principal porque los valores de compensaci\u00f3n y efec son diferentes
PlanningException.274: No hay principales efectivos para el componente de LDM proporcionado
PlanningException.275: Cantidad descontada en la etapa de consumo cero
PlanningException.276: Debido a que la informaci\u00f3n de EMC de principales no est\u00e1 disponible, no se considera.
PlanningException.277: La LDM tiene 100 por ciento de reducci\u00f3n, ignorar el factor de reducci\u00f3n.
PlanningException.278: La LDM tiene 0 porcentaje de rendimiento, ignorar el factor de rendimiento.

# Automated Load Builder exceptions

PlanningException.300: Se ha utilizado el modo de transporte alternativo
PlanningException.301: L\u00f3gica del b\u00fafer aplicada a la fecha de disponibilidad para env\u00edo
PlanningException.302: Al dividir EnvRecom se ha originado un nuevo EnvRecom con una cantidad inferior a Suministro:CantDiv
PlanningException.303: No se pudo encontrar una conversi\u00f3n a una categor\u00eda de restricci\u00f3n de UdM
PlanningException.304: Carga de recogida m\u00faltiple no v\u00e1lida. Compruebe inconsistencias en CargaVeh:FechaEnv o FechaLleg.
PlanningException.305: Se ha alcanzado el l\u00edmite m\u00e1ximo de CargaVeh, omitiendo la ruta para la ejecuci\u00f3n de PCT. Esto afect\u00f3 a todos los EnvRecom de esta ruta.


#Allocation exceptions: 400 - 500

PlanningException.400: Situaci\u00f3n de stock limitado

# Store Segmentation exceptions.
PlanningException.500: No se encontr\u00f3 la historia o todo es cero.
PlanningException.501: Existe una relaci\u00f3n de muchos a uno por lo que se omite la UPD.
PlanningException.502: Existe una relaci\u00f3n de uno a muchos por lo que se omite la UDA.

# History Cleaning exceptions.
PlanningException.8001: Los datos de PrevHist no est\u00e1n disponibles.
PlanningException.8002: Falta de coincidencia de los valores estacionales con la periodicidad.
PlanningException.8003: Los datos de historial no est\u00e1n disponibles.
PlanningException.8004: Se\u00f1al falsa de fuera de stock para una UPD.
PlanningException.8005: No hay presentes datos de PrevPerfEstat para el per\u00edodo.
PlanningException.8006: No existe una relaci\u00f3n de UPD a UDA v\u00e1lida.
PlanningException.8007: El calendario de asignaci\u00f3n asociado con la UDA que est\u00e1 relacionada a la UPD actual no es v\u00e1lido.
PlanningException.8008: El evento de movimiento no es v\u00e1lido.
PlanningException.8009: Faltan datos de Evento de movimientos.


PlanningException.1001: Calendario de demanda no v\u00e1lido
PlanningException.1007: No se encontr\u00f3 la historia o todo es cero


# Shelf Connected Supply Chain Exceptions - 3000 - 3500
# Out OF Stock Process Exceptions.
PlanningException.3000: Fecha de inicio no v\u00e1lida.  
PlanningException.3001: Flujo de historial no v\u00e1lido. 
PlanningException.3002: De acuerdo al flujo de historial seleccionado, no hay datos de historial disponibles para esta UDA 
PlanningException.3003: No hay existencias actuales v\u00e1lidas registradas para esta UDA
PlanningException.3004: No hay un promedio semanal v\u00e1lido asociado para esta UDA.
PlanningException.3005: La fecha de inicio del proceso OutOfStock no tiene un calendario de efectividad v\u00e1lido
PlanningException.3006: No se encontr\u00f3 una categor\u00eda v\u00e1lida para esta UDA
PlanningException.3007: No se encontr\u00f3 un Par\u00e1mPlanifUDA para esta UDA
PlanningException.3008: No se encontr\u00f3 un Par\u00e1mDemUDA para esta UDA
PlanningException.3009: No est\u00e1 disponible la tabla SkuFactsData de esta UDA para la duraci\u00f3n seleccionada

# Publish Data For Reports Process Exceptions.

PlanningException.3030: No se encontr\u00f3 un suministro efectivo para la UDA
PlanningException.3031: El CD relacionado a la red de vendedor no tiene el vendedor apropiado asociado a \u00e9l
PlanningException.3032: No se admiten m\u00faltiples suministros a una tienda
PlanningException.3033: La tienda est\u00e1 en la red de vendedor equivocada y este origen no deber\u00eda satisfacerla
PlanningException.3034: No hay datos de hist\u00f3rico de stock de UDA v\u00e1lidos para esta UDA
PlanningException.3035: No hay existencias actuales v\u00e1lidas registradas para esta UDA
PlanningException.3036: No hay datos v\u00e1lidos de PrevHist para esta UDA
PlanningException.3037: No existe una UPD v\u00e1lida asociada con la UDA, por lo tanto no se est\u00e1n ingresando datos al informe relacionado con la UPD
PlanningException.3150: Existe una relaci\u00f3n de uno a muchos o de muchos a uno entre la UDA y la UPD en la tabla UPDAUDA

# Publish Root Causes Process Exceptions.

PlanningException.3100: La fecha de inicio del proceso de la UDA no es v\u00e1lida ya que es despu\u00e9s de la fecha de registro EA de UDA.
PlanningException.3101: Faltan datos de la UPD ya que el proceso no pudo asociar ninguna UPD con la UDA.
PlanningException.3102: Falta la previsi\u00f3n de hist anticipada anterior de la UDA.
PlanningException.3103: El calendario de asignaci\u00f3n asociado con la UDA no es v\u00e1lido.


# Transfer Fcst Exceptions
PlanningException.4018:Falta uno o m\u00e1s registros de par\u00e1metros de UDA para esta UDA.

# Material Allocation Exceptions

PlanningException.5000:
PlanningException.5001:
PlanningException.5002:
PlanningException.5003:
PlanningException.5004:
PlanningException.5005:
PlanningException.5006:
PlanningException.5007:
PlanningException.5008:
PlanningException.5009: Exceso de inventario de UDA subordinada
PlanningException.5010:
PlanningException.5011:
PlanningException.5012:
PlanningException.5013:
PlanningException.5014:
PlanningException.5015:
PlanningException.5016:
PlanningException.5017:
PlanningException.5018:
PlanningException.5019:
PlanningException.5020:
PlanningException.5021: El inventario es insuficiente para satisfacer las demandas en firme
PlanningException.5022: No se pudo satisfacer las demandas en firme en tiempo
PlanningException.5023: Comparte una UDA principal con otra UDA subordinada seleccionada
PlanningException.5024: La UDA principal tiene m\u00e1s de una UDA subordinada seleccionada
PlanningException.5025: Miembro de un \u00e1rbol no v\u00e1lido
PlanningException.5026: Consumo de UDA base retrasada debido al calendario de producci\u00f3n
PlanningException.5027: Se ha infringido la duraci\u00f3n del retraso de producci\u00f3n debido al calendario de producci\u00f3n
PlanningException.5028: No tiene ning\u00fan registro en la tabla Par\u00e1mAsigMatUDA
PlanningException.5029: No tiene ning\u00fan registro en la tabla Par\u00e1mPlanifUDA
PlanningException.5030: No tiene un nivel v\u00e1lido

# Dynamic Generation of Allocation Calendars exceptions 5100....

PlanningException.5100: Grupo de calendario de asignaci\u00f3n no definido
PlanningException.5101: No hay datos en CustOrderHist en per\u00edodo de observaci\u00f3n
PlanningException.5102: Calendario de asignaci\u00f3n reemplazado
PlanningException.5103: El calendario principal especificado no existe
PlanningException.5104: El calendario principal especificado no existe. No se ha procesado GrupoCalAsign.


# Dynamic Demand Response exceptions 5200....

PlanningException.5200: No hay mapeos efectivos de UPDaUDA
PlanningException.5201: No se encontr\u00f3 PerfilPar\u00e1mDDR
PlanningException.5202: No se encontr\u00f3 CalAsign efectiva
# PlanningException.5203: Base Proration Duration greater than DDR Duration
PlanningException.5204: Duraci\u00f3n de prorrateo NoBase es mayor que Duraci\u00f3n de DDR
PlanningException.5205: No se encontr\u00f3 PerfilPar\u00e1mDDR para GrupoDDR
PlanningException.5206: No se encontr\u00f3 CalAsign efectivo. No se procesar\u00e1 GrupoDDR
PlanningException.5208: DurProrrat NoBase es mayor que Duraci\u00f3nDDR para GrupoDDR
PlanningException.5209: No hay mapeos efectivos de UPDaUDA. No se procesar\u00e1 GrupoDDR
PlanningException.5210: No existe UPD primaria definida para GrupoDDR. No se procesar\u00e1 GrupoDDR


# Calculate Statistics exceptions 5300....

PlanningException.5300: No encontr\u00f3 registro de historia v\u00e1lido
PlanningException.5301: No existe un historial v\u00e1lido luego de excluir pedidos parciales y de promoci\u00f3n
PlanningException.5303: No se encuentran registros de historia para GrupoDDR
PlanningException.5304: No hay historia v\u00e1lida luego de excluir pedidos parciales y promocionales para GrupoDDR


# Identify Promotional Orders exceptions 5400 and 5401....

PlanningException.5400: No encontr\u00f3 datos de EstadPedidoCli
PlanningException.5401: No se encontr\u00f3 un calendario acumulado efectivo
PlanningException.5402: No se encuentran datos de EstadPedidoCli. No se procesar\u00e1 GrupoDDR.
PlanningException.5403: No se encontr\u00f3 un calendario acumulado efectivo. No se procesar\u00e1 GrupoDDR.


# Master planning validation exceptions start here....

PlanningException.5500: La Llegada Planificada no se convierte en pedido de previsi\u00f3n porque la Fecha de Caducidad de la Llegada Planificada es previa a la Fecha de Llegada Programada.
PlanningException.5501: La L\u00ednea de Carga de Veh\u00edculo no se convierte en pedido de previsi\u00f3n porque la Fecha de Caducidad de la L\u00ednea de Carga de Veh\u00edculo es previa a la Fecha de Llegada Programada.
PlanningException.5502:
PlanningException.5503:
PlanningException.5504:
PlanningException.5505:
PlanningException.5506:
PlanningException.5507: La UDA tiene un valor DurCobMP no v\u00e1lido. El valor DurCobMP es negativo o es igual a cero. El proceso considerar\u00e1 cambiar la ReglaMPS para esta UDA a 3.
PlanningException.5508: La UDA tiene una norma PPP no v\u00e1lida, se utilizar\u00e1 la norma 1
PlanningException.5509: UDA tiene un valor NormaUDAAcum inv\u00e1lida
PlanningException.5510: La UDA tiene una fecha de registro de EA no v\u00e1lida
PlanningException.5511: La UDA tiene un calendario de precio no v\u00e1lido; se han ignorado los precios.
PlanningException.5512: RendProduc tiene un calendario de rendimiento no v\u00e1lido. El rendimiento se va a considera 1 en este caso.
PlanningException.5513: El recurso en DetCargaRecImport no est\u00e1 definido como un recurso alternativo para la UDA en PasoProducAlt. Se ignorar\u00e1 el registro.
PlanningException.5514: El art\u00edculo en Est\u00e1tDemDepImport no est\u00e1 definido como alterno para la UDA en LDMAlt. Se ignorar\u00e1 el registro.
PlanningException.5515:
PlanningException.5516:
PlanningException.5517:
PlanningException.5518:
PlanningException.5519:
PlanningException.5520:
PlanningException.5521:
PlanningException.5522: La LDM tiene una fecha efectiva no v\u00e1lida, utilizando la fecha de registro de EA como fecha efectiva
PlanningException.5523: La LDM tiene una fecha de discontinuidad no v\u00e1lida, utilizando la fecha de registro de EA como fecha de discontinuidad
PlanningException.5524: La LDM tiene una cantidad de consumo no v\u00e1lida, utilizando 0
PlanningException.5525: La LDM tiene un factor de combinaci\u00f3n no v\u00e1lido, utilizando el valor 100
PlanningException.5526: La LDM tiene un factor de reducci\u00f3n no v\u00e1lido, utilizando el valor 0
PlanningException.5527: La LDM tiene un factor de rendimiento no v\u00e1lido, utilizando el valor 100
PlanningException.5528:
PlanningException.5529: La LDM tiene una UDA principal no v\u00e1lida
PlanningException.5530: La LDM tiene una UDA subordinada no v\u00e1lida
PlanningException.5531: El Cal de trabajo tiene un Calendario principal no v\u00e1lido, se va a utilizar un calendario todo-abierto predeterminado en su lugar.
PlanningException.5532: La Capacidad tiene un Calendario principal no v\u00e1lido, se va a utilizar un calendario todo-abierto predeterminado en su lugar.
PlanningException.5533: El Cal de env/lleg tiene un Calendario principal no v\u00e1lido, se va a utilizar un calendario todo-abierto predeterminado en su lugar.
PlanningException.5534:
PlanningException.5535:
PlanningException.5536:
PlanningException.5537:
PlanningException.5538:
PlanningException.5539:
PlanningException.5540:
PlanningException.5541:
PlanningException.5542:
PlanningException.5543:
PlanningException.5544:
PlanningException.5545:
PlanningException.5546:
PlanningException.5547:
PlanningException.5548:
PlanningException.5549: El m\u00e9todo de producci\u00f3n PPR tiene una fecha efectiva no v\u00e1lida, utilizando la fecha de registro de EA como fecha efectiva
PlanningException.5550: El m\u00e9todo de producci\u00f3n PPR tiene una fecha de discontinuidad no v\u00e1lida, utilizando la fecha de registro de EA como fecha de discontinuidad
PlanningException.5551: El m\u00e9todo de producci\u00f3n PPR tiene una cantidad incremental no v\u00e1lida, se utilizar\u00e1 1
PlanningException.5552: El m\u00e9todo de producci\u00f3n PPR tiene una cantidad m\u00ednima no v\u00e1lida, se utilizar\u00e1 1
PlanningException.5553: El m\u00e9todo de producci\u00f3n PPR tiene una cantidad m\u00e1xima no v\u00e1lida, se utilizar\u00e1 0
PlanningException.5554: El m\u00e9todo de producci\u00f3n PPR tiene un tiempo de espera no v\u00e1lido, se utilizar\u00e1 0
PlanningException.5555: El m\u00e9todo de producci\u00f3n PPR tiene una UDA de salida no v\u00e1lida
PlanningException.5556:
PlanningException.5557:
PlanningException.5558: El paso dependiente paralelo tiene el mismo nombre de recurso, que el paso de producci\u00f3n anterior.
PlanningException.5559: El recurso tiene un calendario de capacidad no v\u00e1lido; se ha ignorado el recurso.
PlanningException.5560: El paso de producci\u00f3n tiene un Calendario TasaProduc no v\u00e1lido; se ha ignorado el calendario.
PlanningException.5561:
PlanningException.5562: El suministro tiene una UDA de origen no v\u00e1lida
PlanningException.5563: El suministro tiene una UDA de destino no v\u00e1lida
PlanningException.5564:
PlanningException.5565: El suministro tiene un factor no v\u00e1lido
PlanningException.5566: El suministro tiene un factor de reducci\u00f3n no v\u00e1lido, se utilizar\u00e1 0
PlanningException.5567:
PlanningException.5568:
PlanningException.5569: El suministro tiene una cantidad de env\u00edo principal no v\u00e1lida, se utilizar\u00e1 1
PlanningException.5570: El suministro tiene una cantidad de env\u00edo secundaria no v\u00e1lida, se utilizar\u00e1 0
PlanningException.5571: El m\u00e9todo de producci\u00f3n tiene un calendario de TiempoEsperaEfec no v\u00e1lido; se ha ignorado el calendario
PlanningException.5572: El suministro tiene una cantidad de env\u00edo m\u00e1xima no v\u00e1lida, se utilizar\u00e1 0
PlanningException.5573: El suministro tiene un calendario de llegada no v\u00e1lido, se va a utilizar un calendario todo-abierto predeterminado en su lugar.
PlanningException.5574: La red tiene un calendario de TiempoEsperaEfec no v\u00e1lido; se ha ignorado el calendario
PlanningException.5575: La UDA tiene adjunto un calendario de inventario de proveedor no v\u00e1lido; se ha ignorado el calendario
PlanningException.5576: La Ubicaci\u00f3n tiene un Calendario de trabajo no v\u00e1lido, se va a utilizar un calendario todo-abierto predeterminado en su lugar.
PlanningException.5577: El m\u00e9todo de compra tiene adjunto un calendario de proveedor no v\u00e1lido; se ha ignorado el calendario
PlanningException.5578: El Calendario de alisado de producci\u00f3n adjunto al recurso no es v\u00e1lido. Se ignor\u00f3 el calendario.
PlanningException.5579:
PlanningException.5580: El calendario de familia de producci\u00f3n adjunto a la familia no es v\u00e1lido. El calendario se ignorar\u00e1 y la familia de producci\u00f3n no participar\u00e1 en una campa\u00f1a.
PlanningException.5581:
PlanningException.5582:
PlanningException.5583: El recurso tiene un calendario de almacenamiento no v\u00e1lido, se ha ignorado el calendario.
PlanningException.5584: La recepci\u00f3n programada tiene un m\u00e9todo de oferta no v\u00e1lido; no se utilizar\u00e1 ninguno
PlanningException.5585:
PlanningException.5586: El Calendario de mixto de productos adjunto al recurso no es v\u00e1lido. Se ignor\u00f3 el calendario.
PlanningException.5587:
PlanningException.5588:
PlanningException.5589:
PlanningException.5590:
PlanningException.5591:
PlanningException.5592:
PlanningException.5593:
PlanningException.5594:
PlanningException.5595:
PlanningException.5596:
PlanningException.5597:
PlanningException.5598:
PlanningException.5599:
PlanningException.5600: CalendarioProcesos no definido anualmente
PlanningException.5601: Existe un mapeo extra de UDA a UPD
PlanningException.5602: No hay suficientes per\u00edodos para alisado, configuraci\u00f3n predeterminada.
PlanningException.5603: Los registros de previsi\u00f3n no se pueden combinar porque CalDem son diferentes
PlanningException.5604: Longitud periodo AlcancePrevUPDaUDA no es suficiente
PlanningException.5605: CalendariosDemanda AlcancePrevUPDaUDA no coincide con calendario AlcancePrev
PlanningException.5606:
PlanningException.5607:
PlanningException.5608:
PlanningException.5609: El pedido planificado tiene un m\u00e9todo de oferta no v\u00e1lido
PlanningException.5610:
PlanningException.5611:
PlanningException.5612:
PlanningException.5613:
PlanningException.5614:
PlanningException.5615: El detalle de carga de recurso tiene una UDA no v\u00e1lida
PlanningException.5616: El detalle de carga de recurso tiene un recurso no v\u00e1lido
PlanningException.5617: El detalle de carga de recurso tiene un pedido de oferta no v\u00e1lido
PlanningException.5618:
PlanningException.5619: El detalle de carga de recurso tiene un valor de Al cargarse no v\u00e1lido, utilizando la fecha fin del pedido de oferta
PlanningException.5620: El detalle de carga de recurso tiene una cantidad de carga no v\u00e1lida
PlanningException.5621: El m\u00e9todo de compra tiene una UDA no v\u00e1lida
PlanningException.5622: El m\u00e9todo de compra tiene una cantidad de pedido m\u00ednima no v\u00e1lida, se utilizar\u00e1 1
PlanningException.5623: El m\u00e9todo de compra tiene una cantidad de pedido incremental no v\u00e1lida, se utilizar\u00e1 1
PlanningException.5624: El m\u00e9todo de compra tiene una cantidad de pedido m\u00e1xima no v\u00e1lida, se utilizar\u00e1 0
PlanningException.5625: El m\u00e9todo de compra tiene un tiempo de espera no v\u00e1lido, utilizando el valor de d\u00eda 0
PlanningException.5626: El m\u00e9todo de producci\u00f3n tiene un n\u00famero de LDM no v\u00e1lido
PlanningException.5627: El m\u00e9todo de compra tiene un factor no v\u00e1lido
PlanningException.5628: El m\u00e9todo de compra tiene un calendario de llegada no v\u00e1lido, se va a utilizar un calendario todo-abierto predeterminado en su lugar
PlanningException.5629: El suministro tiene un calendario de env\u00edo no v\u00e1lido, se va a utilizar un calendario todo-abierto predeterminado en su lugar. 
PlanningException.5630:
PlanningException.5631:
PlanningException.5632: El m\u00e9todo de producci\u00f3n tiene un calendario de finalizaci\u00f3n no v\u00e1lido, se va a utilizar un calendario todo-abierto predeterminado en su lugar
PlanningException.5633:
PlanningException.5634:
PlanningException.5635:
PlanningException.5636: El m\u00e9todo de producci\u00f3n tiene una prioridad no v\u00e1lida, se utilizar\u00e1 1
PlanningException.5637: El suministro tiene una prioridad no v\u00e1lida, utilizando el valor 1
PlanningException.5638: El m\u00e9todo de compra tiene una prioridad no v\u00e1lida, se utilizar\u00e1 1
PlanningException.5639: El recurso no es un recurso de almacenamiento
PlanningException.5640: El calendario definido para uno de los recursos no es un calendario del tipo Almacenamiento
PlanningException.5641: El recurso y la ubicaci\u00f3n en el Recurso no coinciden con el recurso y la ubicaci\u00f3n en Requisito de almacenamiento.
PlanningException.5642: M\u00faltiples recursos definidos para Art\u00edculo, Ubi en Requisito de almacenamiento. Se va a tomar en consideraci\u00f3n Art\u00edculo, Ubi y Rec mencionados en Art\u00edculo, Ubi, Rec
PlanningException.5643: Existen m\u00faltiples registros definidos para Ubi, Grupo almacenamiento en Rec. Se va a tomar en consideraci\u00f3n Rec, Ubi mencionados en Rec, Ubi
PlanningException.5644: El grupo de almacenamiento mencionado en Art\u00edculo y Rec no coincide con Art\u00edculo, Rec definidos en Requisito de almacenamiento. Se ignorar\u00e1 el recurso de almacenamiento
PlanningException.5645: El tipo de recurso (Rec:Tipo) no coincide con el del recurso de Manipulaci\u00f3n externa (ReqtSumin:N\u00famPaso es 1). Se ignorar\u00e1 el recurso ReqtSumin
PlanningException.5646: El tipo de recurso (Rec:Tipo) no coincide con el del recurso de Manipulaci\u00f3n interna (ReqtSumin:N\u00famPaso es 3). Se ignorar\u00e1 el recurso ReqtSumin
PlanningException.5647: El tipo de recurso (Rec:Tipo) no coincide con el del recurso de transporte (ReqtSumin:N\u00famPaso es 2). Se ignorar\u00e1 el recurso ReqtSumin
PlanningException.5648: El tipo de recurso (Rec:Tipo) no coincide con el del recurso de fabricaci\u00f3n adjunto al paso de producci\u00f3n. Se ignorar\u00e1 el recurso
PlanningException.5649: Los pedidos de cliente para la UDA tienen una marca de tiempo por consiguiente se ha ignorado el pedido de cliente.
PlanningException.5650:
PlanningException.5651:
PlanningException.5652:
PlanningException.5653: La llegada planificada en firme tiene un suministro no v\u00e1lido
PlanningException.5654:
PlanningException.5655:
PlanningException.5656:
PlanningException.5657:
PlanningException.5658:
PlanningException.5659:
PlanningException.5660:
PlanningException.5661:
PlanningException.5662:
PlanningException.5663:
PlanningException.5664:
PlanningException.5665:
PlanningException.5666: El m\u00e9todo de oferta tiene un factor no v\u00e1lido
PlanningException.5667:
PlanningException.5668:
PlanningException.5669:
PlanningException.5670:
PlanningException.5671:
PlanningException.5672: La l\u00ednea de carga de veh\u00edculo tiene un m\u00e9todo de oferta no v\u00e1lido
PlanningException.5673:
PlanningException.5674:
PlanningException.5675:
PlanningException.5676:
PlanningException.5677:
PlanningException.5678:
PlanningException.5679:
PlanningException.5680:
PlanningException.5681:
PlanningException.5682:
PlanningException.5683:
PlanningException.5684:
PlanningException.5685:
PlanningException.5686:
PlanningException.5687:
PlanningException.5688:
PlanningException.5689:
PlanningException.5690:
PlanningException.5691: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5692: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5693: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5694: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5695: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5696: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5697: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5698: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5699: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5700: El recurso est\u00e1 sobrecargado en la fecha de excepci\u00f3n como resultado del detalle de carga de recurso que tiene una cantidad de carga superior a la capacidad disponible
PlanningException.5701:**** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5702: El m\u00e9todo de producci\u00f3n tiene una opci\u00f3n de carga no v\u00e1lida, se utilizar\u00e1 1
PlanningException.5703: El paso de m\u00e9todo de producci\u00f3n tiene una duraci\u00f3n de carga fija no v\u00e1lida cuando el m\u00e9todo de producci\u00f3n PPR es de tipo carga fija. Este m\u00e9todo de producci\u00f3n se utilizar\u00e1 como tipo de carga variable.
PlanningException.5704: El tiempo de espera del paso del m\u00e9todo de producci\u00f3n es insuficiente para el total de pasos de duraci\u00f3n de carga fija. El tiempo de espera del m\u00e9todo de producci\u00f3n se cambiar\u00e1 al total de todos los pasos de duraci\u00f3n de carga fija.
PlanningException.5705: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5706: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.5707: El m\u00e9todo de producci\u00f3n tiene un cantidad m\u00ednima diferente de cero menor que la cantidad Inc. diferente de cero. El proceso utilizar\u00e1 la cantidad m\u00ednima lo mismo que la cantidad inc.
PlanningException.5708: El M\u00e9todoOfertaTrans tiene una cantidad de Env\u00edoMayor diferente de cero, la cual es menor que la cantidad de Env\u00edoMenor diferente de cero. El proceso utilizar\u00e1 la cantidad de Env\u00edoMayor lo mismo que la cantidad de Env\u00edoMenor.
PlanningException.5709: La duraci\u00f3n de la vida \u00fatil de las UDA perecederas se fij\u00f3 en cero en la base de datos. La duraci\u00f3n del plan en la p\u00e1gina del proceso se considerar\u00e1 como la duraci\u00f3n de la vida \u00fatil para la UDA.
PlanningException.5710: No existe el registro Par\u00e1mPerecedUDA para la UDA perecedera. El proceso considerar\u00e1 a esta UDA como no perecedera.
PlanningException.5711: La duraci\u00f3n de la vida \u00fatil m\u00ednima ser\u00e1 considerada como cero porque es mayor que la duraci\u00f3n de la vida \u00fatil.
PlanningException.5712: La duraci\u00f3n de la vida \u00fatil m\u00ednima ser\u00e1 considerada como cero porque es igual que la duraci\u00f3n de la vida \u00fatil.
PlanningException.5713: El grupo de vida \u00fatil es inv\u00e1lido.
PlanningException.5714: La UDA perecedera tiene un valor de existencias actuales diferente a cero especificado en la tabla de las UDA. Se ignorar\u00e1 el valor de existencias actuales.
PlanningException.5715: No existe el registro Par\u00e1mPerecedUDA para ninguna de las UDA de este art\u00edculo perecedero. El proceso considerar\u00e1 a este art\u00edculo como no perecedero.
PlanningException.5716: El inventario fue ignorado porque tiene una fecha de caducidad previa a la fecha de disponibilidad.
PlanningException.5717: La l\u00ednea de carga de veh\u00edculo fue ignorada porque tiene una fecha de caducidad previa a la fecha programada de llegada.
PlanningException.5718: La orden de compra fue ignorada porque tiene una fecha de caducidad previa a la fecha de vencimiento.
PlanningException.5719: La llegada planificada en firme fue ignorada porque tiene una fecha de caducidad previa a la fecha programada de llegada.
PlanningException.5720: El pedido planificado en firme fue ignorado porque tiene una fecha de caducidad previa a la fecha programada.
PlanningException.5721: La compra planificada en firme fue ignorada porque tiene una fecha de caducidad previa a la fecha programada.
PlanningException.5722: La recepci\u00f3n programada fue ignorada porque tiene una fecha de caducidad previa a la fecha programada.
PlanningException.5723: ImpResLoadDetail: al cargarse, la fecha ser\u00e1 posterior a la fecha de caducidad de la oferta.
PlanningException.5724: La oferta de la OC en firme no se ha planificado porque tiene una fecha programada posterior a la fecha de caducidad inflexible.
PlanningException.5725: La oferta de la recepci\u00f3n programada no se ha planificado porque tiene una fecha programada posterior a la fecha de caducidad inflexible.
PlanningException.5726: La oferta de la llegada planificada en firme no se ha planificado porque tiene una fecha programada posterior a la fecha de caducidad inflexible.
PlanningException.5727: La oferta de la l\u00ednea de carga de veh\u00edculo no se ha planificado porque tiene una fecha programada posterior a la fecha de caducidad inflexible.
PlanningException.5728: La fecha de inicio/requerida de la demanda dependiente importada es posterior al requisito de fecha de caducidad de la demanda dependiente.
PlanningException.5729: El art\u00edculo de una UDA CCP est\u00e1 definido como perecedero. La UDA se considera como una UDA CCP no perecedera.
PlanningException.5730: Los pasos de producci\u00f3n por etapas de este m\u00e9todo de producci\u00f3n tienen especificada una sincronizaci\u00f3n diferente para el paso siguiente. Se ha ignorado el m\u00e9todo de producci\u00f3n.
PlanningException.5731: El rendimiento de producci\u00f3n de un art\u00edculo primario tiene una cantidad de rendimiento cero en la fecha de excepci\u00f3n; por lo tanto no se crear\u00e1 oferta en los intervalos/per\u00edodos donde el rendimiento de la producci\u00f3n es cero con este m\u00e9todo de producci\u00f3n.
PlanningException.5732: El registro de reemplazo tiene una UDA principal no v\u00e1lida. Esta relaci\u00f3n de reemplazo no se reconoce.
PlanningException.5733: El registro de reemplazo tiene una UDA alterna no v\u00e1lida. Esta relaci\u00f3n de reemplazo no se reconoce.
PlanningException.5734: El registro de reemplazo tiene una fecha efectiva no v\u00e1lida. La fecha efectiva no se reconoce y se asume que la relaci\u00f3n de reemplazo se hace efectiva a partir de la hora de inicio.
PlanningException.5735: El registro de reemplazo tiene una fecha de discontinuidad no v\u00e1lida. La fecha de discontinuidad no se reconoce y se asume que la relaci\u00f3n de reemplazo no se debe descontinuar nunca.
PlanningException.5736: El registro de reemplazo tiene un art\u00edculo principal no v\u00e1lido. Esta relaci\u00f3n de reemplazo no se reconoce.
PlanningException.5737: El registro de reemplazo tiene un art\u00edculo alterno no v\u00e1lido. Esta relaci\u00f3n de reemplazo no se reconoce.
PlanningException.5740: La duraci\u00f3n de congelaci\u00f3n de la campa\u00f1a es mayor o igual que la duraci\u00f3n de la campa\u00f1a. No se ejecutan las campa\u00f1as.
PlanningException.5741: La LDM tiene una fecha de discontinuidad no v\u00e1lida, utilizando la fecha de inicio del plan como fecha de discontinuidad.
PlanningException.5742: El m\u00e9todo de producci\u00f3n PPR tiene una fecha efectiva no v\u00e1lida, utilizando la fecha de inicio del plan como fecha efectiva.
PlanningException.5743: El m\u00e9todo de producci\u00f3n PPR tiene una fecha de discontinuidad no v\u00e1lida, utilizando la fecha de inicio del plan como fecha de discontinuidad.
PlanningException.5744: La LDM tiene un calendario de rendimiento no v\u00e1lido. No se utilizar\u00e1 ninguno.
PlanningException.5745: El paso de producci\u00f3n tiene una sincronizaci\u00f3n para el paso siguiente no v\u00e1lida, en su lugar se toma en cuenta el siguiente paso como secuencial.

# Add new Master planning validation exceptions above this line.

# Master planning Business exceptions start here.. 6000 - 6500

PlanningException.6000: El recurso de fabricaci\u00f3n est\u00e1 sobrecargado como resultado de la definici\u00f3n de un valor de limitaci\u00f3n parcial

PlanningException.6001: El recurso de transporte est\u00e1 sobrecargado como resultado de la definici\u00f3n de un valor de limitaci\u00f3n parcial
PlanningException.6002: El recurso de manipulaci\u00f3n interna/externa est\u00e1 sobrecargado como resultado de la definici\u00f3n de un valor de limitaci\u00f3n parcial
PlanningException.6003: El recurso de fabricaci\u00f3n se encuentra al m\u00e1ximo de su capacidad por FechaExcepci\u00f3n o pr\u00f3ximo a ella La capacidad adicional necesaria es cantidad de carga. No se puede utilizar el recurso porque ocurrir\u00eda una sobrecarga.
PlanningException.6004: El recurso de transporte se encuentra al m\u00e1ximo de su capacidad por FechaExcepci\u00f3n o pr\u00f3ximo a ella. La capacidad adicional necesaria es cantidad de carga. No se puede utilizar el recurso porque ocurrir\u00eda una sobrecarga.
PlanningException.6005: El recurso de manipulaci\u00f3n interna/externa se encuentra al m\u00e1ximo de su capacidad por fecha de excepci\u00f3n o pr\u00f3ximo a ella. La capacidad adicional necesaria es cantidad de carga. No se puede utilizar el recurso porque ocurrir\u00eda una sobrecarga.
PlanningException.6006: No se puede satisfacer la demanda a tiempo mediante este m\u00e9todo de producci\u00f3n. El tiempo de espera del m\u00e9todo de producci\u00f3n coloca la fecha necesaria antes de la fecha de RegisEA en la UDA de oferta.
PlanningException.6007: No se puede satisfacer la demanda a tiempo mediante este m\u00e9todo de suministro. El tiempo de espera del suministro coloca la fecha necesaria antes de la fecha de RegisEA en la UDA de oferta.
PlanningException.6008: El inventario proyectado para estar disponible en el per\u00edodo de congelaci\u00f3n no es suficiente o no hay inventario disponible hasta despu\u00e9s de la fecha fin requerida del pedido de demanda.
PlanningException.6009:**** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6010:**** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6011:**** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6012: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6013: No se puede satisfacer la demanda a tiempo mediante este m\u00e9todo de compra. El tiempo de espera del m\u00e9todo de compra coloca la fecha de inicio del pedido de oferta antes de la fecha de inicio de la planificaci\u00f3n.
PlanningException.6014: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6015: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6016: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6017: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6018: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6019: No se puede satisfacer la demanda a tiempo mediante este m\u00e9todo de compra, producci\u00f3n o suministro. La demanda independiente coloca la fecha requerida antes de la fecha de inicio de planificaci\u00f3n o la fecha de RegisEA en la UDA de oferta.
PlanningException.6020: No se puede satisfacer la demanda a tiempo mediante este m\u00e9todo de producci\u00f3n. El tiempo de espera del m\u00e9todo de producci\u00f3n es menor que el tiempo m\u00ednimo de carga en el recurso de fabricaci\u00f3n.
PlanningException.6021: No se puede satisfacer la demanda a tiempo mediante este m\u00e9todo de suministro. El tiempo de espera del suministro es menor que el tiempo m\u00ednimo de carga en el recurso de transporte o de manipulaci\u00f3n.
PlanningException.6022: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6023: No se puede satisfacer la demanda a tiempo mediante este m\u00e9todo de producci\u00f3n. El tiempo de espera del m\u00e9todo de producci\u00f3n coloca la fecha necesaria antes de la fecha de inicio planificada.
PlanningException.6024: No se puede satisfacer la demanda a tiempo mediante este m\u00e9todo de suministro. El tiempo de espera del suministro coloca la fecha necesaria antes de la fecha de inicio planificada.
PlanningException.6025: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6026: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6027: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6028: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6029: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6030: No se puede satisfacer el pedido de oferta a tiempo mediante este m\u00e9todo de producci\u00f3n. El tiempo de espera del m\u00e9todo de producci\u00f3n coloca la fecha necesaria antes de la fecha de RegisEA en la UDA de oferta.
PlanningException.6031: No se puede satisfacer el pedido de oferta a tiempo mediante este m\u00e9todo de suministro. El tiempo de espera del suministro coloca la fecha necesaria antes de la fecha de RegisEA en la UDA de oferta.
PlanningException.6032: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6033: No se puede satisfacer el pedido de oferta a tiempo mediante este m\u00e9todo de compra. El tiempo de espera del m\u00e9todo de compra coloca la fecha de inicio del pedido de oferta antes de la fecha de inicio de la planificaci\u00f3n.
PlanningException.6034: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6035: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6036: No se puede satisfacer el pedido de oferta a tiempo mediante este m\u00e9todo de producci\u00f3n. El tiempo de espera del m\u00e9todo de producci\u00f3n coloca la fecha necesaria antes de la fecha de inicio planificada.
PlanningException.6037: No se puede satisfacer el pedido de oferta a tiempo mediante este m\u00e9todo de suministro. El tiempo de espera del suministro coloca la fecha necesaria antes de la fecha de inicio planificada.
PlanningException.6038: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6039: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6040: No se puede satisfacer la finalizaci\u00f3n del env\u00edo a tiempo para el pedido del cliente.  La fecha de finalizaci\u00f3n de env\u00edo es la FechaProgr.
PlanningException.6041: No se puede satisfacer la finalizaci\u00f3n del env\u00edo para el pedido del cliente. La cantidad est\u00e1 disponible en CantProgr.
PlanningException.6042: El art\u00edculo de l\u00ednea de pedido del cliente de finalizaci\u00f3n de env\u00edo se satisface parcialmente. La cantidad est\u00e1 disponible en la fecha de CantProgr.
PlanningException.6043: El encabezado de pedido del cliente de finalizaci\u00f3n de env\u00edo se satisface parcialmente. Compruebe los art\u00edculos de l\u00ednea de pedido del cliente asociados.
PlanningException.6044: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6045: No se puede cargar el pedido planificado en firme. Capacidad insuficiente en cantidad de carga. Pedido planificado en firme s\u00f3lo se satisface en cantidad revisada.
PlanningException.6046: No se puede cargar la recepci\u00f3n programada en firme. Capacidad insuficiente en cantidad de carga. Recepci\u00f3n planificada en firme s\u00f3lo se satisface en cantidad revisada.
PlanningException.6047: No se puede cargar el env\u00edo recomendado en firme. Capacidad insuficiente en cantidad de carga. El env\u00edo recomendado en firme s\u00f3lo se satisface en cantidad revisada.
PlanningException.6048: No se puede cargar la l\u00ednea de carga de veh\u00edculo en firme. Capacidad insuficiente en cantidad de carga. La l\u00ednea de carga de veh\u00edculo en firme s\u00f3lo se satisface en cantidad revisada.
PlanningException.6049: El m\u00e9todo de producci\u00f3n no se puede utilizar en la UDA porque el m\u00e9todo de producci\u00f3n no pudo crear un pedido planificado de cantidad de tama\u00f1o de lote m\u00ednimo, porque uno o varios recursos del m\u00e9todo de producci\u00f3n est\u00e1n al m\u00e1ximo de su capacidad o cerca de ella.
PlanningException.6050: El m\u00e9todo de suministro no se puede utilizar en la UDA porque el m\u00e9todo de suministro no pudo crear una llegada planificada de cantidad de tama\u00f1o de lote m\u00ednimo, porque uno o varios recursos del m\u00e9todo de suministro est\u00e1n al m\u00e1ximo de su capacidad o cerca de ella.
PlanningException.6051: El pedido de demanda est\u00e1 retrasado o sin satisfacer porque el m\u00e9todo de compra, producci\u00f3n o suministro no se puede utilizar para iniciar una nueva oferta antes de la fecha de No nueva fecha de oferta o l\u00edmite de planificaci\u00f3n.
PlanningException.6052: El pedido de oferta no se puede planificar usando el art\u00edculo mencionado en Est\u00e1tDemDepImport porque el art\u00edculo no se hace efectivo en la fecha requerida. Se ignorar\u00e1 el registro.
PlanningException.6053:
PlanningException.6054: **** Esta excepci\u00f3n est\u00e1 obsoleta *****
PlanningException.6055: El componente LDM no es suficiente para satisfacer la demanda independiente en la hora de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6056: El componente LDM no es suficiente para satisfacer la recepci\u00f3n programada en la hora de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6057: El componente LDM no es suficiente para satisfacer el pedido planificado en firme en la hora de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6058: El componente LDM no es suficiente para satisfacer la l\u00ednea de carga de veh\u00edculo en la hora de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6059: El componente LDM no es suficiente para satisfacer la llegada planificada en firme en la hora de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6060: No se puede satisfacer la demanda a tiempo utilizando el m\u00e9todo de producci\u00f3n porque el pedido planificado no se pudo programar para finalizar dentro de la duraci\u00f3n m\u00e1x. de finalizaci\u00f3n del m\u00e9todo de producci\u00f3n desde su fecha requerida.
PlanningException.6061: No se puede satisfacer la demanda a tiempo. La demanda independiente ten\u00eda una limitaci\u00f3n material porque la UDA no tiene m\u00e9todos de oferta en la fecha requerida.
PlanningException.6062: No se puede satisfacer la oferta programada a tiempo. La oferta programada ten\u00eda una limitaci\u00f3n de material porque la UDA de demanda dependiente no tiene m\u00e9todos de oferta en la fecha requerida.
PlanningException.6063: No se puede satisfacer la demanda a tiempo. La demanda independiente ten\u00eda una limitaci\u00f3n material porque la UDA no tiene m\u00e9todos de oferta efectivos en la fecha requerida.
PlanningException.6064: No se puede satisfacer la oferta programada a tiempo. La oferta programada ten\u00eda una limitaci\u00f3n de material porque la UDA de demanda dependiente no tiene m\u00e9todos de oferta efectiva en la fecha requerida.
PlanningException.6065: No se pudo satisfacer la demanda utilizando los m\u00e9todos de compra, producci\u00f3n o suministro porque la fecha de inicio programada del pedido de oferta deber\u00eda ser anterior a la fecha de inicio planificada debido a que el calendario del origen para el m\u00e9todo indicado est\u00e1 configurado como no abierto en la fecha de excepci\u00f3n o con anterioridad a ella.
PlanningException.6066: No se pudo satisfacer la demanda utilizando los m\u00e9todos de compra, producci\u00f3n o suministro porque la fecha de inicio programada del pedido de oferta deber\u00eda ser anterior a la fecha de inicio planificada debido a que el calendario de finalizaci\u00f3n para el m\u00e9todo indicado est\u00e1 configurado como no abierto en la fecha de excepci\u00f3n o con anterioridad a ella.
PlanningException.6067: El componente de suministro no es suficiente para satisfacer la demanda independiente en la hora de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6068: El componente de suministro no es suficiente para satisfacer la recepci\u00f3n programada en la hora de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6069: El componente de suministro no es suficiente para satisfacer el pedido planificado en firme en la hora de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6070: El componente de suministro no es suficiente para satisfacer la l\u00ednea de carga de veh\u00edculo en la hora de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6071: El componente de suministro no es suficiente para satisfacer la llegada planificada en firme en la hora de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6072: El pedido de demanda est\u00e1 retrasado o sin satisfacer porque el m\u00e9todo de compra, producci\u00f3n o suministro no se puede utilizar para finalizar una nueva oferta antes de la fecha de No nueva fecha de oferta o l\u00edmite de planificaci\u00f3n.
PlanningException.6073: La FechaProgr de oferta en firme es anterior a la fecha de inicio de Planificaci\u00f3n o la fecha de RegisEA.
PlanningException.6074: No se pudo satisfacer requisito de vida \u00fatil.
PlanningException.6075: No se puede cargar el pedido planificado en firme. Capacidad contigua insuficiente en cantidad de carga. No se ha cargado el pedido planificado en firme.
PlanningException.6076: No se puede cargar la recepci\u00f3n programada. Capacidad contigua insuficiente en cantidad de carga. No se ha cargado la recepci\u00f3n programada en firme.
PlanningException.6077: La duraci\u00f3n de cobertura se ha superado debido a restricciones.
PlanningException.6078: El pedido de oferta agregado ha infringido la CantM\u00e1x especificada para el m\u00e9todo de oferta en la duraci\u00f3n de cobertura.
PlanningException.6079: La primera duraci\u00f3n de cobertura infringe la norma de cobertura a fin de crear reabastecimiento para demandas antes del inicio de la primera cobertura.
PlanningException.6080: No se puede satisfacer la demanda a tiempo. La demanda independiente ten\u00eda una limitaci\u00f3n de material porque la UDA subordinada alternativa no se hace efectiva en la fecha requerida.

# Master planning Aggregate Business exceptions start here... 6300 - 6500

PlanningException.6301: El recurso de fabricaci\u00f3n se encuentra al m\u00e1ximo de su capacidad por FechaExcepci\u00f3n o pr\u00f3ximo a ella La capacidad adicional necesaria es cantidad de carga. No se puede utilizar el recurso porque ocurrir\u00eda una sobrecarga.
PlanningException.6302: El recurso de transporte se encuentra al m\u00e1ximo de su capacidad por FechaExcepci\u00f3n o pr\u00f3ximo a ella. La capacidad adicional necesaria es cantidad de carga. No se puede utilizar el recurso porque ocurrir\u00eda una sobrecarga.
PlanningException.6303: El recurso de manipulaci\u00f3n interna/externa se encuentra al m\u00e1ximo de su capacidad por fecha de excepci\u00f3n o pr\u00f3ximo a ella. La capacidad adicional necesaria es cantidad de carga. No se puede utilizar el recurso porque ocurrir\u00eda una sobrecarga.
PlanningException.6304: El componente de LDM es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6305: El componente de LDM es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6306: El componente de LDM es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6307: El componente de LDM es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6308: El componente de LDM es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad adicional necesaria es la cantidad de demanda.
PlanningException.6309: El componente de suministro es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6310: El componente de suministro es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6311: El componente de suministro es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6312: El componente de suministro es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
PlanningException.6313: El componente de suministro es insuficiente por tiempo de fecha de excepci\u00f3n. La cantidad necesaria es la cantidad de demanda.
# PlanningException.6401: Not used in 7.2.x. In 7.2.x This is replaced by exceptions 6403, 6404 and 6405
PlanningException.6402: La oferta existente en la UDA no se puede enviar en la fecha de excepci\u00f3n, probablemente a causa de una limitaci\u00f3n de capacidad.
PlanningException.6403: La oferta existente en la UDA no se puede enviar en la fecha de excepci\u00f3n. El m\u00e9todo de producci\u00f3n no es efectivo.
PlanningException.6404: La oferta existente en la UDA no se puede enviar en la fecha de excepci\u00f3n. El suministro no es efectivo.
PlanningException.6405: La oferta existente en la UDA no se puede enviar en la fecha de excepci\u00f3n. El m\u00e9todo de compra no es efectivo.
PlanningException.6406: La fecha requerida de la demanda es igual o posterior a la fecha de caducidad inflexible.
PlanningException.6407: No se puede crear una oferta para esta demanda ya que ser\u00e1 posterior a la fecha de caducidad inflexible; por lo tanto se ignorar\u00e1 la demanda.
PlanningException.6408: La oferta existente en la UDA no se puede enviar en la fecha de excepci\u00f3n. Ha habido un cambio en el rendimiento de producci\u00f3n del producto primario/coproducto o un cambio en la relaci\u00f3n entre el producto primario y el coproducto.
PlanningException.6409: La oferta se env\u00eda en la fecha de excepci\u00f3n donde la cantidad de destino del M\u00e9todo de Producci\u00f3n sea cero o negativa.
PlanningException.6410: El suministro se env\u00eda en la fecha de excepci\u00f3n donde la cantidad de destino del m\u00e9todo de suministro sea cero o negativa.
PlanningException.6411: El m\u00e9todo de producci\u00f3n tiene una cantidad de destino que es positiva y menor a la oferta necesaria en la fecha de excepci\u00f3n. La cantidad adicional requerida se puede sobrecargar en esta fecha de excepci\u00f3n.
PlanningException.6412: El m\u00e9todo de suministro tiene una cantidad de destino que es positiva y menor a  la oferta necesaria en la fecha de excepci\u00f3n. La cantidad adicional requerida se puede sobrecargar en esta fecha de excepci\u00f3n.

# Campaign Planner Exceptions start here... 6501 - 6600
PlanningException.6501: La duraci\u00f3n de producci\u00f3n m\u00ednima es 0; por lo tanto fue convertida a duraci\u00f3n del intervalo.
PlanningException.6502: La duraci\u00f3n de producci\u00f3n m\u00ednima no es un entero m\u00faltiplo de la duraci\u00f3n del intervalo; por lo tanto fue convertida a un integro m\u00faltiplo de la duraci\u00f3n del intervalo.
PlanningException.6503: La duraci\u00f3n de producci\u00f3n incremental no es un entero m\u00faltiplo de la duraci\u00f3n del intervalo; por lo tanto fue convertida a un integro m\u00faltiplo de la duraci\u00f3n del intervalo.
PlanningException.6504: La duraci\u00f3n de producci\u00f3n m\u00e1xima no es un entero m\u00faltiplo de la duraci\u00f3n del intervalo; por lo tanto fue convertida a un integro m\u00faltiplo de la duraci\u00f3n del intervalo.
PlanningException.6505: La duraci\u00f3n de producci\u00f3n m\u00e1xima no es cero y es menor que la duraci\u00f3n de producci\u00f3n m\u00ednima; por lo tanto fue convertida a la duraci\u00f3n de producci\u00f3n m\u00ednima.
PlanningException.6506: La duraci\u00f3n de producci\u00f3n m\u00e1xima no es igual a la suma de la duraci\u00f3n de producci\u00f3n m\u00ednima y del entero m\u00faltiplo de la duraci\u00f3n de producci\u00f3n incremental; por lo tanto fue convertida para respetar esto.
PlanningException.6507: La duraci\u00f3n de producci\u00f3n incremental es 0 cuando la duraci\u00f3n de producci\u00f3n m\u00e1xima no es cero, por lo tanto fue convertida a duraci\u00f3n del intervalo.
PlanningException.6508: La capacidad no utilizada est\u00e1 disponible en un intervalo luego de cargar la familia Producci\u00f3n.
PlanningException.6509: No se satisface la duraci\u00f3n de producci\u00f3n m\u00ednima debido a la inadecuada planificaci\u00f3n del pedido de familia hasta duraci\u00f3n de previsi\u00f3n.
PlanningException.6510: La carga de la familia Producci\u00f3n est\u00e1 dividida a lo largo del tiempo de inactividad.
PlanningException.6511: No se satisface la duraci\u00f3n de producci\u00f3n incremental debido a la inadecuada planificaci\u00f3n del pedido de familia hasta duraci\u00f3n de previsi\u00f3n.
PlanningException.6512: La carga de la familia Producci\u00f3n sobrepasa la duraci\u00f3n de producci\u00f3n m\u00e1xima.
PlanningException.6513: DetCargaRec:Cuando se carga, la fecha de oferta precede a la fecha de inicio del plan de campa\u00f1a.
PlanningException.6514: Recepciones programadas y / o pedidos planificados en firme est\u00e1n cargados en un intervalo.
PlanningException.6515: Recepciones programadas y / o pedidos planificados en firme correspondientes a diferentes familias est\u00e1n cargados en un mismo intervalo.
PlanningException.6516: El intervalo de recepciones programadas y / o pedidos planificados est\u00e1n asignados a cierta familia de producci\u00f3n.
PlanningException.6517: La suma de la carga de recepciones programadas y / o pedidos planificados en firme es menor que la capacidad m\u00e1xima del intervalo.
PlanningException.6518: La suma de la carga de recepciones programadas y / o pedidos planificados en firme es mayor que la capacidad m\u00e1xima del intervalo.
PlanningException.6519: Los pedidos planificados de la familia de producci\u00f3n asignada se ingresan al intervalo en el que las recepciones programadas y / o los pedidos planificados en firme se cargan debido a la capacidad disponible.
PlanningException.6520: La duraci\u00f3n de previsi\u00f3n se incumple para utilizar la capacidad restante de los intervalos SR/FPO.
PlanningException.6521: El m\u00e9todo de producci\u00f3n tiene m\u00e1s de un recurso cr\u00edtico; por lo tanto, el recurso mencionado en la columna REC se considera cr\u00edtico.
PlanningException.6522: Se ha excedido la CARGAPRODMAX al cargar el pedido planificado entero.
PlanningException.6523: La carga de la familia Producci\u00f3n sobrepasa la carga de producci\u00f3n m\u00e1xima.
PlanningException.6524: No se satisface MINPRODLOAD debido a la inadecuada planificaci\u00f3n del pedido de familia hasta duraci\u00f3n de previsi\u00f3n.
PlanningException.6525: No se satisface INCPRODLOAD debido a la inadecuada planificaci\u00f3n del pedido de familia hasta la duraci\u00f3n de previsi\u00f3n.
PlanningException.6526: MINPRODLOAD es cero; por lo tanto \u00e9sta se convierte en capacidad m\u00e1x disponible.
PlanningException.6527: Familia Producci\u00f3n: INCPRODLOAD es cero cuando MAXPRODLOAD no es cero; por lo tanto se ajusta INCPRODLOAD.
PlanningException.6528: La carga de recursos cr\u00edticos se traslada al siguiente intervalo dejando la capacidad restante en el intervalo actual debido a la restricci\u00f3n paralela de recursos dependientes en este intervalo.
PlanningException.6529: Optimizar la transformaci\u00f3n de producci\u00f3n no ha considerado a ninguno de los recursos para la optimizaci\u00f3n debido a que Rec:OpcTraFmliaProduc est\u00e1 fijada en SIN TRANSFORMACI\u00d3N DE FAMILIA DE PRODUCCI\u00d3N.
PlanningException.6530: La carga de producci\u00f3n m\u00e1xima es diferente a cero y menor que la carga de producci\u00f3n m\u00ednima; por lo tanto se ajusta la carga de producci\u00f3n m\u00ednima.
PlanningException.6531: La p\u00e9rdida de las transformaciones es mayor que la familia Producci\u00f3n: MINPRODLOAD; por lo tanto se considera que dicha p\u00e9rdida es cero.
PlanningException.6532: No hay especificada una familia de producci\u00f3n v\u00e1lida para el recurso cr\u00edtico; por lo tanto se ignorar\u00e1 el recurso.
PlanningException.6533: El m\u00e9todo de producci\u00f3n no tiene los pasos de producci\u00f3n con las familias de producci\u00f3n v\u00e1lidas, por lo tanto NO se hace la optimizaci\u00f3n;

# Add new Master planning Business exceptions above this line.

# ESP Exceptions start here... 6700 - 6999
PlanningException.6701: Material
PlanningException.6702: Tiempo de espera de producci\u00f3n
PlanningException.6703: Tiempo de espera de compra
PlanningException.6704: Tiempo de espera de suministro
PlanningException.6705: Efectividad LDM
PlanningException.6706: Efectividad de suministro
PlanningException.6801: Capacidad

# Add new ESP Business exceptions above this line.

# New Master planning exceptions for Plan order Edit functionality of MP Work Bench 7000-
PlanningException.7000: La acci\u00f3n Agregar pedido de plan se ha cancelado debido a una infracci\u00f3n de limitaci\u00f3n de recurso inflexible en Recursos rec para cant Cantcarga
PlanningException.7001: La acci\u00f3n Agregar carga de UDA se ha cancelado debido a una infracci\u00f3n de limitaci\u00f3n de recurso inflexible en Recursos rec para cant Cantcarga
PlanningException.7002: La acci\u00f3n Editar pedido de plan se ha cancelado debido a una infracci\u00f3n de limitaci\u00f3n de recurso inflexible en Recursos rec para cant Cantcarga
PlanningException.7003: La acci\u00f3n Editar carga de UDA se ha cancelado debido a una infracci\u00f3n de limitaci\u00f3n de recurso inflexible en Recursos rec para cant Cantcarga
PlanningException.7004: Acci\u00f3n firme cancelada debido a una infracci\u00f3n de limitaci\u00f3n de recurso inflexible en Recursos rec para cant Cantcarga
PlanningException.7005: La fecha de la acci\u00f3n se encuentra fuera del horizonte de plan definido en las propiedades de planificaci\u00f3n.
PlanningException.7006: No existe un m\u00e9todo de producci\u00f3n efectivo para la UDA.
PlanningException.7007: La acci\u00f3n Agregar carga de UDA se ha cancelado debido a que Cntcarga es mayor que la capacidad del Recurso.
PlanningException.7008: La acci\u00f3n Editar carga de UDA se ha cancelado debido a que Cantcarga es mayor que la capacidad de Recurso.
PlanningException.7009: La acci\u00f3n Agregar pedido de plan se ha cancelado debido a la falta de capacidad contigua en Recursos rec para Cant Cantcarga
PlanningException.7010: La acci\u00f3n Editar pedido de plan se ha cancelado debido a la falta de capacidad contigua en Recursos rec para Cant Cantcarga

# Master planning Warning exceptions for Planorder Edit functionality of MPWork Bench 7500-
PlanningException.7500:Si se tienen en cuenta las cargas de pedidos planificados, se supera la capacidad de los recursos. Se ha infringido una limitaci\u00f3n inflexible en el recurso
PlanningException.7501:Si se tienen en cuenta las cargas de pedidos planificados, se supera la capacidad de los recursos. Se ha infringido una limitaci\u00f3n flexible en el recurso
PlanningException.7502: La capacidad en el recurso rec se ha superado debido una acci\u00f3n FIRME. Se ha infringido una limitaci\u00f3n flexible en el recurso
PlanningException.7503:No hay oferta para que el art\u00edculo de LDM satisfaga la demanda dependiente del nuevo pedido del plan agregado/editado  


#ATP Hierarchichal allocation planning Exceptions 
PlanningException.8000: UDA tiene una jerarqu\u00eda no v\u00e1lida.



# Supply Data validation Exceptions ... 9000 - 9300

PlanningException.9000: N\u00famero de LDM no igual a uno o cantidad de consumo de LDM es <= 0
PlanningException.9001: La compensaci\u00f3n negativa de la pieza secundaria es mayor que el tiempo de espera de las piezas principales 
PlanningException.9002: Par\u00e1mOfertaUDA:IntCodEfec = 1 y EfectividadTipo no tienen definiciones efectivas 
PlanningException.9003: Par\u00e1mOfertaUDA:CantM\u00e1x <  Par\u00e1mOfertaUDA:CantM\u00fal <= 0
PlanningException.9004: SSP:OrdPol = 6 y LTrim(SSP:ABC) es nulo 
PlanningException.9005: CantM\u00edn > CantM\u00e1x o CantM\u00fal > CantM\u00e1x o (CantM\u00e1x > CantM\u00fal y CantM\u00fal >0 y CantM\u00e1x no es m\u00faltiplo de CantM\u00fal)
PlanningException.9006: Falta de coincidencia de la efectividad definida en LDM, suministro y tipo de efectividad 
PlanningException.9007: Parte de transferencia sin un registro de suministro  
PlanningException.9008: Efectividad superpuesta 
PlanningException.9009: Entrada de suministro no v\u00e1lida
PlanningException.9010: Inventario no producible
PlanningException.9011: Parte ISO no v\u00e1lida
PlanningException.9012: Ingreso de uso extra negativo
PlanningException.9013: Ingreso de pedido del cliente negativo
PlanningException.9014: Cantidad de consumo en pedido de trabajo negativa
PlanningException.9015: Pedido de trabajo no v\u00e1lido
PlanningException.9016: UDA sin m\u00e9todo de producci\u00f3n
PlanningException.9017: Registros de Par\u00e1mOfertaUDA no coincidentes
PlanningException.9018: Norma de sustituci\u00f3n no v\u00e1lida
PlanningException.9019: Tiempo de espera de compra y tiempo de espera de producci\u00f3n no son m\u00faltiplos de 1440
PlanningException.9020: El tiempo de espera de oferta de suministro no es m\u00faltiplo de 1440
PlanningException.9021: No existe el registro de LDM para un componente ensamblado
PlanningException.9022: Se ha definido un UDA de capital ficticio como art\u00edculo sustituido en la tabla de norma de sustituci\u00f3n
PlanningException.9023: Cantidad de pedido del cliente negativa
PlanningException.9024: En Par\u00e1mUDAOferta todos los tiempos de espera deben ser menores que 2147483647
PlanningException.9025: PasoProduc:TasaProduc es menor que 1
PlanningException.9026: Rec:ComprCapM\u00e1x no puede tener un valor de 2. Se considerar\u00e1 como sin limitaci\u00f3n (1).
PlanningException.9027: Ya existe demanda de stock de seguridad por etapas para una pseudo UDA
PlanningException.9028: Ya existe demanda de pedido del cliente para una pseudo UDA
PlanningException.9029: Ya existe demanda de uso extra para una pseudo UDA



# IPO Data validation and business model Exceptions ... 10001-10046

PlanningException.10001: La LDM tiene una cantidad descontada no v\u00e1lida.
PlanningException.10002: Este suministro causa m\u00faltiples suministros para UDAIPO
PlanningException.10003: UDA tiene una tasa de supervivencia no v\u00e1lida
PlanningException.10004: UDA est\u00e1 conectada a otra UDA con nombres de grupo diferentes por LDM o relaci\u00f3n de suministro
PlanningException.10005: La UDA correspondiente a la parte del sistema operativo tiene una cantidad por ensamblaje de cero
PlanningException.10006: La UDA correspondiente a la parte del sistema operativo tiene un tiempo medio entre fallos de cero
PlanningException.10007: UDA principal no se ha cargado
PlanningException.10008: La UDA subordinada no se ha cargado
PlanningException.10009: Valor cero para cantidad econ\u00f3mica de pedido (CEE)
PlanningException.10010: Valor cero para demanda diaria media
PlanningException.10011: Duraci\u00f3n de cobertura futura como cero
PlanningException.10012: Valor cero para cantidad por ensamblaje
PlanningException.10013: Valor cero para OpsSystem:Uso
PlanningException.10014: Valor cero para OpsSystem:IntervalUso
PlanningException.10015: Valor cero para OpsSystem:N\u00fameroEnUso
PlanningException.10016: El suministro no coincide
PlanningException.10017: La UDA est\u00e1 conectada a los sistemas operativos con varios nombres de grupo
PlanningException.10018: La UDA no est\u00e1 conectada a ning\u00fan grupo de destino en el \u00e1rbol conectado
PlanningException.10019: Se encontraron errores de validaci\u00f3n en el modelo.
PlanningException.10020: La UDA se ignora porque el nivel de planif. es -1
PlanningException.10021: Nivel de stock inicial no v\u00e1lido para UDA. El nivel de stock debe ser mayor o igual que la cantidad de repetici\u00f3n de pedido. El nivel de stock se ha ajustado seg\u00fan la cantidad de repetici\u00f3n de pedido para la evaluaci\u00f3n del rendimiento.
PlanningException.10022: Nivel de stock inicial no v\u00e1lido para UDA. Como la varianza de la variable de problema de adquisici\u00f3n (VPA) es cero, el nivel de stock debe ser mayor que la VPA media para evitar pedidos no satisfechos infinitos. El nivel de stock se ha ajustado seg\u00fan la VPA media para la evaluaci\u00f3n del rendimiento.
PlanningException.10023: UDA con InterrCompra = 0 y ning\u00fan suministro no puede tener un \u00edndice de supervivencia menor que 100
PlanningException.10024: UDA con InterrCompra = 0 y ning\u00fan suministro no puede tener un \u00edndice de devoluci\u00f3n de recambio menor que 100
PlanningException.10025: La UDA tiene un tiempo de espera de compra no v\u00e1lido. No puede ser negativo.
PlanningException.10026: La UDA tiene un tiempo de espera de reparaci\u00f3n no v\u00e1lido. No puede ser negativo.
PlanningException.10027: El tiempo medio entre fallos de la parte del sistema operativo no puede ser menor que su tiempo de reemplazo y eliminaci\u00f3n medio
PlanningException.10028: Entrada de INTCompra no v\u00e1lida. Si la UDA se suministra, no se puede adquirir.
PlanningException.10029: No hay ning\u00fan m\u00e9todo de reabastecimiento definido para esta UDA. Se crea un m\u00e9todo de compra coste cero, tiempo de espera cero
PlanningException.10030: El uso del sistema operativo no puede ser mayor que el per\u00edodo de uso. Se ha utilizado un valor modificado y el procesamiento continuar\u00e1 sin ese valor.
PlanningException.10031: En el porcentaje de tiempo de actividad, el tiempo medio de reemplazo y eliminaci\u00f3n de las piezas del sistema operativo no puede ser mayor que el tiempo de trabajo disponible total. Se ha utilizado un valor modificado y el procesamiento continuar\u00e1 sin ese valor.
PlanningException.10032: El tiempo medio de reemplazo y eliminaci\u00f3n del sistema operativo correspondiente a la parte no puede ser mayor que el tiempo de trabajo disponible total. Se ha utilizado un valor modificado y el procesamiento continuar\u00e1 sin ese valor.
PlanningException.10033: En la tasa de error de la parte promedio, la tasa de error medio del sistema no debe ser mayor que el n\u00famero en uso.
PlanningException.10034: La UDA tiene una desviaci\u00f3n est\u00e1ndar de tiempo de espera de compra no v\u00e1lido. No puede ser mayor que cero si el tiempo de espera de compra es cero.
PlanningException.10035: La UDA tiene una desviaci\u00f3n est\u00e1ndar de tiempo de espera de reparaci\u00f3n no v\u00e1lido. No puede ser mayor que cero si el tiempo de espera de reparaci\u00f3n es cero.
PlanningException.10036: Esta UDA tiene una desviaci\u00f3n est\u00e1ndar de tiempo de espera trans inv\u00e1lida. No puede ser mayor que cero si el tiempo de espera trans es cero.
PlanningException.10037: Esta UDA tiene una cantidad de orden menor que 1, por eso se ha fijado en 1.
PlanningException.10038: UDA con InterrCompra = 1 tiene fracci\u00f3n de compra=0 a partir de que la suma del suministro y las fracciones de reparaci\u00f3n es mayor que 1.
PlanningException.10039: Este UDA tiene un stock de seguridad negativo, por eso la cantidad se publica como cero.
PlanningException.10040: El tiempo de espera acumulativo de la red es mayor que la duraci\u00f3n del intervalo del plan.
PlanningException.10041: UDA no tiene LDM. No se puede reparar.
PlanningException.10042: Se actualiz\u00f3 la limitaci\u00f3n del m\u00e1ximo de stock de seguridad para ajustarlo al objetivo m\u00ednimo de stock.
PlanningException.10043: El valor de clasificaci\u00f3n es mayor o igual que el valor de clasificaci\u00f3n del N\u00ba de secuencia anterior.
PlanningException.10044: El valor total de las UDA para el par\u00e1metro seleccionado es CERO.
PlanningException.10045: La definici\u00f3n de clasificaci\u00f3n seleccionada no existe
PlanningException.10046: Los detalles de la definici\u00f3n de clasificaci\u00f3n no existen para la definici\u00f3n seleccionada
PlanningException.10047: Se encontraron errores de validaci\u00f3n en el modelo. Revise las tablas requeridas tal como ExcepUDA para encontrar las UDA v\u00e1lidas.
PlanningException.10048: Se encontraron errores de validaci\u00f3n en el modelo. Compruebe los niveles de plan de las UDA.
PlanningException.10049: La Cantidad de repetici\u00f3n de pedido se fij\u00f3 en uno debido a que la Demanda diaria media es cero.
PlanningException.10050: UDA tiene un Incremento Nivel Stock de 0, por lo tanto se ha fijado en 1.
PlanningException.10051: El valor CV de UDA es mayor que el valor CVM\u00e1x. Ajustando CV a  CVM\u00e1x para la UDA.
PlanningException.10052: Aumentando el stock de seguridad al m\u00ednimo requerido.
PlanningException.10053: El nivel de stock ha sido actualizado para respetar el objetivo m\u00ednimo de stock.
PlanningException.10054: Stock de seguridad base es mayor que el l\u00edmite m\u00e1ximo de stock de seguridad, se est\u00e1 restableciendo el stock de seguridad m\u00e1ximo al valor base.
PlanningException.10055: Se espera recibir la cantidad faltante para la fecha de registro de llegada 
PlanningException.10056: Se espera recibir la cantidad faltante para la fecha de registro de pedido 
PlanningException.10057: Se ha ignorado la cantidad de llegada excedente
PlanningException.10058: Se ha ignorado la cantidad de pedido excedente
PlanningException.10059: Faltan datos en HistTransPlan 
PlanningException.10060: Faltan datos en HistPurchPlan
PlanningException.10061: Faltan datos en HistTransActual
PlanningException.10062: Faltan datos en HistPurchActual
PlanningException.10063: Faltan datos en HistTransPlan y HistTransActual
PlanningException.10064: Faltan datos en HistPurchPlan y HistPurchActual
PlanningException.10065: Hay muy pocas observaciones planificadas para calcular el tiempo de espera de transporte y la desviaci\u00f3n est\u00e1ndar del tiempo de espera de transporte
PlanningException.10066: Hay muy pocas observaciones planificadas para calcular el tiempo de espera de compra y la desviaci\u00f3n est\u00e1ndar del tiempo de espera de compra
PlanningException.10067: Hay muy pocas observaciones reales para calcular el tiempo de espera de transporte y la desviaci\u00f3n est\u00e1ndar del tiempo de espera de transporte
PlanningException.10068: Hay muy pocas observaciones reales para calcular el tiempo de espera de compra y la desviaci\u00f3n est\u00e1ndar del tiempo de espera de compra
PlanningException.10069: Se encontraron errores de validaci\u00f3n en el modelo. Revise la tabla ExcepUDA.
PlanningException.10070: LDM tiene una cantidad descontada en la etapa de consumo CERO.
PlanningException.10071: Se ha encontrado un registro duplicado en la tabla de LDM para la misma combinaci\u00f3n de ARTICULO, UBI, BOMNUM, SUBORD.
PlanningException.10073: Se han encornados registros ineficaces en la tabla de LDM para la misma combinaci\u00f3n de ARTICULO, UBI, BOMNUM, SUBORD.
PlanningException.10074: La LDM tiene 100 por ciento de reducci\u00f3n, ignorar el factor de reducci\u00f3n.
PlanningException.10075: La LDM tiene 0 porcentaje de rendimiento, ignorar el factor de rendimiento.
PlanningException.10076: El tiempo de espera de compra es negativo, por lo tanto se fija junto con su SD en cero.
PlanningException.10077: El tiempo de espera de transporte es negativo, por lo tanto se fija junto con su SD en cero.


# Sequencing/MasterPlanning Integration Data validation and business model Exceptions ... 11000-11100

PlanningException.11000: El modelo de Sequencing para la UDA es desconocido
PlanningException.11001: Multiplicar modelo de Sequencing definido para la UDA
PlanningException.11002: La UDA de SCPO no est\u00e1 activa para Integraci\u00f3n

