# Main resource bundle for BusinessObject exceptions, status messages, and log messages
0000= Exce\u00e7\u00e3o de sistema desconhecida - {0}.


Calendar.NotFound=O calend\u00e1rio solicitado '{0}' n\u00e3o existe.
QueryTool.Exception=A QueryTool gerou uma exce\u00e7\u00e3o ao aplicar a sele\u00e7\u00e3o de dados com a mensagem '{0}'
Database.Exception=Erro de banco de dados encontrado: {0}
Search.DfuSearchLimit.NotProvided=Limite de pesquisa n\u00e3o \u00e9 fornecido.
BusinessObjectContext.UnknownType=Tipo de contexto desconhecido fornecido no BusinessObjectContext.

DDEImpact.LoadFailed=Ocorreu um erro ao tentar carregar DDEImpact TVQ's: {0}
DDE.SearchFailed=Ocorreu um erro ao recuperar o DDE: {0}
DDE.Searchfailed=Ocorreu um erro ao recuperar o DDE: {0}
DDE.WrongNumberOfPeriods=Tentativa de criar um evento orientado por dados com um n\u00famero inv\u00e1lido de per\u00edodos: {0}.  O valor deve estar entre 1 e 6, inclusive.


TimePhasedFittedHist.LoadFailed=Ocorreu um erro ao tentar carregar dados de hist\u00f3rico ajustado divididos em fases: {0}
TimePhasedForecast.LoadFailed=Ocorreu um erro durante leitura de dados de previs\u00e3o divididos em fases: {0}
TimePhasedHist.LoadFailed=Ocorreu um erro ao tentar carregar os dados de hist\u00f3rico divididos em fases: {0}

CalcModel.RunFailed=A invoca\u00e7\u00e3o de CalcModel n\u00e3o foi bem-sucedida para DFUModel {0}.  Verifique o DFUExceptions para obter detalhes.
Workbench.CalcModelProcError=N\u00e3o \u00e9 poss\u00edvel executar o modelo de c\u00e1lculo. \u00c9 poss\u00edvel que o pool de n\u00f3s apropriado n\u00e3o esteja em execu\u00e7\u00e3o.

AlgOptions.MissingLewandowskiPeriodicity=As entradas est\u00e3o ausentes da tabela LewandowskiGlobal ou OPSMatrix quanto \u00e0 periodicidade {0}.  Devem existir entradas para uma periodicidade 0 (padr\u00e3o) ou para todas as periodicidades 4, 9, 12, 13, 18, 19, 20, 24, 26, 36, 48, 52.

GenericLoader.InvalidAttributeType=Foi feita uma tentativa de carregar o atributo {0} que tem um atributo n\u00e3o suportado do tipo {1}.
GenericLoader.InvalidAttributeTable=Foi feita uma tentativa de carregar o atributo {0}, que est\u00e1 definido na tabela {1}.  Todos os atributos em BusinessObject {2} devem ser definidos na tabela {3}.
GenericLoader.MultipleRecordsForKey=V\u00e1rios registros encontrados para a chave: {0}.

DemandPostDate.InvalidCalendar=O calend\u00e1rio de demandas especificado ({0}) n\u00e3o cont\u00e9m a data de hoje.

Action.EffDiscDateError=A data selecionada est\u00e1 fora do intervalo de datas de vig\u00eancia/descontinua\u00e7\u00e3o.
Action.MVMAlreadyExists=A modifica\u00e7\u00e3o de valor m\u00e9dio j\u00e1 existe para a data.
Action.FcstHorizonError=A data selecionada est\u00e1 fora do horizonte de previs\u00e3o ou o intervalo de per\u00edodos est\u00e1 fora do horizonte de previs\u00e3o.

TargetFinder.UUIDLookupFailure=O objeto de neg\u00f3cios a ser anexado n\u00e3o \u00e9 DFUModel.
CausalFactorFinder.UUIDLookupFailure=O objeto de neg\u00f3cios a ser anexado n\u00e3o \u00e9 DFUModel.
MaskFinder.UUIDLookupFailure=O objeto de neg\u00f3cios a ser anexado n\u00e3o \u00e9 DFUModel.

Action.NoMaskAttached=Nenhuma m\u00e1scara est\u00e1 conectada ao DFU.
Action.Mask.NotFound=A m\u00e1scara {0} n\u00e3o est\u00e1 presente.
Action.Mask.MaskExist=M\u00e1scara com o nome {0} j\u00e1 existe.

Action.Target.TargetExist=Destino com o nome {0} j\u00e1 existe.
Action.Target.EndsBeforeDmdPost=A data de t\u00e9rmino de destino \u00e9 anterior \u00e0 data de publica\u00e7\u00e3o da demanda.
Action.Target.EndsBeforeStartdate=A data de t\u00e9rmino de destino \u00e9 anterior \u00e0 data de in\u00edcio de destino.
Action.Target.EndsAfterFcstHorizon=A data de t\u00e9rmino de destino \u00e9 posterior ao horizonte de previs\u00e3o.
Action.Target.StartsBeforeHistStart=O destino inicia-se antes da data de in\u00edcio do hist\u00f3rico.
Action.Target.NonEffectiveDate=O destino propaga-se para al\u00e9m do intervalo de data de vig\u00eancia/descontinua\u00e7\u00e3o.
Action.Target.OverlappingTarget=Outro destino anexado em um intervalo determinado de datas.
Action.Target.StartsAfterFcstHorizon=A data de in\u00edcio de destino \u00e9 posterior ao horizonte de previs\u00e3o.

Action.Target.TargetDoesNotExist=O destino com o nome {0} n\u00e3o existe.

Action.Override.HistoryNotFound=O hist\u00f3rico n\u00e3o est\u00e1 presente.

Action.InValidDate=A data de in\u00edcio {0} \u00e9 anterior \u00e0 data de in\u00edcio do hist\u00f3rico.


Action.Lifecycle.LifecycleOnlyLEW=Um ciclo de vida s\u00f3 pode ser aplicado a um modelo LEWANDOWSKI.
Action.Lifecycle.LifecycleDoesNotExist=Ciclo de vida n\u00e3o existe:  [{0}].
Action.Lifecycle.CalendarNotEqual=O calend\u00e1rio de DFU [{0}] n\u00e3o \u00e9 igual ao calend\u00e1rio de ciclo de vida [{1}].

Action.ExternalFactor.ExternalFactorOnlyLEW=Um fator externo s\u00f3 pode ser aplicado a um modelo LEWANDOWSKI.
Action.ExternalFactor.ExternalFactorDoesNotExist=Fator externo n\u00e3o existe:  [{0}].
Action.ExternalFactor.CalendarNotEqual=O calend\u00e1rio de DFU [{0}] n\u00e3o \u00e9 igual ao calend\u00e1rio de fator externo [{1}].

# Composite operator exceptions
Forecast.InvalidTotalFcstTVQ=O total de previs\u00e3o n\u00e3o pode ser calculado porque o operador recebeu um n\u00famero incorreto de atributos divididos em fases.
Forecast.InvalidTotalFcstEditTVQ=O total de previs\u00e3o n\u00e3o pode ser modificada porque o operador recebeu um n\u00famero incorreto de atributos divididos em fases.
Operator.InvalidType=N\u00e3o \u00e9 poss\u00edvel calcular o valor composto do composto dividido em fases, porque um dos componentes retornou um tipo n\u00e3o esperado.
Operator.InvalidTVQCount=N\u00e3o \u00e9 poss\u00edvel calcular o valor composto do composto dividido em fases, porque o operador recebeu o n\u00famero incorreto de componentes.


# Collector exceptions, put here, rather than APM since we guess this might end up being used in other SCPO code
Collector.AttrStore.CannotAggregate=N\u00e3o \u00e9 poss\u00edvel executar a agrega\u00e7\u00e3o para {0} usando a classe de agregador {1}.

