# Main resource bundle for BusinessObject exceptions, status messages, and log messages
0000= Excepci\u00f3n de sistema desconocida - {0}.


Calendar.NotFound=El calendario solicitado '{0}' no existe.
QueryTool.Exception=La HerramientaConsulta plante\u00f3 una excepci\u00f3n al aplicar la selecci\u00f3n de datos con el mensaje '{0}'
Database.Exception=Se ha producido un error de la base de datos: {0}
Search.DfuSearchLimit.NotProvided=No se proporciona el l\u00edmite de b\u00fasqueda.
BusinessObjectContext.UnknownType=Proporcionado un tipo de contexto desconocido en BusinessObjectContext.

DDEImpact.LoadFailed=Error al intentar cargar ImpactoECD de TVQ: {0}
DDE.SearchFailed=Error al recuperar ECD: {0}
DDE.Searchfailed=Error al recuperar ECD: {0}
DDE.WrongNumberOfPeriods=Se intenta crear un evento controlado por datos con un n\u00famero de periodos no v\u00e1lidos: {0}.  El valor debe estar entre 1 y 6, inclusive.


TimePhasedFittedHist.LoadFailed=Error al intentar cargar los datos de la historia estimada por etapas: {0}
TimePhasedForecast.LoadFailed=Error al leer los datos de la previsi\u00f3n por etapas: {0}
TimePhasedHist.LoadFailed=Error al intentar cargar los datos de la historia por etapas: {0}

CalcModel.RunFailed=La invocaci\u00f3n de ModeloCalc no tuvo \u00e9xito para el ModeloUPD {0}.  Compruebe los detalles en las ExcepcionesUPD.
Workbench.CalcModelProcError=No se pudo ejecutar el modelo de c\u00e1lculo. Es posible que el grupo de nodos no se est\u00e1 ejecutando.

AlgOptions.MissingLewandowskiPeriodicity=Faltan entradas en la tabla LewandowskiGlobal o OPSMatrix para la periodicidad {0}.  Debe haber entradas para la periodicidad 0 (predeterminado) o para todas las periodicidades 4,9,12,13,18,19,20,24,26,36,48,52.

GenericLoader.InvalidAttributeType=Se intent\u00f3 cargar el atributo {0} el cual tiene un tipo de atributo no compatible de {1}.
GenericLoader.InvalidAttributeTable=Se intent\u00f3 cargar el atributo {0}, el cual est\u00e1 definido en la tabla {1}.  Todos los atributos en el BusinessObject {2} deben definirse en la tabla {3}.
GenericLoader.MultipleRecordsForKey=Se encontraron varios registros de la clave: {0}.

DemandPostDate.InvalidCalendar=El calendario de demanda especificado ({0}) no tiene la fecha de hoy.

Action.EffDiscDateError=La fecha seleccionada no est\u00e1 en el rango de fecha efectiva o de discontinuidad.
Action.MVMAlreadyExists=La modificaci\u00f3n del valor medio ya existe para la fecha.
Action.FcstHorizonError=La fecha seleccionada no est\u00e1 en el rango de fechas de periodos o de horizonte de previsi\u00f3n, quedando as\u00ed fuera del horizonte de previsi\u00f3n.

TargetFinder.UUIDLookupFailure=El Business Object que se adjuntar\u00e1 no es el ModeloUPD.
CausalFactorFinder.UUIDLookupFailure=El Business Object que se adjuntar\u00e1 no es el ModeloUPD.
MaskFinder.UUIDLookupFailure=El Business Object que se adjuntar\u00e1 no es el ModeloUPD.

Action.NoMaskAttached=No hay exclusi\u00f3n adjunta al UPD.
Action.Mask.NotFound=La exclusi\u00f3n {0} no est\u00e1 presente.
Action.Mask.MaskExist=La exclusi\u00f3n {0} existe.

Action.Target.TargetExist=El destino {0} existe.
Action.Target.EndsBeforeDmdPost=La fecha final de destino es anterior a la fecha de registro de demanda.
Action.Target.EndsBeforeStartdate=La fecha final de destino es anterior a la fecha de inicio de destino.
Action.Target.EndsAfterFcstHorizon=La fecha final de destino es posterior al horizonte de previsi\u00f3n.
Action.Target.StartsBeforeHistStart=El origen empieza antes de la fecha de inicio de la historia.
Action.Target.NonEffectiveDate=El origen abarca una fecha que est\u00e1 fuera del rango de fecha efectiva o de discontinuidad.
Action.Target.OverlappingTarget=Otro destino adjunto en el rango de fechas dado.
Action.Target.StartsAfterFcstHorizon=La fecha de inicio de destino es posterior al horizonte de previsi\u00f3n.

Action.Target.TargetDoesNotExist=El destino con nombre {0} no existe.

Action.Override.HistoryNotFound=La historia no est\u00e1 presente.

Action.InValidDate=Fecha de inicio {0} es previa a la fecha de inicio de la Historia.


Action.Lifecycle.LifecycleOnlyLEW=Un ciclo de vida s\u00f3lo se puede aplicar a un modelo LEWANDOWSKI.
Action.Lifecycle.LifecycleDoesNotExist=El ciclo de vida no existe:  [{0}].
Action.Lifecycle.CalendarNotEqual=El calendario UPD [{0}] no iguala el calendario del ciclo de vida [{1}].

Action.ExternalFactor.ExternalFactorOnlyLEW=Un factor externo s\u00f3lo se puede aplicar a un modelo LEWANDOWSKI.
Action.ExternalFactor.ExternalFactorDoesNotExist=El factor externo no existe:  [{0}].
Action.ExternalFactor.CalendarNotEqual=El calendario UPD [{0}] no iguala el calendario del factor externo [{1}].

# Composite operator exceptions
Forecast.InvalidTotalFcstTVQ=No se puede calcular la previsi\u00f3n total porque el operador recibi\u00f3 un n\u00famero incorrecto de atributos por etapas.
Forecast.InvalidTotalFcstEditTVQ=No se puede modificar la previsi\u00f3n total porque el operador recibi\u00f3 un n\u00famero incorrecto de atributos por etapas.
Operator.InvalidType=No se pudo calcular el valor compuesto por etapas porque uno de los componentes devolvi\u00f3 un tipo inesperado.
Operator.InvalidTVQCount=No se pudo calcular el valor compuesto por etapas porque el operador recibi\u00f3 el n\u00famero de componentes incorrecto.


# Collector exceptions, put here, rather than APM since we guess this might end up being used in other SCPO code
Collector.AttrStore.CannotAggregate=No se pudo efectuar la agregaci\u00f3n para {0} usando la clase de agregador {1}.

