# Main resource bundle for BusinessObject exceptions, status messages, and log messages
0000= Exception syst\u00e8me inconnue - {0}.


Calendar.NotFound=Le calendrier requis  '{0}' n'existe pas.
QueryTool.Exception=OutilRecherche a provoqu\u00e9 une exception en appliquant la s\u00e9lection de donn\u00e9es avec message '{0}'
Database.Exception=Erreur de base de donn\u00e9es : {0}
Search.DfuSearchLimit.NotProvided=Limite de recherche non fournie.
BusinessObjectContext.UnknownType=Type de contexte inconnu fourni dans BusinessObjectContext.

DDEImpact.LoadFailed=Une erreur s'est produite en tentant de charger DDEImpact TVQ : {0}
DDE.SearchFailed=Une erreur s''est produite lors de l''extraction de DDE : {0}
DDE.Searchfailed=Une erreur s''est produite lors de l''extraction de DDE : {0}
DDE.WrongNumberOfPeriods=Essai de cr\u00e9ation d''un Ev\u00e9nement guid\u00e9 par les donn\u00e9es avec un nombre de p\u00e9riodes invalide : {0}.  La valeur doit se situer entre 1 et 6.


TimePhasedFittedHist.LoadFailed=Une erreur s''est produite en essayant de charger des donn\u00e9es Historique li\u00e9 \u00e0 des phases de temps : {0}
TimePhasedForecast.LoadFailed=Une erreur s''est produite en lisant les donn\u00e9es Pr\u00e9visions programm\u00e9es dans le temps : {0}
TimePhasedHist.LoadFailed=Une erreur s''est produite en essayant de charger les donn\u00e9es Hist programm\u00e9 dans le temps : {0}

CalcModel.RunFailed=L''invocation de CalcMod\u00e8le a \u00e9chou\u00e9 pour le Mod\u00e8leUDP {0}.  Veuillez v\u00e9rifier les ExceptionsUDP pour plus de d\u00e9tails.
Workbench.CalcModelProcError=Impossible d'ex\u00e9cuter le Mod\u00e8leCalc. Il est possible que le pool de noeud ne soit pas activ\u00e9.

AlgOptions.MissingLewandowskiPeriodicity=Saisies manquantes depuis la table LewandowskiGlobal ou OPSMatrix pour p\u00e9riodicit\u00e9 {0}.  Les entr\u00e9es doivent exister pour soit la p\u00e9riodicit\u00e9 0 (d\u00e9faut) ou pour toutes les p\u00e9riodicit\u00e9s 4,9,12,13,18,19,20,24,26,36,48,52.

GenericLoader.InvalidAttributeType=Essai de chargement de l''attribut {0} qui a un type d''attribut incompatible de {1}.
GenericLoader.InvalidAttributeTable=Essai de chargement de l''attribut {0}, qui est d\u00e9fini sur la table {1}. Tous les attributs de BusinessObject {2} doivent \u00eatre d\u00e9finis dans la table {3}.
GenericLoader.MultipleRecordsForKey=Enregistrements multiples trouv\u00e9s pour la cl\u00e9 : {0}.

DemandPostDate.InvalidCalendar=Calendrier demande sp\u00e9cifi\u00e9 ({0}) ne comprend pas la date d''aujourd''hui.

Action.EffDiscDateError=Date s\u00e9lectionn\u00e9e se situe en dehors de la plage de date en vigueur/ expiration.
Action.MVMAlreadyExists=Modification de valeur moyenne existe d\u00e9j\u00e0 pour la date.
Action.FcstHorizonError=La date s\u00e9lectionn\u00e9e se situe en dehors de l'horizon de pr\u00e9vision ou les p\u00e9riodes se situent en dehors de l'horizon de pr\u00e9vision.

TargetFinder.UUIDLookupFailure=Business Object \u00e0 relier n'est pas un mod\u00e8leUDP.
CausalFactorFinder.UUIDLookupFailure=Business Object \u00e0 relier n'est pas un mod\u00e8leUDP.
MaskFinder.UUIDLookupFailure=Business Object \u00e0 relier n'est pas un mod\u00e8leUDP.

Action.NoMaskAttached=Pas de masque reli\u00e9 \u00e0 l'UDP.
Action.Mask.NotFound=Masque {0} n''est pas pr\u00e9sent.
Action.Mask.MaskExist=Masque appel\u00e9 {0} existe.

Action.Target.TargetExist=Cible appel\u00e9e {0} existe.
Action.Target.EndsBeforeDmdPost=Date de fin cible se situe avant date de demande.
Action.Target.EndsBeforeStartdate=Date de fin de cible se situe avant la date de d\u00e9but cible.
Action.Target.EndsAfterFcstHorizon=Date de fin cible se situe apr\u00e8s l'horizon pr\u00e9vision.
Action.Target.StartsBeforeHistStart=Cible commence avant la date de d\u00e9but d'historique.
Action.Target.NonEffectiveDate=Cible situ\u00e9e en dehors de la port\u00e9e de date en effet/annul\u00e9e.
Action.Target.OverlappingTarget=Une autre cible attach\u00e9e dans la port\u00e9e de date donn\u00e9e.
Action.Target.StartsAfterFcstHorizon=Date de d\u00e9but cible se situe apr\u00e8s l'horizon pr\u00e9vision.

Action.Target.TargetDoesNotExist=Cible appel\u00e9e {0} n''existe pas.

Action.Override.HistoryNotFound=Historique manquant.

Action.InValidDate={0} date de d\u00e9but est ant\u00e9rieure \u00e0 date de d\u00e9but d''Historique.


Action.Lifecycle.LifecycleOnlyLEW=Un cycle de vie peut seulement \u00eatre appliqu\u00e9 \u00e0 un mod\u00e8le LEWANDOWSKI.
Action.Lifecycle.LifecycleDoesNotExist=Le cycle de vie n''existe pas : [{0}].
Action.Lifecycle.CalendarNotEqual=Calendrier UDP [{0}] n''est pas identique au calendrier cycle de vie [{1}].

Action.ExternalFactor.ExternalFactorOnlyLEW=Un facteur externe peut seulement \u00eatre appliqu\u00e9 \u00e0 un mod\u00e8le LEWANDOWSKIl.
Action.ExternalFactor.ExternalFactorDoesNotExist=Le facteur externe n''existe pas :  [{0}].
Action.ExternalFactor.CalendarNotEqual=Calendrier UDP [{0}] n''est pas \u00e9gal au calendrier facteur externe [{1}].

# Composite operator exceptions
Forecast.InvalidTotalFcstTVQ=La pr\u00e9vision totale ne peut pas \u00eatre calcul\u00e9e parce que l'op\u00e9rateur a re\u00e7u un nombre incorrect d'attributs programm\u00e9s dans le temps.
Forecast.InvalidTotalFcstEditTVQ=La pr\u00e9vision totale ne peut pas \u00eatre modifi\u00e9e parce que l'op\u00e9rateur a re\u00e7u un nombre incorrect d'attributs.
Operator.InvalidType=Impossible de calculer une valeur compos\u00e9e pour un valeur compos\u00e9e de temps parce qu'un des composants est d'un type inattendu.
Operator.InvalidTVQCount=Impossible de calculer une valeur compos\u00e9e pour un valeur compos\u00e9e de temps parce qu'un op\u00e9rateur a re\u00e7u un nombre de composants incorrect.


# Collector exceptions, put here, rather than APM since we guess this might end up being used in other SCPO code
Collector.AttrStore.CannotAggregate=Impossible d''effectuer l''agr\u00e9gation pour {0} en utilisant la classe d''agr\u00e9gation {1}.

