# Main resource bundle for Security Service exceptions, status messages,
# and log messages
#
# Error Messages
SS0000= Unbekannte Systemausnahme - {0}.
SS0001= Berechtigungen f\u00fcr Ressource {0} nicht ausrechend. Angeforderter Vorgang ben\u00f6tigt folgende Berechtigung: {1}.
SS0002= Der Benutzer verf\u00fcgt \u00fcber die Berechtigung {0} f\u00fcr Ressource {1}, jedoch nicht f\u00fcr das Unternehmen {2}.
SS0003= Der Benutzer {0} ist nicht vorhanden.
SS0004= Das Objekt {0} ist nicht vorhanden.
SS0005= Keine ausreichenden Berechtigungen f\u00fcr diesen Vorgang vorhanden. Diese Methode kann nur intern ausgef\u00fchrt werden.
SS0006= Das Passwort f\u00fcr den Benutzer {0} ist seit dem  {1} ung\u00fcltig.
SS0007= Das Konto f\u00fcr den Benutzer {0} wurde vor\u00fcbergehend gesperrt.
SS0008= Das neue Passwort stimmt nicht mit dem best\u00e4tigten Passwort \u00fcberein.
SS0009= Das neue Passwort entspricht nicht den Passwortbeschr\u00e4nkungen.
SS0010= Der Benutzer {0} hat die maximale Anzahl der Fehlanmeldungen erreicht : {1}.
SS0011= Der Benutzer hat die Berechtigung {0} f\u00fcr die Ressource {1}, jedoch nicht f\u00fcr den Benutzer {2}.
SS0012= Ung\u00fcltiges Passwort. Es entspricht nicht dem f\u00fcr diesen Benutzer gespeicherten Passwort.
SS0013= Der Bereich {0} ist ung\u00fcltig f\u00fcr Ressource {1}.
SS0014= Verletzung der eindeutigen Datenbankbegrenzung. Das Objekt {0} ist bereits vorhanden.
SS0015= Verletzung der Datenbankintegrit\u00e4tsbegrenzung. Das Objekt {0} verf\u00fcgt \u00fcber Unterobjekte.
SS0016= Dieser Filter verf\u00fcgt \u00fcber die maximal zul\u00e4ssige Anzahl an Gleichungsverweisen: {0}.
SS0017= Das Passwort kann nicht festgelegt werden, wenn es LDAP aktiviert ist.
SS0018= Das Passwort kann nicht ge\u00e4ndert werden, wenn es LDAP aktiviert ist.
SS0019= Der Benutzer {0} ist nicht im LDAP-Verzeichnis {1} aufgef\u00fchrt.
SS0020= Die LDAP-Exception {0} ist bei der Suche nach Benutzer {1} im Verzeichnis {2} aufgetreten.
SS0021= Die URL-Adresse {0} kann nicht mit dem LDAP-Server verbunden werden. Exception-Meldung {1}.
SS0022= Die LDAP-Exception {0} ist bei der \u00dcberpr\u00fcfung von Benutzer {1} im Verzeichnis {2} aufgetreten.
SS0023= LDAP-Attribute betragen Null f\u00fcr Benutzer {0} im Verzeichnis {1}.
SS0024= F\u00fcr diese Anwendung werden Sitzungs-Cookies ben\u00f6tigt.  Sie m\u00fcssen diese in Ihrem Browser aktivieren.
SS0025= Die Filtergleichung enth\u00e4lt nicht alle n\u00f6tigen Verweise auf bestehende Kriterien.
SS0026= Die Filtergleichung enth\u00e4lt ung\u00fcltige Zeichen.
SS0027= Es werden ein g\u00fcltiger Benutzername und Passwort ben\u00f6tigt.
SS0028= Das neue Passwort muss mit dem erneut best\u00e4tigten neuen Passwort \u00fcbereinstimmen.
SS0029= Benutzername oder Passwort sind ung\u00fcltig. Beachten Sie die Gro\u00df- und Kleinschreibung.
SS0030= Ihr Passwort ist abgelaufen. Bitte \u00e4ndern Sie es.
SS0031= Die zul\u00e4ssige Anzahl von Anmeldungsversuchen wurde \u00fcberschritten.
SS0032= Ihre Sitzung ist abgelaufen. Bitte melden Sie sich erneut an.
SS0033= Sie m\u00fcssen angemeldet sein, um auf diese Anwendung zugreifen zu k\u00f6nnen.
SS0034= Sie haben keinen Zugriff auf diese Anwendung.
SS0035= Ihr Konto wurde vor\u00fcbergehend gesperrt. Wenden Sie sich bitte an Ihren Systemadministrator.
SS0036= Sie k\u00f6nnen den reservierten Benutzer {0} nicht erstellen.
SS0037= Keine ausreichenden Berechtigungen f\u00fcr Ressource {0} vorhanden. Es werden entweder die Bereichsgenehmigung = ALLE oder eine entsprechende Rollenkennung zur Aktualisierung dieser Ressource ben\u00f6tigt.
SS0038= Fehlende ZSL f\u00fcr Ressource {0}.  Angeforderter Vorgang ben\u00f6tigt eine ZSL mit folgender Berechtigung: {1}.
SS0039= Fehlende ZSL f\u00fcr die Datenbanktabelle {0}. Angeforderter Vorgang ben\u00f6tigt eine ZSL mit folgender Berechtigung: {1}.
SS0040= Keine ausreichenden Berechtigungen f\u00fcr die Datenbanktabelle {0}. Angeforderter Vorgang ben\u00f6tigt folgende Berechtigung: {1}.
SS0041= Keine ausreichenden Berechtigungen f\u00fcr die Datenbankspalte {0}. Angeforderter Vorgang ben\u00f6tigt folgende Berechtigung: {1}.
SS0042= Fehlende ZSL f\u00fcr die Gesch\u00e4ftseinheit {0}. Angeforderter Vorgang ben\u00f6tigt eine ZSL mit folgender Berechtigung: {1}.
SS0043= Fehlende Berechtigungen f\u00fcr die Gesch\u00e4ftseinheit {0}. Angeforderter Vorgang ben\u00f6tigt folgende Berechtigung: {1}.
SS0044= Rollen ({0}) k\u00f6nnen dem Benutzer {1} nicht zugewiesen werden. Rollen k\u00f6nnen einem Benutzer nur zugewiesen werden, wenn dieser vom Unternehmen {2} die Berechtigung zu Anzeige dieser Rollen hat.
SS0045= CSM_ACCESS_CONTROL f\u00fcr die angeforderte Ressource verf\u00fcgt \u00fcber einen ung\u00fcltigen BEREICH. Der BEREICH {0} ist f\u00fcr die Ressource {1} nicht zul\u00e4ssig.
SS0046= Das neue Passwort muss sich von den alten Passw\u00f6rtern unterscheiden.
SS0047= Benutzer {0} hat den zul\u00e4ssigen maximalen Zeitraum f\u00fcr den ersten Anmeldeversuch, {1} Tag(e), \u00fcberschritten.
SS0048= Das Passwort muss mindestens {0} Zeichen enthalten.
SS0049= Das Passwort muss alphanummerisch sein.
SS0050= Das Passwort muss Gro\u00df- und Kleinbuchstaben enthalten.
SS0051= Erste Anmeldezeitfrist \u00fcberschritten.
SS0052= Der Benutzer kann sich nicht selbst l\u00f6schen.
SS0053= Der Benutzer kann nicht sein eigenes Unternehmen l\u00f6schen.
SS0054= Das Objekt existiert nicht.
SS0055= Eindeutige Begrenzungsverletzung der Datenbank. Das Objekt existiert bereits.
SS0056= Integrit\u00e4ts-Begrenzungsverletzung der Datenbank. Das Objekt weist untergeordnete Elemente auf.
SS0057= Integrit\u00e4ts-Begrenzungsverletzung der Datenbank. Das \u00fcbergeordnete Objekt {0} existiert nicht.
SS0058= Integrit\u00e4ts-Begrenzungsverletzung der Datenbank. Das \u00fcbergeordnete Objekt existiert nicht.
SS0059= Datenbank-Exception - {0}.
SS0060= Keine ausreichende Berechtigung zum \u00c4ndern des Passworts.
SS0061= Gel\u00f6schter Benutzername {0} kann nicht wieder verwendet werden.
SS0062= Unzureichende Berechtigungen f\u00fcr Ressource {0}. Nur Benutzer vom Hostunternehmen d\u00fcrfen diese Aktion ausf\u00fchren.
SS0063= Unzureichende Berechtigungen f\u00fcr Ressource {0}. Nur Benutzer vom Hostunternehmen oder von einem teilnehmenden Partnerunternehmen d\u00fcrfen diese Aktion ausf\u00fchren.
SS0064= Anmeldung ist nicht m\u00f6glich, da f\u00fcr Sie keine Rollen definiert wurden.  Wenden Sie sich an Ihren Systemadministrator.
SS0065= Sie k\u00f6nnen das Passwort eines gemeinsam genutzten Kontos nicht \u00e4ndern. Wenden Sie sich an den Systemadministrator, wenn Ihr Passwort nicht mehr g\u00fcltig ist.
SS0066= Rolle {0} ist die einzige verbleibende Rolle f\u00fcr diesen Benutzer und kann von diesem Benutzer nicht gel\u00f6scht werden.
SS0067= Parsen der SQL-Anweisung nicht m\u00f6glich. In der Online-Hilfe erhalten Sie Informationen dar\u00fcber, wie Sie SQL-Anweisungen mit Funktionsausdr\u00fccken formulieren.
SS0068= Der Benutzer hat die zul\u00e4ssige Zeitdauer f\u00fcr den ersten Anmeldeversuch \u00fcberschritten.
SS0069= Konto deaktiviert f\u00fcr Benutzer:
SS0070= Name des Datenbankobjekts ist ung\u00fcltig.
SS0071= Name des Datenbankobjekts {0} ist ung\u00fcltig.
SS0072= Passwort enth\u00e4lt nicht die erforderliche Mindestanzahl von Zeichen.
SS0073= F\u00fcr das Passwort erforderliche Zeichen m\u00fcssen angegeben werden, wenn die erforderliche Mindestanzahl von Zeichen f\u00fcr das Passwort gr\u00f6\u00dfer als 0 ist.
SS0074= Root-Unternehmens-ID muss mit der Host-Unternehmens-ID \u00fcbereinstimmen.
SS0075= Root-Unternehmens-ID konnte nicht validiert werden. Anmeldeinformationen f\u00fcr Benutzer 'CSM_System_User' nicht korrekt.
SS0076= Ung\u00fcltige Softwarelizenz: {0}.
SS0077= System kann nicht gel\u00f6scht werden.
SS0078= Authentifizierungsdaten konnten nicht abgerufen werden.
# Status Messages
SS2000=

# Log Messages
SS3000=

#
# Gensys Referential Validation Rules. Oracle Error Codes 20499 through 20555 are reserved for these
#
20499=Der angegebene Kalender ist kein Bedarfskalender.
20500=Periodengewichtungsfaktoren sind nur in Bedarfskalendern zul\u00e4ssig.

#
# Batch Process Authentication Messages
#

SS4000=Eigenschaftendatei f\u00fcr Anmeldeinformationen nicht angegeben.
SS4001=Eigenschaftendatei f\u00fcr Anmeldeinformationen [{0}] nicht gefunden.
SS4002=Eigenschaftendatei f\u00fcr Anmeldeinformationen enth\u00e4lt einen Benutzernamen. Kann nicht \u00fcber die Befehlszeile au\u00dfer Kraft gesetzt werden.
SS4003=Verschl\u00fcsselungsdienst fehlgeschlagen.
SS4004=Benutzername ist nicht vorhanden oder leer in Eigenschaftendatei.
SS4005=Passwort ist nicht vorhanden oder leer in Eigenschaftendatei.
SS4006=Benutzername und Benutzer k\u00f6nnen nicht angegeben werden.

#
# Password encryption program (GenerateEncryptedPassword) resource strings
#

SS4014=Zu verschl\u00fcsselndes Passwort eingeben:
SS4015=Passwort zur Best\u00e4tigung erneut eingeben:
SS4016=Fehler: Die eingegebenen Passw\u00f6rter stimmen nicht \u00fcberein.
SS4017=Fehler: Verschl\u00fcsselungsdienst fehlgeschlagen:
SS4018=Fehler: EA-Exception liest von Systemkonsole.
SS4019=Benutzer-ID eingeben:
SS4020=Fehler beim Schreiben in Eigenschaftendatei.
SS4021=Befehlszeilen-Syntaxfehler. Syntax: generische Anmeldeinformationen <Anmeldeinformationen_Dateiname>

#
# Change DB Password Utility resource strings
#
SS5001=Passwort eingeben:
SS5002=Passwort best\u00e4tigen:
SS5003=\n\n**Fehler**. Beim \u00c4ndern des Passworts ist ein Fehler aufgetreten.
SS5004=\n\n**Erfolg**. Passwort wurde erfolgreich ge\u00e4ndert f\u00fcr {0}.
SS5005= changeDBCredentials -password schemaName
SS5006=<Admin-Benutzer> <Admin-Passwort> 
SS5007=Fehler beim Ausf\u00fchren des Befehls.
SS5008=Fehler beim Schreiben der Protokolle
SS5009=Fehler beim Lesen der Datei.
SS5010=Fehler beim Speichern der Eigenschaftendatei.
SS5011=Fehler: Passwort darf nicht leer sein.
SS5013=Fehler. Schemaname {0} ist nicht vorhanden.
SS5014=Codierungsfehler. Ung\u00fcltiges Zeichen in Zeile {0} und Spalte {1} in Xserver.xml gefunden.
SS5015=\n\n**Fehler**. Beim \u00c4ndern des Schemanamens ist ein Fehler aufgetreten.
SS5016=\n\n**Erfolg**. Schemaname und Kennwort erfolgreich ge\u00e4ndert f\u00fcr {0}.
SS5017= changeDBCredentials -schema oldSchemaName newSchemaName

#
# Cross-Site (XSS) Request Forgery resource strings
#
SS5012=[RF-Fehler]: Ung\u00fcltige Anorderung gefunden. Wenden Sie sich an den Systemadministrator

#
# Generation of Encrypted Product ID
#
SS6001=Zu verschl\u00fcsselnde Produkt-ID eingeben:
SS6002=Verschl\u00fcsselte Produkt-ID:
SS6003=Fehler bei Produkt-ID-Verschl\u00fcsselung
