# Main resource bundle for Security Service exceptions, status messages,
# and log messages
#
# Error Messages
SS0000= Excepci\u00f3n de sistema desconocida - {0}.
SS0001= No tiene suficientes permisos para el recurso {0}. La operaci\u00f3n solicitada necesita permisos para {1}.
SS0002= El usuario tiene permisos para {0} para el recurso {1}, pero no para esta empresa {2}.
SS0003= El usuario {0}, no existe.
SS0004= El objeto {0}, no existe.
SS0005= No tiene suficientes permisos para la operaci\u00f3n. Este m\u00e9todo s\u00f3lo puede solicitarse internamente.
SS0006= La contrase\u00f1a del usuario {0}, venci\u00f3 el {1}.
SS0007= La cuenta del usuario {0}, se ha suspendido.
SS0008= La nueva contrase\u00f1a no coincide con la confirmaci\u00f3n de contrase\u00f1a.
SS0009= La nueva contrase\u00f1a no cumple las restricciones de las contrase\u00f1as.
SS0010= El usuario {0}, ha sobrepasado el n\u00famero m\u00e1ximo de intentos de conexi\u00f3n fallidos permitidos: {1}.
SS0011= El usuario tiene {0} permisos para el recurso {1}, pero no para el usuario {2}.
SS0012= La contrase\u00f1a no es v\u00e1lida. No coincide con la contrase\u00f1a almacenada para este usuario.
SS0013= El alcance {0}, no es v\u00e1lido para el recurso {1}.
SS0014= Infracci\u00f3n de limitaci\u00f3n exclusiva de la base de datos. El objeto {0}, ya existe.
SS0015= Infracci\u00f3n de limitaci\u00f3n de la integridad en la base de datos. El objeto {0}, tiene subsidiarios.
SS0016= Este filtro contiene el n\u00famero m\u00e1ximo de referencias de ecuaci\u00f3n, {0}.
SS0017= No se permite la operaci\u00f3n setPassword cuando LDAP est\u00e1 activado.
SS0018= No se permite la operaci\u00f3n changePassword cuando LDAP est\u00e1 activado.
SS0019= El usuario {0}, no existe en el directorio LDAP {1}.
SS0020= Ha ocurrido la excepci\u00f3n LDAP{0}, mientras se buscaba el usuario {1}, en el directorio {2}.
SS0021= No es posible conectarse al servidor LDAP para la URL {0}, mensaje de excepci\u00f3n, {1}.
SS0022= Ha ocurrido la excepci\u00f3n LDAP {0}, mientras se validaba al usuario {1}, en el directorio {2}.
SS0023= Atributos LDAP nulos para el usuario {0}, en el directorio {1}.
SS0024= Debe activar la funci\u00f3n de aceptaci\u00f3n de cookies para esta aplicaci\u00f3n. Active la aceptaci\u00f3n de cookies en su navegador.
SS0025= Faltan referencias en la ecuaci\u00f3n del filtro para los criterios existentes.
SS0026= La ecuaci\u00f3n del filtro contiene caracteres no v\u00e1lidos.
SS0027= Se necesita un nombre de usuario y una contrase\u00f1a v\u00e1lidos.
SS0028= La nueva contrase\u00f1a y la confirmaci\u00f3n de contrase\u00f1a deben ser la misma.
SS0029= El nombre de usuario o la contrase\u00f1a no son v\u00e1lidos. El inicio de sesi\u00f3n distingue entre may\u00fasculas y min\u00fasculas.
SS0030= La contrase\u00f1a ha vencido. Cambie la contrase\u00f1a.
SS0031= Ha excedido el m\u00e1ximo de intentos de inicio de sesi\u00f3n.
SS0032= La sesi\u00f3n ha vencido. Vuelva a registrarse.
SS0033= Debe registrarse para acceder a esta aplicaci\u00f3n.
SS0034= No tiene acceso a esta aplicaci\u00f3n.
SS0035= La cuenta ha sido suspendida. P\u00f3ngase en contacto con el administrador del sistema.
SS0036= No puede crear el usuario reservado {0}.
SS0037= No tiene suficientes permisos para el recurso {0}. El alcance de su permiso debe ser = TODO o una Ide. de funci\u00f3n adecuada para actualizar este recurso.
SS0038= Faltan ACL para el recurso {0}. La operaci\u00f3n solicitada necesita una ACL con permisos para {1}.
SS0039= Faltan ACL para la tabla de la base de datos {0}. La operaci\u00f3n solicitada necesita una ACL con {1} permisos.
SS0040= No tiene suficientes permisos para la tabla de la base de datos {0}. La operaci\u00f3n solicitada necesita {1} permisos.
SS0041= No tiene suficientes permisos para la columna de la base de datos {0}. La operaci\u00f3n solicitada necesita permisos para {1}.
SS0042= Faltan ACL para la entidad de negocios {0}. La operaci\u00f3n solicitada necesita una ACL con permisos para {1}.
SS0043= No tiene suficientes permisos para la entidad de negocios {0}. La operaci\u00f3n solicitada necesita permisos para {1}.
SS0044= No se pueden asignar funciones ({0}) al usuario, {1}. Las funciones s\u00f3lo se pueden asignar a un usuario si \u00e9ste tiene permisos para ver estas funciones de la empresa {2}.
SS0045= El CSM_ACCESS_CONTROl para el recurso solicitado tiene un ALCANCE no v\u00e1lido. El ALCANCE {0}, para el recurso {1}, no est\u00e1 permitido.
SS0046= La nueva contrase\u00f1a no puede ser igual a las anteriores.
SS0047= El usuario {0}, ha sobrepasado el per\u00edodo de tiempo m\u00e1ximo permitido para el primer intento de inicio de sesi\u00f3n: {1} d\u00eda/s.
SS0048= La longitud m\u00ednima de la contrase\u00f1a debe ser de {0} caracteres.
SS0049= La contrase\u00f1a debe ser alfanum\u00e9rica.
SS0050= La contrase\u00f1a debe combinar may\u00fasculas y min\u00fasculas.
SS0051= Ha excedido el lapso de tiempo permitido para el inicio de la sesi\u00f3n.
SS0052= El usuario no puede suprimirse a s\u00ed mismo.
SS0053= El usuario no puede suprimir su propia empresa.
SS0054= El objeto no existe.
SS0055= Infracci\u00f3n de limitaci\u00f3n exclusiva de la base de datos. El objeto ya existe.
SS0056= Infracci\u00f3n de limitaci\u00f3n de la integridad en la base de datos. El objeto tiene subsidiarios.
SS0057= Infracci\u00f3n de limitaci\u00f3n de la integridad en la base de datos. El objeto principal {0}, no existe.
SS0058= Infracci\u00f3n de limitaci\u00f3n de la integridad en la base de datos. El objeto principal no existe.
SS0059= Excepci\u00f3n de la base de datos - {0}.
SS0060= No tiene permiso para cambiar la contrase\u00f1a.
SS0061= No se puede volver a utilizar el nombre de un usuario suprimido: {0}.
SS0062= No tiene suficientes permisos para el recurso {0}. S\u00f3lo los usuarios de la empresa principal tienen permiso para realizar esta acci\u00f3n.
SS0063= Permisos insuficientes para el recurso, {0}. S\u00f3lo los usuarios de la empresa principal o de una de las empresas asociadas participantes tienen permiso para realizar esta acci\u00f3n.
SS0064= No le est\u00e1 permitido iniciar una sesi\u00f3n porque su usuario no tiene asignada ninguna funci\u00f3n. P\u00f3ngase en contacto con el administrador del sistema.
SS0065= No es posible cambiar la contrase\u00f1a de una cuenta compartida. Si su contrase\u00f1a ha vencido, p\u00f3ngase en contacto con el administrador del sistema.
SS0066= {0} es la \u00fanica funci\u00f3n restante de este usuario y no se puede suprimir.
SS0067= No se puede analizar la declaraci\u00f3n SQL. Si desea obtener informaci\u00f3n sobre c\u00f3mo formar declaraciones SQL con expresiones de funci\u00f3n, consulte la ayuda en l\u00ednea.
SS0068= El usuario ha sobrepasado el per\u00edodo de tiempo m\u00e1ximo permitido para el primer intento de inicio de sesi\u00f3n.
SS0069= Se ha suspendido la cuenta de usuario:
SS0070= El nombre del objeto de base de datos no es v\u00e1lido.
SS0071= El nombre del objeto de base de datos {0} no es v\u00e1lido.
SS0072= La contrase\u00f1a no incluye el n\u00famero m\u00ednimo de caracteres obligatorios.
SS0073= Se deben especificar los caracteres requeridos cuando los caracteres de contrase\u00f1a m\u00ednimos requeridos sean mayores que 0.
SS0074= La Ide. de empresa ra\u00edz debe ser la misma que la Ide. de empresa matriz.
SS0075= No se pudo validar la Ide. de la empresa ra\u00edz. La informaci\u00f3n de inicio de sesi\u00f3n del usuario CSM_System_User no es correcta.
SS0076= Informaci\u00f3n de licencia inv\u00e1lida: {0}.
SS0077= No se puede borrar el sistema.
SS0078= No se pudo recuperar la informaci\u00f3n de autenticaci\u00f3n.
# Status Messages
SS2000=

# Log Messages
SS3000=

#
# Gensys Referential Validation Rules. Oracle Error Codes 20499 through 20555 are reserved for these
#
20499=El calendario especificado no es un calendario de Demand.
20500=Los factores de valoraci\u00f3n de periodo s\u00f3lo son v\u00e1lidos para calendarios de Demand.

#
# Batch Process Authentication Messages
#

SS4000=No se ha especificado ning\u00fan archivo de propiedad de credenciales.
SS4001=No se ha encontrado el archivo de propiedades de credenciales [{0}].
SS4002=El archivo de propiedad de credenciales incluye un nombre de usuario. No es posible sobrescribirlo en la l\u00ednea de comandos.
SS4003=El servicio de cifrado ha fallado.
SS4004=El nombre de usuario no existe o est\u00e1 vac\u00edo en el archivo de credenciales.
SS4005=La contrase\u00f1a no existe o est\u00e1 vac\u00eda en el archivo de credenciales.
SS4006=No se pueden especificar a la vez usuario y nombre de usuario.

#
# Password encryption program (GenerateEncryptedPassword) resource strings
#

SS4014=Introduzca la contrase\u00f1a que se cifrar\u00e1:
SS4015=Vuelva a introducir la contrase\u00f1a para confirmarla:
SS4016=Error: las contrase\u00f1as introducidas no coinciden.
SS4017=Error: el servicio de cifrado ha fallado:
SS4018=Error: una excepci\u00f3n de E/S est\u00e1 leyendo de la consola del sistema.
SS4019=Introducir Ide. de usuario:
SS4020=Error al escribir al archivo de credenciales.
SS4021=Error de sintaxis en la l\u00ednea de comandos. Sintaxis: generarCredenciales <nombrearchivo_credenciales>

#
# Change DB Password Utility resource strings
#
SS5001=Introduzca la contrase\u00f1a:
SS5002=Confirmar contrase\u00f1a:
SS5003=\n\n**Error**. No se pudo cambiar la contrase\u00f1a.
SS5004=\n\n**\u00c9xito **. La contrase\u00f1a se ha cambiado correctamente para {0}.
SS5005= changeDBCredentials -password schemaName
SS5006=<usuario_admin> <contrase\u00f1a_admin> 
SS5007=Error al ejecutar el comando.
SS5008=Error en la escritura de registros
SS5009=Error al leer el archivo.
SS5010=Error al guardar el archivo de propiedades.
SS5011=Error. La contrase\u00f1a no puede estar en blanco.
SS5013=Error. Nombre del esquema {0} no existe.
SS5014=Error de cifrado. Se encontr\u00f3 un car\u00e1cter no v\u00e1lido en la l\u00ednea {0} de la columna {1} en Xserver.xml.
SS5015=\n\n**Error**. No se pudo cambiar el nombre del esquema.
SS5016=\n\n**\u00c9xito**. El nombre del esquema y la contrase\u00f1a se han cambiado correctamente para {0}.
SS5017= changeDBCredentials -schema oldSchemaName newSchemaName

#
# Cross-Site (XSS) Request Forgery resource strings
#
SS5012=[RF-Error]: Se encontr\u00f3 una solicitud no v\u00e1lida. P\u00f3ngase en contacto con el administrador del sistema para obtener m\u00e1s detalles

#
# Generation of Encrypted Product ID
#
SS6001=Introduzca el ID del producto para cifrar:
SS6002=Ide. de producto cifrado:
SS6003=Error durante el cifrado de ide. de producto
