# Main resource bundle for Security Service exceptions, status messages,
# and log messages
#
# Error Messages
SS0000= Exception syst\u00e8me inconnue - {0}.
SS0001= Autorisations insuffisantes pour la ressource,{0}. L''op\u00e9ration requise n\u00e9cessite l''autorisation {1}.
SS0002= L''utilisateur poss\u00e8de la permission, {0}  pour la ressource {1},  mais ne la poss\u00e8de pas pour cette entreprise, {2}.
SS0003= Utilisateur, {0}, n''existe pas.
SS0004= Objet, {0}, n''existe pas.
SS0005= Autorisations insuffisantes pour l'op\u00e9ration. Vous pouvez uniquement faire appel \u00e0 cette m\u00e9thode en interne.
SS0006= Le mot de passe de l''utilisateur,{0}, a expir\u00e9 le {1}.
SS0007= Le compte de l''utilisateur, {0}, a \u00e9t\u00e9 suspendu.
SS0008= Le nouveau mot de passe ne correspond pas au mot de passe confirm\u00e9.
SS0009= Le nouveau mot de passe n'est pas conforme aux contraintes \u00e9tablies.
SS0010= Utilisateur, {0}, a d\u00e9pass\u00e9 le nombre maximum de tentatives de connexion \u00e9chou\u00e9es, {1}.
SS0011= L''utilisateur a la permission {0} pour la ressource, {1}, mais ne la poss\u00e8de pas pour cet utilisateur, {2}.
SS0012= Mot de passe incorrect. Il ne correspond pas au mot de passe stock\u00e9 pour cet utilisateur.
SS0013= La port\u00e9e, {0}, est incorrecte pour cette ressource, {1}.
SS0014= Violation de la contrainte d'unicit\u00e9 de la base de donn\u00e9es. L'objet, {0},  existe d\u00e9j\u00e0.
SS0015= Violation de la contrainte d'int\u00e9grit\u00e9 de la base de donn\u00e9es. L'objet, {0}, a des enregistrements secondaires.
SS0016= Ce filtre contient le nombre maximum de r\u00e9f\u00e9rences d''\u00e9quation, {0}.
SS0017= L'op\u00e9ration de d\u00e9finition du mot de passe n'est pas autoris\u00e9e lorsque LDAP est activ\u00e9.
SS0018= L'op\u00e9ration de modification du mot de passse n'est pas autoris\u00e9e lorsque LDAP est activ\u00e9.
SS0019= Utilisateur, {0}, n''existe pas dans le r\u00e9pertoire LDAP, {1}.
SS0020= Exception LDAP,{0}, lors de la recherche de l''utilisateur, {1},  dans le r\u00e9pertoire,  {2}.
SS0021= Connexion impossible au serveur LDAP pour l''URL,  {0}, le message d''exception,  {1}.
SS0022= Exception LDAP, {0},  lors de la validation de l''utilisateur, {1}, dans le r\u00e9pertoire, {2}.
SS0023= Les attributs LDAP sont nuls pour l''utilisateur, {0}, dans le r\u00e9pertoire, {1}.
SS0024= Des cookies de session sont requis pour cette application. Autorisez leur utilisation dans le navigateur.
SS0025= L'\u00e9quation du filtre manque de r\u00e9f\u00e9rences aux crit\u00e8res existants.
SS0026= L'\u00e9quation du filtre contient des caract\u00e8res incorrects.
SS0027= Un nom d'utilisateur et un mot de passe valides sont requis.
SS0028= Le nouveau mot de passe doit correspondre au nouveau mot de passe reconfirm\u00e9.
SS0029= Le nom d'utilisateur ou le mot de passe n'est pas correct. Les champs de connexion sont sensibles \u00e0 la casse.
SS0030= Votre mot de passe a expir\u00e9. Veuillez le modifier.
SS0031= Vous avez d\u00e9pass\u00e9 le nombre maximum de tentatives de connexion \u00e9chou\u00e9es.
SS0032= Votre session est expir\u00e9e. Veuillez en ouvrir une nouvelle.
SS0033= Vous devez ouvrir une session pour pouvoir acc\u00e9der \u00e0 cette application.
SS0034= Vous n'avez pas le droit d'acc\u00e9der \u00e0 cette application.
SS0035= Votre compte a \u00e9t\u00e9 suspendu. Veuillez contacter l'administrateur de votre syst\u00e8me.
SS0036= Vous ne pouvez pas cr\u00e9er l''utilisateur r\u00e9serv\u00e9, {0}.
SS0037= Autorisations insuffisantes pour la ressource, {0}.  Doit disposer d''une autorisation de port\u00e9e = ALL ou RoleId correspondant pour mettre \u00e0 jour cette ressource.
SS0038= ACL manquantes pour la ressource, {0}. L''op\u00e9ration requise n\u00e9cessite une ACL avec la permission {1}.
SS0039= ACL manquantes pour la table de la base de donn\u00e9es,  {0}.  L''op\u00e9ration requise n\u00e9cessite une ACL avec la permission {1}.
SS0040= Autorisations insuffisantes pour la table de la base de donn\u00e9es,  {0}.  L''op\u00e9ration requise n\u00e9cessite l''autorisation {1}.
SS0041= Autorisations insuffisantes pour la colonne de la base de donn\u00e9es,  {0}.  L''op\u00e9ration requise n\u00e9cessite l''autorisation {1} .
SS0042= ACL manquantes pour l'entit\u00e9 commerciale,{0}.  L'op\u00e9ration requise n\u00e9cessite une ACL avec la permission {1}.
SS0043= Autorisations insuffisantes pour l''entit\u00e9 commerciale, {0}.  L''op\u00e9ration requise n\u00e9cessite l''autorisation {1} .
SS0044= Impossible d''attribuer des r\u00f4les ({0})\u00e0 l''utilisateur, {1}. Les r\u00f4les peuvent \u00eatre assign\u00e9s \u00e0 un utilisateur si ce dernier dispose des permissions n\u00e9cessaires pour afficher ces r\u00f4les \u00e0 partir de l''entreprise {2}.
SS0045= CSM_ACCESS_CONTROL pour la ressource demand\u00e9e dispose d''une PORTEE incorrecte. La PORTEE,{0}, pour la ressource,  {1}, n''est pas autoris\u00e9e.
SS0046= Le nouveau mot de passe doit \u00eatre diff\u00e9rent des anciens.
SS0047= Utilisateur, {0}, a d\u00e9pass\u00e9 le d\u00e9lai maximum autoris\u00e9 pour la premi\u00e8re tentative de connexion {1} jours.
SS0048= La longueur du mot de passe doit \u00eatre d''au moins  {0}.
SS0049= Le mot de passe doit \u00eatre alphanum\u00e9rique.
SS0050= Le mot de passe doit \u00eatre compos\u00e9 de caract\u00e8res majuscules et minuscules.
SS0051= D\u00e9passement du d\u00e9lai de premi\u00e8re connexion.
SS0052= L'utilisateur ne peut pas s'auto-supprimer.
SS0053= L'utilisateur ne peut pas supprimer sa propre entreprise.
SS0054= Objet inexistant.
SS0055= Violation de la contrainte d'unicit\u00e9 de la base de donn\u00e9es. L'objet existe d\u00e9j\u00e0.
SS0056= Violation de la contrainte d'int\u00e9grit\u00e9 de la base de donn\u00e9es. L'objet a des enregistrements secondaires.
SS0057= Violation de la contrainte d''int\u00e9grit\u00e9 de la base de donn\u00e9es. L''objet principal, {0}, n''existe pas.
SS0058= Violation de la contrainte d'int\u00e9grit\u00e9 de la base de donn\u00e9es. L'objet principal n'existe pas.
SS0059= Exception de la base de donn\u00e9es - {0}.
SS0060= Droits d'acc\u00e8s insuffisants pour pouvoir modifier le mot de passe.
SS0061= Le nom utilisateur supprim\u00e9 {0} ne peut pas \u00eatre r\u00e9utilis\u00e9.
SS0062= Autorisations insuffisantes pour la ressource, {0}. Seuls les utilisateurs de l''entreprise h\u00f4te sont autoris\u00e9s \u00e0 ex\u00e9cuter cette action.
SS0063= Autorisations insuffisantes pour la ressource, {0}. Seuls les utilisateurs de l''entreprise h\u00f4te ou l''une des entreprises partenaires sont autoris\u00e9s \u00e0 ex\u00e9cuter cette action.
SS0064= Vous ne pouvez pas vous connecter car aucun r\u00f4le ne vous a \u00e9t\u00e9 affect\u00e9. Veuillez contacter votre administrateur syst\u00e8me.
SS0065= Vous ne pouvez pas changer le mot de passe d'un compte partag\u00e9. Si votre mot de passe a expir\u00e9, contactez votre administrateur syst\u00e8me.
SS0066= Le {0} est le seul r\u00f4le restant pour cet utilisateur qui ne peut pas le supprimer.
SS0067= L'instruction SQL n'a pu \u00eatre analys\u00e9e. Veuillez consulter l'aide en ligne pour des informations relative \u00e0 la cr\u00e9ation d'instructions SQL avec des expressions de fonctions.
SS0068= L'utilisateur a d\u00e9pass\u00e9 le d\u00e9lai maximal autoris\u00e9 pour la premi\u00e8re tentative de connexion.
SS0069= Compte suspendu pour l'utilisateur :
SS0070= Le nom d'objet de base de donn\u00e9es n'est pas valide.
SS0071= Le Nom Objet BAse de donn\u00e9es {0} est invalide.
SS0072= Le mot de passe ne contient pas le nombre minimum de caract\u00e8res requis.
SS0073= Les caract\u00e8res obligatoires de mot de passe doivent \u00eatre d\u00e9finis lorsque le minimum de caract\u00e8res requis est sup\u00e9rieur \u00e0 0.
SS0074= L'ID d'entreprise racine doit \u00eatre identique \u00e0 l'ID de l'entreprise h\u00f4te.
SS0075= Impossible de valider l'ID d'entreprise racine. Les informations de connexion pour l'utilisateur CSM_System_User ne sont pas correctes.
SS0076= Licence logiciel invalide : {0}.
SS0077= System ne peut pas \u00eatre supprim\u00e9.
SS0078= Impossible d'extraire information authentification.
# Status Messages
SS2000=

# Log Messages
SS3000=

#
# Gensys Referential Validation Rules. Oracle Error Codes 20499 through 20555 are reserved for these
#
20499=Le calendrier d\u00e9fini n'est pas un calendrier de demande.
20500=Les facteurs de pond\u00e9ration de p\u00e9riode sont valides uniquement pour les calendriers de demande.

#
# Batch Process Authentication Messages
#

SS4000=Le fichier de propri\u00e9t\u00e9 d'informations d'identification n'est pas d\u00e9fini.
SS4001=Le fichier de propri\u00e9t\u00e9 d'informations d'identification [{0}] Introuvable.
SS4002=Le fichier de propri\u00e9t\u00e9 d'informations d'identification comporte un nom d'utilisateur. Il ne peut pas \u00eatre \u00e9cras\u00e9 sur la ligne de commande.
SS4003=Echec du service de chiffrement.
SS4004=Le nom d'utilisateur n'existe pas ou est vide dans le fichier d'informations d'identification.
SS4005=Le mot de passe n'existe pas ou est vide dans le fichier d'informations d'identification.
SS4006=Le nom d'utilisateur et l'utilisateur ne peuvent pas \u00eatre sp\u00e9cifi\u00e9s.

#
# Password encryption program (GenerateEncryptedPassword) resource strings
#

SS4014=Entrez le mot de passe \u00e0 chiffrer :
SS4015=Entrez de nouveau le mot de passe pour confirmer :
SS4016=Erreur : Les mots de passe ne concordent pas.
SS4017=Echec du service de chiffrement :
SS4018=Exception E/S en lecture depuis la console syst\u00e8me.
SS4019=Saisir l'ID Utilisateur:
SS4020=Erreur d'\u00e9criture fichier autorisations.
SS4021=Erreur syntaxe ligne de cmde. Syntaxe: genCredentials <credentials_filename>

#
# Change DB Password Utility resource strings
#
SS5001=Saisir mot de passe :
SS5002=Confirmer le mot de passe :
SS5003=\n\n**Echec**. Une erreur s'est produite en modifiant le mot de passe.
SS5004=\n\n**Succ\u00e8s**. Mots de passe modifi\u00e9 pour {0}
SS5005= changeDBCredentials -password schemaName
SS5006=<admin_user> <admin_password> 
SS5007=Erreur d'ex\u00e9cution de commande.
SS5008=Erreur d'inscrip. journ
SS5009=Erreur de lecture fichier.
SS5010=Erreur en enreg. fichier de propri\u00e9t\u00e9.
SS5011=Erreur. Mot de passe doit \u00eatre renseign\u00e9.
SS5013=Erreur. Le nom de sch\u00e9ma  {0} n''existe pas.
SS5014=Erreur encodage. Caract\u00e8re invalide trouv\u00e9 dans ligne {0} sur colonne {1} dans Xserver.xml
SS5015=\n\n**Echec**. Une erreur s'est produite en modifiant le Nom de sch\u00e9ma.
SS5016=\n\n**Succ\u00e8s**. Nom de sch\u00e9ma et mot de passe modifi\u00e9es avec succ\u00e8s pour {0}.
SS5017= changeDBCredentials -schema oldSchemaName newSchemaName

#
# Cross-Site (XSS) Request Forgery resource strings
#
SS5012=[RF-Error]: Demande invalide trouv\u00e9e. Veuillez contacter votre administrateur de syst\u00e8me pour plus une aide suppl\u00e9mentaire

#
# Generation of Encrypted Product ID
#
SS6001=Saisir ID Produit \u00e0 Chiffrer :
SS6002=ID Produit Chiffr\u00e9 :
SS6003=Erreur lors du chiffrage ID Produit
