# Main resource bundle for Security Service exceptions, status messages,
# and log messages
#
# Error Messages
SS0000= Exce\u00e7\u00e3o do sistema desconhecida - {0}.
SS0001= Permiss\u00f5es insuficientes para o recurso, {0}. A opera\u00e7\u00e3o solicitada requer {1} permiss\u00e3o.
SS0002= O usu\u00e1rio tem {0} permiss\u00e3o para o recurso, {1}, mas n\u00e3o para esta Empresa, {2}.
SS0003= O usu\u00e1rio {0} n\u00e3o existe.
SS0004= O objeto {0} n\u00e3o existe.
SS0005= Permiss\u00f5es insuficientes para a opera\u00e7\u00e3o. Este m\u00e9todo s\u00f3 pode ser chamado internamente.
SS0006= A senha do Usu\u00e1rio, {0}, expirou em {1}.
SS0007= A conta de Usu\u00e1rio, {0}, foi suspensa.
SS0008= A nova senha n\u00e3o corresponde \u00e0 senha confirmada.
SS0009= A nova senha n\u00e3o atende \u00e0s restri\u00e7\u00f5es de senha.
SS0010= O usu\u00e1rio, {0}, excedeu o n\u00famero m\u00e1ximo de tentativas de login sem sucesso, {1}.
SS0011= O usu\u00e1rio tem {0} permiss\u00e3o para o recurso, {1}, mas n\u00e3o para este Usu\u00e1rio, {2}.
SS0012= Senha inv\u00e1lida. Ela n\u00e3o coincide com a senha armazenada para este Usu\u00e1rio.
SS0013= Escopo, {0}, \u00e9 inv\u00e1lido para este Recurso, {1}.
SS0014= Viola\u00e7\u00e3o de restri\u00e7\u00e3o de base de dados \u00fanica. O objeto, {0}, j\u00e1 existe.
SS0015= Viola\u00e7\u00e3o de restri\u00e7\u00e3o de integridade da base de dados \u00fanica. O objeto, {0}, tem filhos.
SS0016= Este Filtro cont\u00e9m o n\u00famero m\u00e1ximo de refer\u00eancias de equa\u00e7\u00e3o, {0}.
SS0017= A opera\u00e7\u00e3o setPassword n\u00e3o \u00e9 permitida quando LDAP est\u00e1 habilitado.
SS0018= A opera\u00e7\u00e3o changePassword n\u00e3o \u00e9 permitida quando LDAP est\u00e1 habilitado.
SS0019= O usu\u00e1rio, {0}, n\u00e3o existe no diret\u00f3rio LDAP, {1}.
SS0020= Exce\u00e7\u00e3o LDAP, {0}, enquanto procura o usu\u00e1rio, {1}, no diret\u00f3rio, {2}.
SS0021= N\u00e3o \u00e9 poss\u00edvel se conectar ao servidor LDAP para a URL, {0}, mensagem de exce\u00e7\u00e3o, {1}.
SS0022= Exce\u00e7\u00e3o LDAP, {0}, enquanto valida o usu\u00e1rio, {1}, no diret\u00f3rio, {2}.
SS0023= Atributos do LDAP s\u00e3o nulos para o usu\u00e1rio, {0}, no diret\u00f3rio, {1}.
SS0024= Os cookies de sess\u00e3o s\u00e3o necess\u00e1rios para este aplicativo.  Habilite os cookies de sess\u00e3o em seu navegador.
SS0025= A equa\u00e7\u00e3o de filtro tem refer\u00eancias ausentes nos crit\u00e9rios existentes.
SS0026= A equa\u00e7\u00e3o de filtro cont\u00e9m caracteres inv\u00e1lidos.
SS0027= S\u00e3o necess\u00e1rios um nome de usu\u00e1rio e senha v\u00e1lidos.
SS0028= A nova senha deve corresponder \u00e0 nova senha reconfirmada.
SS0029= O nome de usu\u00e1rio ou senha n\u00e3o \u00e9 v\u00e1lido. Informa\u00e7\u00f5es de login diferenciam mai\u00fasculas de min\u00fasculas.
SS0030= Sua senha expirou. Altere sua senha.
SS0031= M\u00e1ximo de tentativas de login sem \u00eaxito excedido.
SS0032= Sua sess\u00e3o expirou. Fa\u00e7a login novamente.
SS0033= Voc\u00ea precisa estar conectado para acessar esse aplicativo.
SS0034= Voc\u00ea n\u00e3o tem acesso a esse aplicativo.
SS0035= A sua conta foi suspensa.  Entre em contato com o administrador do sistema.
SS0036= Voc\u00ea n\u00e3o pode criar o usu\u00e1rio reservado, {0}.
SS0037= Permiss\u00f5es insuficientes para o recurso, {0}. Deve ter permiss\u00e3o de escopo = TODOS ou um RoleId correspondente para atualizar esse recurso.
SS0038= ACLs ausentes para o recurso, {0}. A opera\u00e7\u00e3o solicitada requer um ACL com {1} permiss\u00e3o.
SS0039= ACLs ausentes para a tabela de banco de dados, {0}. A opera\u00e7\u00e3o solicitada requer um ACL com {1} permiss\u00e3o.
SS0040= Permiss\u00f5es insuficientes para a tabela de banco de dados, {0}. A opera\u00e7\u00e3o solicitada requer {1} permiss\u00e3o.
SS0041= Permiss\u00f5es insuficientes para a coluna de banco de dados, {0}. A opera\u00e7\u00e3o solicitada requer {1} permiss\u00e3o.
SS0042= ACLs ausentes para a entidade de neg\u00f3cios, {0}. A opera\u00e7\u00e3o solicitada requer um ACL com {1} permiss\u00e3o.
SS0043= Permiss\u00f5es insuficientes para a entidade de neg\u00f3cios, {0}. A opera\u00e7\u00e3o solicitada requer {1} permiss\u00e3o.
SS0044= N\u00e3o \u00e9 poss\u00edvel atribuir fun\u00e7\u00f5es ({0}) para o usu\u00e1rio, {1}. Fun\u00e7\u00f5es s\u00f3 podem ser atribu\u00eddas a um usu\u00e1rio se ele tiver permiss\u00f5es para exibir essas fun\u00e7\u00f5es de empresa {2}.
SS0045= O CSM_ACCESS_CONTROL para o Recurso solicitado tem um ESCOPO inv\u00e1lido. O ESCOPO, {0}, para o Recurso, {1}, n\u00e3o \u00e9 permitido.
SS0046= A nova senha n\u00e3o pode ser a mesma que as senhas antigas.
SS0047= O usu\u00e1rio, {0}, ultrapassou o per\u00edodo de tempo m\u00e1ximo permitido para a primeira tentativa de login, {1} dias.
SS0048= o comprimento da senha deve ser de pelo menos {0}.
SS0049= A senha deve ser alfanum\u00e9rica.
SS0050= A senha deve conter mai\u00fasculas e min\u00fasculas.
SS0051= Tempo da janela do primeiro login excedido.
SS0052= O usu\u00e1rio n\u00e3o pode se excluir.
SS0053= O usu\u00e1rio n\u00e3o pode excluir sua pr\u00f3pria empresa.
SS0054= O objeto n\u00e3o existe.
SS0055= Viola\u00e7\u00e3o de restri\u00e7\u00e3o de base de dados \u00fanica. O objeto j\u00e1 existe.
SS0056= Viola\u00e7\u00e3o de restri\u00e7\u00e3o de integridade da base de dados \u00fanica. O objeto tem filhos.
SS0057= Viola\u00e7\u00e3o de restri\u00e7\u00e3o de integridade da base de dados \u00fanica. O objeto pai, {0}, n\u00e3o existe.
SS0058= Viola\u00e7\u00e3o de restri\u00e7\u00e3o de integridade da base de dados \u00fanica. O objeto pai n\u00e3o existe.
SS0059= Exce\u00e7\u00e3o de banco de dados - {0}.
SS0060= Permiss\u00e3o insuficiente para alterar a senha.
SS0061= O nome de usu\u00e1rio exclu\u00eddo {0} n\u00e3o pode ser reutilizado.
SS0062= Permiss\u00f5es insuficientes para o recurso, {0}. Somente os usu\u00e1rios da empresa host est\u00e3o autorizados a realizar esta a\u00e7\u00e3o.
SS0063= Permiss\u00f5es insuficientes para o recurso, {0}. Somente os usu\u00e1rios da empresa host ou de uma das empresas parceiras participantes t\u00eam permiss\u00e3o para executar esta a\u00e7\u00e3o.
SS0064= Voc\u00ea n\u00e3o pode fazer login porque n\u00e3o h\u00e1 fun\u00e7\u00f5es definidas para voc\u00ea. Entre em contato com o administrador do sistema.
SS0065= Voc\u00ea n\u00e3o pode alterar a senha de uma conta compartilhada. Se a sua senha tiver expirado, entre em contato com o administrador do sistema.
SS0066= A fun\u00e7\u00e3o de {0} \u00e9 a \u00fanica restante para esse usu\u00e1rio e n\u00e3o pode ser exclu\u00edda por ele.
SS0067= A declara\u00e7\u00e3o SQL n\u00e3o pode ser analisada. Consulte a ajuda on-line para obter informa\u00e7\u00f5es sobre como formar declara\u00e7\u00f5es SQL com express\u00f5es de fun\u00e7\u00e3o.
SS0068= O usu\u00e1rio ultrapassou o per\u00edodo de tempo m\u00e1ximo permitido para a primeira tentativa de login.
SS0069= Conta Suspensa para o usu\u00e1rio:
SS0070= O nome do objeto de banco de dados \u00e9 inv\u00e1lido.
SS0071= O nome do objeto de banco de dados {0} \u00e9 inv\u00e1lido.
SS0072= A senha n\u00e3o cont\u00e9m o n\u00famero m\u00ednimo de caracteres necess\u00e1rios.
SS0073= Os caracteres exigidos da senha devem ser especificados quando os caracteres m\u00ednimos exigidos da senha forem maior que 0.
SS0074= A ID de empresa raiz deve ser a mesma que a ID de empresa host.
SS0075= N\u00e3o \u00e9 poss\u00edvel validar a ID de empresa raiz. As informa\u00e7\u00f5es de login para o usu\u00e1rio CSM_System_User est\u00e3o incorretas.
SS0076= Licen\u00e7a de software inv\u00e1lida: {0}.
SS0077= O sistema n\u00e3o pode ser exclu\u00eddo.
SS0078= N\u00e3o \u00e9 poss\u00edvel recuperar informa\u00e7\u00f5es de autentica\u00e7\u00e3o.
# Status Messages
SS2000=

# Log Messages
SS3000=

#
# Gensys Referential Validation Rules. Oracle Error Codes 20499 through 20555 are reserved for these
#
20499=O calend\u00e1rio especificado n\u00e3o \u00e9 um Calend\u00e1rio de Demanda.
20500=Os fatores de Pesagem do Per\u00edodo s\u00e3o v\u00e1lidos apenas para Calend\u00e1rios de Demanda.

#
# Batch Process Authentication Messages
#

SS4000=Arquivo de Propriedade de Credenciais N\u00e3o Especificado.
SS4001=Arquivo de Propriedade de Credenciais [{0}] N\u00e3o Encontrado.
SS4002=O Arquivo de Propriedade de Credenciais cont\u00e9m um nome de usu\u00e1rio. Ele n\u00e3o pode ser substitu\u00eddo na linha de comando.
SS4003=O Servi\u00e7o de Criptografia Falhou.
SS4004=O nome de usu\u00e1rio n\u00e3o existe ou est\u00e1 em branco no arquivo de credenciais.
SS4005=A senha n\u00e3o existe ou est\u00e1 em branco no arquivo de credenciais.
SS4006=O userName e o usu\u00e1rio n\u00e3o podem ser especificados.

#
# Password encryption program (GenerateEncryptedPassword) resource strings
#

SS4014=Digite a senha para criptografar:
SS4015=Digite novamente a senha para confirma\u00e7\u00e3o:
SS4016=Erro: As senhas digitadas n\u00e3o correspondem.
SS4017=Erro: O Servi\u00e7o de Criptografia falhou:
SS4018=Erro: Leitura da Exce\u00e7\u00e3o de E/S do console do sistema.
SS4019=Digite a ID de Usu\u00e1rio:
SS4020=Erro ao gravar o arquivo de credenciais.
SS4021=Erro de sintaxe da linha de comando. Sintaxe: genCredentials <credentials_filename>

#
# Change DB Password Utility resource strings
#
SS5001=Digite a senha:
SS5002=Confirme a senha:
SS5003=\n\n**Falha**. Houve um erro ao alterar a senha.
SS5004=\n\n**\u00caxito**. Senha alterada com sucesso para {0}.
SS5005= changeDBCredentials -senha schemaName
SS5006=<admin_user> <admin_password> 
SS5007=Erro ao executar comando.
SS5008=Erro ao gravar registros
SS5009=Erro ao ler arquivo.
SS5010=Erro ao salvar arquivo de propriedades.
SS5011=Erro. A senha n\u00e3o pode estar em branco.
SS5013=Erro. O nome do esquema {0} n\u00e3o existe.
SS5014=Erro de codifica\u00e7\u00e3o. Caractere inv\u00e1lido encontrado na linha {0} na coluna {1} em Xserver.xml.
SS5015=\n\n**Falha**. Ocorreu um erro ao alterar o nome do esquema.
SS5016=\n\n**\u00caxito**. O nome do esquema e a senha foram alterados com \u00eaxito para {0}.
SS5017= changeDBCredentials -esquema oldSchemaName newSchemaName

#
# Cross-Site (XSS) Request Forgery resource strings
#
SS5012=[RF-Error]: Solicita\u00e7\u00e3o inv\u00e1lida encontrada. Entre em contato com o administrador do sistema para obter ajuda

#
# Generation of Encrypted Product ID
#
SS6001=Digite a ID de Produto para Criptografar:
SS6002=ID de Produto Criptografado:
SS6003=Erro ao criptografar ID de produto
