# Main resource bundle for Security Service exceptions, status messages,
# and log messages
#
# Error Messages
SS0000= \u4e0d\u660e\u306a\u30b7\u30b9\u30c6\u30e0\u4f8b\u5916 \uff0d {0}\u3002
SS0001= \u30ea\u30bd\u30fc\u30b9 {0} \u306b\u5bfe\u3057\u3066\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306b\u306f {1} \u6a29\u9650\u304c\u5fc5\u8981\u3067\u3059\u3002
SS0002= \u30e6\u30fc\u30b6\u306b\u306f\u30ea\u30bd\u30fc\u30b9 {1} \u306b\u5bfe\u3059\u308b {0} \u6a29\u9650\u306f\u3042\u308a\u307e\u3059\u304c\u3001\u3053\u306e\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba {2} \u306b\u5bfe\u3057\u3066\u306f\u3042\u308a\u307e\u305b\u3093\u3002
SS0003= \u30e6\u30fc\u30b6 {0} \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
SS0004= \u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0} \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
SS0005= \u64cd\u4f5c\u306b\u5bfe\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u65b9\u6cd5\u306f\u5185\u90e8\u3067\u306e\u307f\u30b3\u30fc\u30eb\u3055\u308c\u307e\u3059\u3002
SS0006= \u30e6\u30fc\u30b6 {0} \u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u306f {1} \u306b\u671f\u9650\u304c\u5207\u308c\u307e\u3057\u305f\u3002
SS0007= \u30e6\u30fc\u30b6 {0} \u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u7121\u52b9\u3067\u3059\u3002
SS0008= \u65b0\u898f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u78ba\u8a8d\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
SS0009= \u65b0\u898f\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u5236\u7d04\u3092\u6e80\u8db3\u3055\u305b\u307e\u305b\u3093\u3002
SS0010= \u30e6\u30fc\u30b6 {0} \u306f\u30b7\u30b9\u30c6\u30e0\u306b\u5b9a\u7fa9\u3055\u308c\u305f\u30ed\u30b0\u30a4\u30f3\u8a66\u884c\u56de\u6570\u306e\u6700\u5927\u5024 {1} \u3092\u8d8a\u3048\u307e\u3057\u305f\u3002
SS0011= \u30ea\u30bd\u30fc\u30b9 {1} \u306b\u5bfe\u3059\u308b {0} \u6a29\u9650\u306f\u3042\u308a\u307e\u3059\u304c\u3001\u3053\u306e\u30e6\u30fc\u30b6 {2} \u306b\u5bfe\u3059\u308b\u6a29\u9650\u306f\u3042\u308a\u307e\u305b\u3093\u3002
SS0012= \u7121\u52b9\u306a\u30d1\u30b9\u30ef\u30fc\u30c9\u3067\u3059\u3002\u3053\u306e\u30e6\u30fc\u30b6\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
SS0013= \u30b9\u30b3\u30fc\u30d7 {0} \u306f\u3053\u306e\u30ea\u30bd\u30fc\u30b9 {1} \u306b\u5bfe\u3057\u3066\u7121\u52b9\u3067\u3059\u3002
SS0014= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u4e00\u610f\u5236\u7d04\u9055\u53cd\u3067\u3059\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0} \u306f\u65e2\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
SS0015= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6574\u5408\u6027\u5236\u7d04\u9055\u53cd\u3067\u3059\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0} \u306b\u306f\u5b50\u304c\u3042\u308a\u307e\u3059\u3002
SS0016= \u3053\u306e\u30d5\u30a3\u30eb\u30bf\u306f\u5f0f\u306e\u53c2\u7167\u306e\u6700\u5927\u6570 {0} \u3092\u542b\u3093\u3067\u3044\u307e\u3059\u3002
SS0017= setPassword \u64cd\u4f5c\u306f LDAP \u304c\u6709\u52b9\u306a\u3068\u304d\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
SS0018= changePassword \u64cd\u4f5c\u306f LDAP \u304c\u6709\u52b9\u306a\u3068\u304d\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
SS0019= \u30e6\u30fc\u30b6 {0} \u306f LDAP \u30c7\u30a3\u30ec\u30af\u30c8\u30ea {1} \u306b\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
SS0020= \u30c7\u30a3\u30ec\u30af\u30c8\u30ea {2} \u5185\u3067\u30e6\u30fc\u30b6 {1} \u306e\u691c\u7d22\u4e2d\u3001LDAP \u4f8b\u5916 {0} \u304c\u767a\u751f\u3002
SS0021= URL {0} \u306e LDAP \u30b5\u30fc\u30d0\u306b\u63a5\u7d9a\u3067\u304d\u307e\u305b\u3093\u3002\u4f8b\u5916\u30e1\u30c3\u30bb\u30fc\u30b8\u306f {1} \u3067\u3059\u3002
SS0022= \u30c7\u30a3\u30ec\u30af\u30c8\u30ea {2} \u5185\u3067\u30e6\u30fc\u30b6 {1} \u306e\u691c\u8a3c\u4e2d\u3001LADP \u4f8b\u5916 {0} \u304c\u767a\u751f\u3002
SS0023= \u30c7\u30a3\u30ec\u30af\u30c8\u30ea {1} \u5185\u306e\u30e6\u30fc\u30b6 {0} \u306b\u5bfe\u3059\u308b LDAP \u5c5e\u6027\u304c null \u3067\u3059\u3002
SS0024= \u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u306e cookie \u304c\u5fc5\u8981\u3067\u3059\u3002\u30d6\u30e9\u30a6\u30b6\u3067\u30bb\u30c3\u30b7\u30e7\u30f3\u306e cookie \u3092\u8a31\u53ef\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0025= \u30d5\u30a3\u30eb\u30bf\u5f0f\u306b\u306f\u65e2\u5b58\u306e\u6761\u4ef6\u3078\u306e\u53c2\u7167\u304c\u3042\u308a\u307e\u305b\u3093\u3002
SS0026= \u5f0f\u306b\u7121\u52b9\u306a\u6587\u5b57\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002
SS0027= \u6709\u52b9\u306a\u30e6\u30fc\u30b6\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002
SS0028= \u65b0\u898f\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u78ba\u8a8d\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u4e00\u81f4\u3057\u306a\u304f\u3066\u306f\u3044\u3051\u307e\u305b\u3093\u3002
SS0029= \u30e6\u30fc\u30b6\u540d\u307e\u305f\u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u7121\u52b9\u3067\u3059\u3002\u30ed\u30b0\u30a4\u30f3\u60c5\u5831\u3067\u306f\u5927\u6587\u5b57\u5c0f\u6587\u5b57\u304c\u533a\u5225\u3055\u308c\u307e\u3059\u3002
SS0030= \u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u671f\u9650\u304c\u5207\u308c\u307e\u3057\u305f\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0031= \u30ed\u30b0\u30a4\u30f3\u8a66\u884c\u56de\u6570\u304c\u6700\u5927\u56de\u6570\u3092\u8d8a\u3048\u307e\u3057\u305f\u3002
SS0032= \u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u671f\u9650\u304c\u5207\u308c\u307e\u3057\u305f\u3002\u3082\u3046\u4e00\u5ea6\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0033= \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u306b\u306f\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0034= \u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30bb\u30b9\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
SS0035= \u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u7121\u52b9\u3067\u3059\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u3044\u5408\u308f\u305b\u304f\u3060\u3055\u3044\u3002
SS0036= \u4e88\u7d04\u6e08\u30e6\u30fc\u30b6 {0} \u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
SS0037= \u30ea\u30bd\u30fc\u30b9 {0} \u306b\u5bfe\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u30b9\u30b3\u30fc\u30d7\u6a29\u9650\u304c ALL \u304b\u3053\u306e\u30ea\u30bd\u30fc\u30b9\u3092\u66f4\u65b0\u3059\u308b RoleID \u304c\u5fc5\u8981\u3067\u3059\u3002
SS0038= \u30ea\u30bd\u30fc\u30b9 {0} \u306b\u5bfe\u3059\u308b\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u30ea\u30b9\u30c8\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306b\u306f {1} \u6a29\u9650\u306e\u3042\u308b\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u30ea\u30b9\u30c8\u304c\u5fc5\u8981\u3067\u3059\u3002
SS0039= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb {0} \u306b\u5bfe\u3059\u308b\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u30ea\u30b9\u30c8\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306b\u306f {1} \u6a29\u9650\u306e\u3042\u308b\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u30ea\u30b9\u30c8\u304c\u5fc5\u8981\u3067\u3059\u3002
SS0040= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30c6\u30fc\u30d6\u30eb {0} \u306b\u5bfe\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306b\u306f {1} \u6a29\u9650\u304c\u5fc5\u8981\u3067\u3059\u3002
SS0041= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u5217 {0} \u306b\u5bfe\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306b\u306f {1} \u6a29\u9650\u304c\u5fc5\u8981\u3067\u3059\u3002
SS0042= \u30d3\u30b8\u30cd\u30b9\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3 {0} \u306b\u5bfe\u3059\u308b\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u30ea\u30b9\u30c8\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306b\u306f {1} \u6a29\u9650\u306e\u3042\u308b\u30a2\u30af\u30bb\u30b9\u5236\u5fa1\u30ea\u30b9\u30c8\u304c\u5fc5\u8981\u3067\u3059\u3002
SS0043= \u30d3\u30b8\u30cd\u30b9\u30a8\u30f3\u30c6\u30a3\u30c6\u30a3 {0} \u306b\u5bfe\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002\u8981\u6c42\u3055\u308c\u305f\u64cd\u4f5c\u306b\u306f {1} \u6a29\u9650\u304c\u5fc5\u8981\u3067\u3059\u3002
SS0044= \u30e6\u30fc\u30b6 {1} \u306b\u30ed\u30fc\u30eb ({0}) \u3092\u5272\u308a\u5f53\u3066\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u30e6\u30fc\u30b6\u304c\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba {2} \u304b\u3089\u30ed\u30fc\u30eb\u3092\u53c2\u7167\u3059\u308b\u6a29\u9650\u3092\u6301\u3064\u5834\u5408\u3001\u30ed\u30fc\u30eb\u3092\u30e6\u30fc\u30b6\u306b\u5272\u308a\u5f53\u3066\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
SS0045= \u8981\u6c42\u3055\u308c\u305f\u30ea\u30bd\u30fc\u30b9\u306b\u5bfe\u3059\u308b CSM_ACCESS_CNTORL \u306f\u7121\u52b9\u306a\u30b9\u30b3\u30fc\u30d7\u304c\u3042\u308a\u307e\u3059\u3002\u30ea\u30bd\u30fc\u30b9 {1} \u306b\u5bfe\u3059\u308b\u30b9\u30b3\u30fc\u30d7 {0} \u306f\u8a31\u53ef\u3055\u308c\u307e\u305b\u3093\u3002
SS0046= \u65b0\u898f\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u4ee5\u524d\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3068\u7570\u306a\u308b\u3082\u306e\u3092\u8a2d\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0047= \u30e6\u30fc\u30b6 {0} \u306e\u521d\u56de\u30ed\u30b0\u30a4\u30f3\u306f\u6700\u5927\u8a31\u5bb9\u671f\u9593( {1} \u65e5)\u3092\u8d85\u904e\u3057\u3066\u3044\u307e\u3059\u3002
SS0048= \u30d1\u30b9\u30ef\u30fc\u30c9\u306f {0} \u6587\u5b57\u4ee5\u4e0a\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0049= \u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u30a2\u30eb\u30d5\u30a1\u30d9\u30c3\u30c8\u3068\u6570\u5b57\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0050= \u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5927\u6587\u5b57\u3068\u5c0f\u6587\u5b57\u3092\u6df7\u305c\u3066\u304f\u3060\u3055\u3044\u3002
SS0051= \u521d\u56de\u30ed\u30b0\u30a4\u30f3\u671f\u9593\u3092\u8d85\u904e\u3057\u307e\u3057\u305f\u3002
SS0052= \u30e6\u30fc\u30b6\u306f\u81ea\u5206\u81ea\u8eab\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
SS0053= \u30e6\u30fc\u30b6\u306f\u81ea\u5206\u81ea\u8eab\u306e\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
SS0054= \u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u3042\u308a\u307e\u305b\u3093\u3002
SS0055= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u4e00\u610f\u5236\u7d04\u9055\u53cd\u3067\u3059\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u65e2\u306b\u5b58\u5728\u3057\u3066\u3044\u307e\u3059\u3002
SS0056= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6574\u5408\u6027\u5236\u7d04\u9055\u53cd\u3067\u3059\u3002\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5b50\u304c\u3042\u308a\u307e\u3059\u3002
SS0057= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6574\u5408\u6027\u5236\u7d04\u9055\u53cd\u3067\u3059\u3002 \u89aa\u30aa\u30d6\u30b8\u30a7\u30af\u30c8 {0} \u304c\u3042\u308a\u307e\u305b\u3093\u3002
SS0058= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u6574\u5408\u6027\u5236\u7d04\u9055\u53cd\u3067\u3059\u3002\u89aa\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u3042\u308a\u307e\u305b\u3093\u3002
SS0059= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u4f8b\u5916 - {0}\u3002
SS0060= \u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
SS0061= \u524a\u9664\u6e08\u307f\u306e\u30e6\u30fc\u30b6\u540d {0} \u3092\u518d\u4f7f\u7528\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
SS0062= \u30ea\u30bd\u30fc\u30b9\u306b\u5bfe\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\uff1a{0} \u30db\u30b9\u30c8\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba\u306e\u30e6\u30fc\u30b6\u3060\u3051\u304c\u3053\u306e\u51e6\u7406\u3092\u5b9f\u884c\u3067\u304d\u307e\u3059\u3002
SS0063= \u30ea\u30bd\u30fc\u30b9\u306b\u5bfe\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\uff1a{0} \u30db\u30b9\u30c8\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba\u307e\u305f\u306f\u30d1\u30fc\u30c8\u30ca\u30fc\u3068\u306a\u3063\u3066\u3044\u308b\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba\u306e\u30e6\u30fc\u30b6\u3060\u3051\u304c\u3053\u306e\u51e6\u7406\u3092\u5b9f\u884c\u3067\u304d\u307e\u3059\u3002
SS0064= \u3053\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306b\u306f\u30ed\u30fc\u30eb\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u30ed\u30b0\u30a4\u30f3\u3067\u304d\u307e\u305b\u3093\u3002\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u3044\u5408\u308f\u305b\u304f\u3060\u3055\u3044\u3002
SS0065= \u5171\u6709\u30a2\u30ab\u30a6\u30f3\u30c8\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u6709\u52b9\u671f\u9650\u304c\u5207\u308c\u305f\u5834\u5408\u306f\u3001\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u304a\u554f\u3044\u5408\u308f\u305b\u304f\u3060\u3055\u3044\u3002
SS0066= \u30ed\u30fc\u30eb {0} \u306f\u3053\u306e\u30e6\u30fc\u30b6\u306b\u5272\u308a\u5f53\u3066\u3089\u308c\u305f\u552f\u4e00\u306e\u30ed\u30fc\u30eb\u306a\u306e\u3067\u3001\u3053\u306e\u30e6\u30fc\u30b6\u304c\u524a\u9664\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
SS0067= SQL \u6587\u3092\u89e3\u6790\u3067\u304d\u307e\u305b\u3093\u3002\u95a2\u6570\u5f0f\u3092\u6301\u3064 SQL \u6587\u306e\u751f\u6210\u306b\u3064\u3044\u3066\u306e\u60c5\u5831\u306f\u30aa\u30f3\u30e9\u30a4\u30f3\u30d8\u30eb\u30d7\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0068= \u521d\u3081\u3066\u30ed\u30b0\u30a4\u30f3\u3057\u306a\u3051\u308c\u3070\u306a\u3089\u306a\u3044\u671f\u9593\u3092\u8d85\u904e\u3057\u307e\u3057\u305f\u3002
SS0069= \u30a2\u30ab\u30a6\u30f3\u30c8\u304c\u7121\u52b9\u306a\u30e6\u30fc\u30b6\uff1a
SS0070= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u540d\u304c\u7121\u52b9\u3067\u3059\u3002
SS0071= \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u540d {0} \u304c\u7121\u52b9\u3067\u3059\u3002
SS0072= \u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u5fc5\u9808\u6587\u5b57\u304c\u6700\u5c0f\u6587\u5b57\u6570\u306b\u8db3\u308a\u307e\u305b\u3093\u3002
SS0073= password_minimum_required_characters \u304c 0 \u3088\u308a\u5927\u304d\u3044\u5834\u5408\u306f password_required_characters \u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SS0074= \u30eb\u30fc\u30c8\u306e\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30baID \u306f\u30db\u30b9\u30c8\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30baID \u3068\u540c\u3058\u3067\u3042\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
SS0075= \u30eb\u30fc\u30c8\u306e\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30baID\u3092\u691c\u8a3c\u3067\u304d\u307e\u305b\u3093\u3002CSM_System_User \u3068\u3044\u3046\u30e6\u30fc\u30b6\u306e\u30ed\u30b0\u30a4\u30f3\u60c5\u5831\u304c\u4e0d\u6b63\u3067\u3059\u3002
SS0076= \u4ee5\u4e0b\u306f\u7121\u52b9\u306a\u30bd\u30d5\u30c8\u30a6\u30a7\u30a2\u30e9\u30a4\u30bb\u30f3\u30b9\u3067\u3059\uff1a {0}\u3002
SS0077= System \u306f\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002
SS0078= \u8a8d\u8a3c\u60c5\u5831\u3092\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
# Status Messages
SS2000=

# Log Messages
SS3000=

#
# Gensys Referential Validation Rules. Oracle Error Codes 20499 through 20555 are reserved for these
#
20499=\u6307\u5b9a\u3057\u305f\u30ab\u30ec\u30f3\u30c0\u306f\u9700\u8981\u30ab\u30ec\u30f3\u30c0\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002
20500=\u671f\u9593\u6bd4\u91cd\u306f\u9700\u8981\u30ab\u30ec\u30f3\u30c0\u306e\u307f\u3067\u6709\u52b9\u3067\u3059\u3002

#
# Batch Process Authentication Messages
#

SS4000=\u8a8d\u8a3c\u60c5\u5831\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
SS4001=\u8a8d\u8a3c\u60c5\u5831\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb [{0}] \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
SS4002=\u8a8d\u8a3c\u60c5\u5831\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306b\u306f\u30e6\u30fc\u30b6\u540d\u304c\u3042\u308a\u307e\u3059\u3002\u30e6\u30fc\u30b6\u540d\u3092\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u304b\u3089\u4e0a\u66f8\u304d\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002
SS4003=\u6697\u53f7\u5316\u30b5\u30fc\u30d3\u30b9\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002
SS4004=\u8a8d\u8a3c\u60c5\u5831\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306b\u30e6\u30fc\u30b6\u540d\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u7a7a\u767d\u3067\u3059\u3002
SS4005=\u8a8d\u8a3c\u60c5\u5831\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306b\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u7a7a\u767d\u3067\u3059\u3002
SS4006=userName \u3068\u30e6\u30fc\u30b6\u306e\u4e21\u65b9\u306f\u6307\u5b9a\u3067\u304d\u307e\u305b\u3093\u3002

#
# Password encryption program (GenerateEncryptedPassword) resource strings
#

SS4014=\u6697\u53f7\u5316\u3059\u308b\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\uff1a
SS4015=\u78ba\u8a8d\u306e\u305f\u3081\u306b\u518d\u5ea6\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\uff1a
SS4016=\u30a8\u30e9\u30fc\uff1a \u5165\u529b\u3055\u308c\u305f\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002
SS4017=\u30a8\u30e9\u30fc\uff1a \u6697\u53f7\u5316\u30b5\u30fc\u30d3\u30b9\u304c\u5931\u6557\u3057\u307e\u3057\u305f\uff1a
SS4018=\u30a8\u30e9\u30fc\uff1a \u30b7\u30b9\u30c6\u30e0\u30b3\u30f3\u30bd\u30fc\u30eb\u304b\u3089 IO \u4f8b\u5916\u3067\u3059\u3002
SS4019=\u30e6\u30fc\u30b6 ID \u306e\u5165\u529b\uff1a
SS4020=\u8a8d\u8a3c\u60c5\u5831\u30d5\u30a1\u30a4\u30eb\u306b\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
SS4021=\u30b3\u30de\u30f3\u30c9\u30e9\u30a4\u30f3\u306e\u69cb\u6587\u30a8\u30e9\u30fc\u3002\u69cb\u6587\uff1a genCredentials <\u8a8d\u8a3c\u60c5\u5831_\u30d5\u30a1\u30a4\u30eb\u540d>

#
# Change DB Password Utility resource strings
#
SS5001=\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u5165\u529b\uff1a
SS5002=\u78ba\u8a8d\u30d1\u30b9\u30ef\u30fc\u30c9:
SS5003=\n\n**\u5931\u6557**\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
SS5004=\n\n**\u6210\u529f**\u3002{0} \u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
SS5005= changeDBCredentials -password schemaName
SS5006=<admin_user> <admin_password> 
SS5007=\u30b3\u30de\u30f3\u30c9\u5b9f\u884c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
SS5008=\u30ed\u30b0\u66f8\u304d\u8fbc\u307f\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f
SS5009=\u30d5\u30a1\u30a4\u30eb\u3092\u8aad\u307f\u8fbc\u307f\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
SS5010=\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u5b58\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
SS5011=\u30a8\u30e9\u30fc\u3002\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u7a7a\u767d\u306b\u3067\u304d\u307e\u305b\u3093\u3002
SS5013=\u30a8\u30e9\u30fc\u3002\u30b9\u30ad\u30fc\u30de\u540d {0} \u304c\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
SS5014=\u7b26\u53f7\u5316\u30a8\u30e9\u30fc\u3067\u3059\u3002 Xserver.xml \u306e{1} \u5217 \u306e{0} \u884c\u306b\u7121\u52b9\u306a\u6587\u5b57\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002
SS5015=\n\n**\u5931\u6557**\u3002\u30b9\u30ad\u30fc\u30de\u540d\u3092\u5909\u66f4\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
SS5016=\n\n**\u6210\u529f**\u3002 {0} \u306e\u30b9\u30ad\u30fc\u30de\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002
SS5017= changeDBCredentials -schema oldSchemaName newSchemaName

#
# Cross-Site (XSS) Request Forgery resource strings
#
SS5012=[RF-\u30a8\u30e9\u30fc]: \u7121\u52b9\u306a\u8981\u6c42\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\u3002\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u306b\u9023\u7d61\u3057\u3066\u304f\u3060\u3055\u3044

#
# Generation of Encrypted Product ID
#
SS6001=\u88fd\u54c1 ID \u3092\u5165\u529b\u3057\u3066\u6697\u53f7\u5316\uff1a
SS6002=\u6697\u53f7\u5316\u3055\u308c\u305f\u88fd\u54c1 ID:
SS6003=\u88fd\u54c1 ID \u6697\u53f7\u5316\u6642\u306e\u30a8\u30e9\u30fc
