# Main resource bundle for SRE exceptions, status messages,
# and log messages
#
# Error Messages
SRE0000= Exception syst\u00e8me inconnue - {0}.
SRE0001= Erreur lors de la r\u00e9cup\u00e9ration du sercice de lancement - {0}.
SRE0002= Erreur lors de la r\u00e9cup\u00e9ration du service de statut - {0}.
SRE0003= Erreur lors de la r\u00e9cup\u00e9ration du service de configuration - {0}.
SRE0004= Erreur lors de la r\u00e9cup\u00e9ration du service de gestion - {0}.
SRE0005= Erreur lors de la r\u00e9cup\u00e9ration du service d''options - {0}.
SRE0006= Nom d'ensemble de groupes d'action manquant.
SRE0007= Erreur lors de la r\u00e9cup\u00e9ration de l'ensemble de groupes d'action - {0}.
SRE0008= Aucune configuration de noeud par d\u00e9faut trouv\u00e9e pour le processus - {0}.
SRE0009= Erreurs d\u00e9tect\u00e9es durant la tentative d''ex\u00e9cution de la cha\u00eene de travaux - {0}. Veuillez v\u00e9rifier le fichier de journalisation pour plus de d\u00e9tails.
SRE0010= Erreurs d\u00e9tect\u00e9es pour l''\u00e9tape {0} de la cha\u00eene de travaux {1}.
SRE0011= Autorisations insuffisantes pour cr\u00e9er l''ensemble d''options pour le processus - {0}.
SRE0012= Autorisations insuffisantes pour supprimer l''ensemble d''options pour le processus - {0}.
SRE0013= Autorisations insuffisantes pour mettre \u00e0 jour l''ensemble d''options pour le processus - {0}.
SRE0014= {0} ne poss\u00e8de pas les droits requis pour annuler le travail {1}.
SRE0015= Impossible de lier l''objet distant au registre RMI - {0}.
SRE0016= Impossible de s\u00e9parer l''objet distant du registre RMI - {0}.
SRE0017= Echecs r\u00e9p\u00e9t\u00e9s d''appel distant sur InterfaceGroupName [{0}].
SRE0018= Aucune exception objet trouv\u00e9e sur InterfaceGroupName [{0}].
SRE0019= L''ensemble d''options indiqu\u00e9 {0}, pour le processus {1} n''existe pas ou l''utilisateur ne dispose pas des droits d''acc\u00e8s requis.
SRE0020= Le processus indiqu\u00e9 {0} n''existe pas.
SRE0021= La configuration de noeud indiqu\u00e9e {0} pour le processus {1} n''existe pas.
SRE0022= La recherche sp\u00e9cifi\u00e9e {0} est invalide. Veuillez v\u00e9rifier si le nom de l''entreprise est valide.
SRE0023= {0} ne dispose pas des droits requis pour supprimer le travail {1}.
SRE0024= Impossible d''annuler le travail {0}. Le travail est peut-\u00eatre termin\u00e9 ou ne se trouve pas dans une cha\u00eene de travaux.
SRE0025= Impossible d''\u00e9lever le niveau de priorit\u00e9 du travail {0}.  L''\u00e9tat du travail n''est plus Attribution de noeuds.
SRE0026= Impossible de baisser le niveau de priorit\u00e9 du travail {0}.  L'\u00e9tat du travail n'est plus Attribution de noeuds.
SRE0027= Impossible d''effectuer une op\u00e9ration sur la t\u00e2che {0}. La t\u00e2che est peut \u00eatre d\u00e9j\u00e0 compl\u00e9t\u00e9e.
SRE0028= Impossible d'effectuer actuellement la suppression de la  t\u00e2che. La t\u00e2che est  en cours de nettoyage.
SRE0029= L''ensemble d''options publiques indiqu\u00e9 {0}, pour le processus {1}, entreprise {2} n''existe pas ou l''utilisateur ne dispose pas des droits d''acc\u00e8s requis.
SRE0030= L''ensemble d''options priv\u00e9es indiqu\u00e9 {0}, pour le processus {1}, entreprise {2} n''existe pas ou l''utilisateur ne dispose pas des droits d''acc\u00e8s requis.
SRE0031= Autorisations insuffisantes pour mettre \u00e0 jour le pool de noeuds et affecter les processus.
SRE0032= Autorisations insuffisantes pour cr\u00e9er le pool de noeuds et affecter les processus.
SRE0033= Impossible de fermer le pool de noeuds {0}. Le noeud n'est peut \u00eatre pas en cours d'ex\u00e9cution.
SRE0034= Impossible de valider l''objet distant du registre RMI - {0}.
SRE0035= Le processus sp\u00e9cifi\u00e9 {0} est un processus interne et ne peut pas \u00eatre invoqu\u00e9 en tant que processus par lot.
SRE0036= Autorisations insuffisantes pour augmenter ou d\u00e9cro\u00eetre la priorit\u00e9 de t\u00e2che.
SRE0037= Traitement sp\u00e9cifi\u00e9 {0} n''est pas compatible avec demandes cycle de vie action.
SRE0038= Impossible de charger le code impl\u00e9mentation pour traitement sp\u00e9cifi\u00e9 - {0}.
SRE0039= Le groupe d''actions sp\u00e9cifi\u00e9 {0} pour traitement {1} est incomplet et doit \u00eatre re-cr\u00e9\u00e9 via les demandes de cycle de vie action CREATE_AND_SAVE_ACTIONS ou CREATE_ACTIONS_ONLY.
SRE0040= La limite priorit\u00e9 minimum a \u00e9t\u00e9 atteinte sur le travail {0}.
SRE0041= La limite priorit\u00e9 maximum a \u00e9t\u00e9 atteinte sur le travail {0}.
SRE0042= Objet d\u00e9j\u00e0 verrouill\u00e9 par l''utilisateur pour NomGroupeInterface [{0}].
SRE0043= Le processus sp\u00e9cifi\u00e9 {0} n''est pas compatible avec les actions de cr\u00e9ation mais seulement avec les demandes de cycle de vie action.

# Status Messages
SRE2000= L'\u00e9tat du travail est pass\u00e9 \u00e0 Attribution de noeuds.
SRE2001= L'\u00e9tat du travail est pass\u00e9 \u00e0 Pr\u00e9paration du travail.
SRE2002= L'\u00e9tat du travail est pass\u00e9 \u00e0 Pr\u00e9paration d'actions.
SRE2003= L'\u00e9tat du travail est pass\u00e9 \u00e0 Traitement.
SRE2004= L'\u00e9tat du travail est pass\u00e9 \u00e0 Annulation.
SRE2005= L'\u00e9tat du travail est pass\u00e9 \u00e0 Traitement final.
SRE2006= L'\u00e9tat du travail est pass\u00e9 \u00e0 Termin\u00e9.
SRE2007= L'\u00e9tat du travail est pass\u00e9 \u00e0 R\u00e9initialisation \u00e0 cause d'un incident.
SRE2008= L'\u00e9tat du travail est pass\u00e9 \u00e0 Arr\u00eat du travail.
SRE2009= L'\u00e9tat du travail est pass\u00e9 \u00e0 Attente d'attribution.

# Log Messages
SRE3000=

# Batch Utility Error Messages
Batch.Usage= Usage : SREBatchUtility [-validateOnly] [-user <utilisateur>] [-credentials <informationsdidentification>] <fichierXMLrequ\u00eate>]

# Batch Utility Error Messages
Batch.AuthenticationError= Option non valide : {0}.
Batch.BadUserName= Erreur lors de l'analyse du nom d'utilisateur du fichier de propri\u00e9t\u00e9s - {0}.
Batch.BadUserPassword= Erreur lors de l''analyse du mot de passe utilisateur du fichier de propri\u00e9t\u00e9s - {0}.
Batch.BadUserInfo = Erreur lors du chargement des informations d'identification de l'utilisateur - {0}.
Batch.BadCredentialsFile= Erreur lors de l''ouverture du fichier de propri\u00e9t\u00e9s - {0}.
Batch.ParseError= Erreur lors de l''analyse du fichier de requ\u00eate - {0}.
Batch.LogFileError= Impossible d''ouvrir le fichier journal - {0}.
Batch.XMLParseException= Erreur d''analyse XML d\u00e9tect\u00e9e sur la ligne {0}, colonne {1}\n  {2}


# Batch Utility Informational Messages
Batch.ValidRequest= Aucune erreur lors de l''analyse du fichier de requ\u00eate - {0}.


# Validation Messages
Validation.CharacterValidationError=L''une des valeurs saisies, {0}, contient un caract\u00e8re non valide : {1}.
Validation.FieldValidationError=Caract\u00e8re incorrect : {0}.
Validation.RequiredOptionsMissingError=Toutes les options requises pour le processus n'ont pas \u00e9t\u00e9 d\u00e9finies.
Validation.InvalidValuesforOptionError=Valeurs incorrectes d\u00e9finies pour l''option : {0}.
Validation.InvalidOptionError=Option non valide : {0}.

#Batch Information Messages
Batch.info.JobDescription=Description de t\u00e2che
Batch.info.JobId=ID t\u00e2che
Batch.info.ServiceName=Nom Service
Batch.info.NodeConfig=Config. de noeud

SS6001=Les r\u00f4les {0} peuvent seulement \u00eatre affect\u00e9s sur une configuration de noeud simple pour le service {1} dans le pool {2}.

# Job Summary Extension
JobSummaryExtension.NumberOfActions = Nombre d'actions :

