# Main resource bundle for SRE exceptions, status messages,
# and log messages
#
# Error Messages
SRE0000= \u4e0d\u660e\u306a\u30b7\u30b9\u30c6\u30e0\u4f8b\u5916 \uff0d {0}\u3002
SRE0001= \u8d77\u52d5\u30b5\u30fc\u30d3\u30b9\u306b\u30a8\u30e9\u30fc - {0}\u3002
SRE0002= \u72b6\u6cc1\u30b5\u30fc\u30d3\u30b9\u306b\u30a8\u30e9\u30fc - {0}\u3002
SRE0003= \u8a2d\u5b9a\u30b5\u30fc\u30d3\u30b9\u306b\u30a8\u30e9\u30fc - {0}\u3002
SRE0004= \u7ba1\u7406\u30b5\u30fc\u30d3\u30b9\u306b\u30a8\u30e9\u30fc - {0}\u3002
SRE0005= \u30aa\u30d7\u30b7\u30e7\u30f3\u30b5\u30fc\u30d3\u30b9\u306b\u30a8\u30e9\u30fc - {0}\u3002
SRE0006= \u30a2\u30af\u30b7\u30e7\u30f3\u30b0\u30eb\u30fc\u30d7\u30bb\u30c3\u30c8\u540d\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
SRE0007= \u30a2\u30af\u30b7\u30e7\u30f3\u30b0\u30eb\u30fc\u30d7\u30bb\u30c3\u30c8\u306b\u30a8\u30e9\u30fc - {0}.
SRE0008= \u30d7\u30ed\u30bb\u30b9\u7528\u306e\u65e2\u5b9a\u30ce\u30fc\u30c9\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093 - {0}\u3002
SRE0009= \u30b8\u30e7\u30d6\u30c1\u30a7\u30fc\u30f3\u5b9f\u884c\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f - {0}\u3002\u8a73\u7d30\u306f\u30ed\u30b0\u3092\u691c\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SRE0010= \u30b8\u30e7\u30d6\u30c1\u30a7\u30fc\u30f3 {1} \u306e\u30b9\u30c6\u30c3\u30d7{0} \u3067\u30a8\u30e9\u30fc\u3002
SRE0011= \u30d7\u30ed\u30bb\u30b9\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8\u3092\u4f5c\u6210\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059 - {0}\u3002
SRE0012= \u30d7\u30ed\u30bb\u30b9\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8\u3092\u524a\u9664\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059 - {0}\u3002
SRE0013= \u30d7\u30ed\u30bb\u30b9\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8\u3092\u66f4\u65b0\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059 - {0}\u3002
SRE0014= {0} \u306b\u306f\u30b8\u30e7\u30d6 {1} \u3092\u30ad\u30e3\u30f3\u30bb\u30eb\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
SRE0015= \u30ea\u30e2\u30fc\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092 RMI \u30ec\u30b8\u30b9\u30c8\u30ea\u306b\u30d0\u30a4\u30f3\u30c9\u3067\u304d\u307e\u305b\u3093 - {0}\u3002
SRE0016= \u30ea\u30e2\u30fc\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092 RMI \u30ec\u30b8\u30b9\u30c8\u30ea\u304b\u3089\u30d0\u30a4\u30f3\u30c9\u89e3\u9664\u3067\u304d\u307e\u305b\u3093 - {0}\u3002
SRE0017= InterfaceGroupName [{0}] \u306b\u304a\u3044\u3066\u30ea\u30e2\u30fc\u30c8\u30b3\u30fc\u30eb\u306e\u5931\u6557\u304c\u7e70\u308a\u8fd4\u3055\u308c\u3066\u3044\u307e\u3059\u3002
SRE0018= InterfaceGroupName [{0}] \u306b\u304a\u3044\u3066\u4f8b\u5916\u306e\u3042\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
SRE0019= \u30d7\u30ed\u30bb\u30b9 {1} \u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8 {0} \u304c\u5b58\u5728\u3057\u306a\u3044\u304b\u3001\u307e\u305f\u306f\u30e6\u30fc\u30b6\u306f\u30a2\u30af\u30bb\u30b9\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002
SRE0020= \u30d7\u30ed\u30bb\u30b9 {0} \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
SRE0021= \u30d7\u30ed\u30bb\u30b9 {1} \u306e\u30ce\u30fc\u30c9\u8a2d\u5b9a {0} \u306f\u5b58\u5728\u3057\u307e\u305b\u3093\u3002
SRE0022= \u691c\u7d22 {0} \u306f\u7121\u52b9\u3067\u3059\u3002\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba\u540d\u304c\u6709\u52b9\u304b\u3069\u3046\u304b\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SRE0023= {0} \u306b\u306f\u30b8\u30e7\u30d6{1} \u3092\u524a\u9664\u3059\u308b\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
SRE0024= \u30b8\u30e7\u30d6{0} \u3092\u30ad\u30e3\u30f3\u30bb\u30eb\u3067\u304d\u307e\u305b\u3093\u3002\u30b8\u30e7\u30d6\u306f\u65e2\u306b\u7d42\u4e86\u3057\u3066\u3044\u308b\u304b\u3001\u307e\u305f\u306f\u30b8\u30e7\u30d6\u30c1\u30a7\u30fc\u30f3\u306e\u73fe\u5728\u306e\u30b8\u30e7\u30d6\u3067\u306f\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
SRE0025= \u30b8\u30e7\u30d6{0} \u306e\u512a\u5148\u9806\u4f4d\u3092\u5f15\u304d\u4e0a\u3052\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u30ce\u30fc\u30c9\u306e\u5272\u5f53\u3067\u306f\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
SRE0026= \u30b8\u30e7\u30d6{0} \u306e\u512a\u5148\u9806\u4f4d\u3092\u5f15\u304d\u4e0b\u3052\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3002\u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u30ce\u30fc\u30c9\u306e\u5272\u5f53\u3067\u306f\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
SRE0027= \u30b8\u30e7\u30d6{0} \u306e\u51e6\u7406\u3092\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002\u30b8\u30e7\u30d6\u306f\u65e2\u306b\u7d42\u4e86\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
SRE0028= \u73fe\u6642\u70b9\u3067\u306e\u30b8\u30e7\u30d6\u306e\u524a\u9664\u306f\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093\u3002\u30b8\u30e7\u30d6\u306f\u7d42\u4e86\u51e6\u7406\u4e2d\u3067\u3059\u3002
SRE0029= \u30d7\u30ed\u30bb\u30b9 {1} \u3068\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba {2} \u306e\u305f\u3081\u306b\u6307\u5b9a\u3057\u305f\u30d1\u30d6\u30ea\u30c3\u30af\u306a\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8 {0} \u306f\u5b58\u5728\u3057\u306a\u3044\u304b\u30e6\u30fc\u30b6\u306e\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002
SRE0030= \u30d7\u30ed\u30bb\u30b9 {1} \u3068\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba {2} \u306e\u305f\u3081\u306b\u6307\u5b9a\u3057\u305f\u30d7\u30e9\u30a4\u30d9\u30fc\u30c8\u306a\u30aa\u30d7\u30b7\u30e7\u30f3\u30bb\u30c3\u30c8 {0} \u306f\u5b58\u5728\u3057\u306a\u3044\u304b\u30e6\u30fc\u30b6\u306e\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002
SRE0031= \u30ce\u30fc\u30c9\u30d7\u30fc\u30eb\u306e\u66f4\u65b0\u3068\u30d7\u30ed\u30bb\u30b9\u306e\u5272\u5f53\u3092\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002
SRE0032= \u30ce\u30fc\u30c9\u30d7\u30fc\u30eb\u306e\u4f5c\u6210\u3068\u30d7\u30ed\u30bb\u30b9\u306e\u5272\u5f53\u3092\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002
SRE0033= \u30ce\u30fc\u30c9\u30d7\u30fc\u30eb {0} \u3092\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3067\u304d\u307e\u305b\u3093\u3002\u30ce\u30fc\u30c9\u30d7\u30fc\u30eb\u306f\u7a3c\u52d5\u3057\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
SRE0034= \u30ea\u30e2\u30fc\u30c8\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092 RMI \u30ec\u30b8\u30b9\u30c8\u30ea\u304b\u3089\u691c\u8a3c\u3067\u304d\u307e\u305b\u3093 - {0}\u3002
SRE0035= \u6307\u5b9a\u3057\u305f\u30d7\u30ed\u30bb\u30b9 {0} \u306f\u5185\u90e8\u30d7\u30ed\u30bb\u30b9\u306a\u306e\u3067\u30d0\u30c3\u30c1\u30d7\u30ed\u30bb\u30b9\u3068\u3057\u3066\u306f\u8d77\u52d5\u3067\u304d\u307e\u305b\u3093\u3002
SRE0036= \u30b8\u30e7\u30d6\u306e\u512a\u5148\u9806\u4f4d\u3092\u5909\u66f4\u3059\u308b\u6a29\u9650\u304c\u4e0d\u8db3\u3057\u3066\u3044\u307e\u3059\u3002
SRE0037= \u6307\u5b9a\u30d7\u30ed\u30bb\u30b9 {0} \u306f\u30a2\u30af\u30b7\u30e7\u30f3\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u306e\u8981\u6c42\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002
SRE0038= \u6307\u5b9a\u30d7\u30ed\u30bb\u30b9\u306e\u5b9f\u88c5\u30b3\u30fc\u30c9\u3092\u30ed\u30fc\u30c9\u3067\u304d\u307e\u305b\u3093 \uff0d {0}\u3002
SRE0039= \u30d7\u30ed\u30bb\u30b9 {1} \u306b\u6307\u5b9a\u3055\u308c\u305f\u30a2\u30af\u30b7\u30e7\u30f3\u30b0\u30eb\u30fc\u30d7\u30bb\u30c3\u30c8{0} \u306f\u672a\u5b8c\u4e86\u306a\u306e\u3067\u3001CREATE_AND_SAVE_ACTIONS \u307e\u305f\u306f CREATE_ACTIONS_ONLY \u30a2\u30af\u30b7\u30e7\u30f3\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u8981\u6c42\u7d4c\u7531\u3067\u518d\u5ea6\u4f5c\u6210\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
SRE0040= \u30b8\u30e7\u30d6 {0} \u304c\u6700\u4f4e\u306e\u512a\u5148\u9806\u4f4d\u306b\u5230\u9054\u3057\u307e\u3057\u305f
SRE0041= \u30b8\u30e7\u30d6 {0} \u304c\u6700\u9ad8\u306e\u512a\u5148\u9806\u4f4d\u306b\u5230\u9054\u3057\u307e\u3057\u305f\u3002
SRE0042= InterfaceGroupName [{0}] \u306b\u3064\u3044\u3066\u3001\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306f\u65e2\u306b\u30e6\u30fc\u30b6\u306b\u3088\u3063\u3066\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002
SRE0043= \u6307\u5b9a\u30d7\u30ed\u30bb\u30b9 {0} \u3067\u306f\u3001\u30a2\u30af\u30b7\u30e7\u30f3\u30e9\u30a4\u30d5\u30b5\u30a4\u30af\u30eb\u304c\u8981\u6c42\u3059\u308b\u30a2\u30af\u30b7\u30e7\u30f3\u306e\u307f\u3092\u4f5c\u6210\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002

# Status Messages
SRE2000= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u30ce\u30fc\u30c9\u306e\u5272\u5f53\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2001= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u30b8\u30e7\u30d6\u306e\u6e96\u5099\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2002= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u30a2\u30af\u30b7\u30e7\u30f3\u306e\u6e96\u5099\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2003= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u51e6\u7406\u4e2d\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2004= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u30ad\u30e3\u30f3\u30bb\u30eb\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2005= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u7d42\u4e86\u51e6\u7406\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2006= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u7d42\u4e86\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2007= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u5931\u6557\u306e\u305f\u3081\u306b\u30ea\u30bb\u30c3\u30c8\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2008= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u30b8\u30e7\u30d6\u306e\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002
SRE2009= \u30b8\u30e7\u30d6\u306e\u72b6\u614b\u304c\u5272\u5f53\u306e\u5f85\u6a5f\u306b\u9077\u79fb\u3057\u307e\u3057\u305f\u3002

# Log Messages
SRE3000=

# Batch Utility Error Messages
Batch.Usage= \u4f7f\u7528\u65b9\u6cd5\uff1a SREBatchUtility [-validateOnly] [-user <\u30e6\u30fc\u30b6>] -credentials <\u8a8d\u8a3c\u60c5\u5831\u30d5\u30a1\u30a4\u30eb> <\u30ea\u30af\u30a8\u30b9\u30c8 XML \u30d5\u30a1\u30a4\u30eb>

# Batch Utility Error Messages
Batch.AuthenticationError= \u30e6\u30fc\u30b6\u8a8d\u8a3c\u30a8\u30e9\u30fc - {0}\u3002
Batch.BadUserName= \u8a8d\u8a3c\u60c5\u5831\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306e\u30e6\u30fc\u30b6\u540d\u89e3\u6790\u30a8\u30e9\u30fc - {0}\u3002
Batch.BadUserPassword= \u8a8d\u8a3c\u60c5\u5831\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306e\u30e6\u30fc\u30b6\u30d1\u30b9\u30ef\u30fc\u30c9\u89e3\u6790\u30a8\u30e9\u30fc - {0}\u3002
Batch.BadUserInfo = \u30e6\u30fc\u30b6\u306e\u8a8d\u8a3c\u60c5\u5831\u306e\u30ed\u30fc\u30c9\u30a8\u30e9\u30fc - {0}\u3002
Batch.BadCredentialsFile= \u8a8d\u8a3c\u60c5\u5831\u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u306e\u30aa\u30fc\u30d7\u30f3\u30a8\u30e9\u30fc - {0}\u3002
Batch.ParseError= \u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a1\u30a4\u30eb\u89e3\u6790\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f - {0}\u3002
Batch.LogFileError= \u30ed\u30b0\u30d5\u30a1\u30a4\u30eb\u3092\u958b\u3051\u307e\u305b\u3093 - {0}\u3002
Batch.XMLParseException= {0} \u884c {1} \u5217\u306b XML \u89e3\u6790\u30a8\u30e9\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u3057\u305f\n  {2}


# Batch Utility Informational Messages
Batch.ValidRequest= \u30ea\u30af\u30a8\u30b9\u30c8\u30d5\u30a1\u30a4\u30eb\u306e\u89e3\u6790\u306b\u30a8\u30e9\u30fc\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f - {0}\u3002


# Validation Messages
Validation.CharacterValidationError=\u5165\u529b\u3057\u305f\u5024 {0} \u306b\u7121\u52b9\u306a\u6587\u5b57\uff1a {1} \u304c\u3042\u308a\u307e\u3059\u3002
Validation.FieldValidationError=\u7121\u52b9\u306a\u6587\u5b57\uff1a {0}\u3002
Validation.RequiredOptionsMissingError=\u30d7\u30ed\u30bb\u30b9\u306b\u5fc5\u9808\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u304c\u3059\u3079\u3066\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
Validation.InvalidValuesforOptionError=\u30aa\u30d7\u30b7\u30e7\u30f3\u306b\u7121\u52b9\u306a\u5024\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\uff1a {0}\u3002
Validation.InvalidOptionError=\u7121\u52b9\u306a\u30aa\u30d7\u30b7\u30e7\u30f3\uff1a {0}\u3002

#Batch Information Messages
Batch.info.JobDescription=\u30b8\u30e7\u30d6\u306e\u8aac\u660e
Batch.info.JobId=\u30b8\u30e7\u30d6 ID
Batch.info.ServiceName=\u30b5\u30fc\u30d3\u30b9\u540d
Batch.info.NodeConfig=\u30ce\u30fc\u30c9\u8a2d\u5b9a

SS6001=\u30ed\u30fc\u30eb {0} \u306f\u3001\u30d7\u30fc\u30eb {2} \u306e\u30b5\u30fc\u30d3\u30b9 {1} \u306e\u5358\u4e00\u30ce\u30fc\u30c9\u306e\u69cb\u6210\u306b\u306e\u307f\u5272\u308a\u5f53\u3066\u304c\u53ef\u80fd\u3067\u3059\u3002

# Job Summary Extension
JobSummaryExtension.NumberOfActions = \u30a2\u30af\u30b7\u30e7\u30f3\u6570\uff1a

