# Main resource bundle for SRE exceptions, status messages,
# and log messages
#
# Error Messages
SRE0000= Excepci\u00f3n de sistema desconocida - {0}.
SRE0001= Error al recuperar servicio de inicio - {0}.
SRE0002= Error al recuperar servicio de estado - {0}.
SRE0003= Error al recuperar servicio de configuraci\u00f3n - {0}.
SRE0004= Error al recuperar servicio de administraci\u00f3n - {0}.
SRE0005= Error al recuperar servicio de opciones - {0}.
SRE0006= Falta el nombre del conjunto de grupos de acciones.
SRE0007= Error al recuperar el conjunto de grupos de acciones - {0}.
SRE0008= No se ha encontrado ninguna configuraci\u00f3n de nodo predeterminada para el proceso - {0}.
SRE0009= Se han detectado errores al intentar ejecutar la cadena de trabajos - {0}. Revise el archivo de registro para obtener m\u00e1s detalles.
SRE0010= Se han detectado errores en relaci\u00f3n con el paso {0} de la cadena de trabajos {1}.
SRE0011= No se dispone de permisos suficientes para crear un conjunto de opciones para el proceso - {0}.
SRE0012= No se dispone de permisos suficientes para suprimir el conjunto de opciones del proceso - {0}.
SRE0013= No se dispone de permisos suficientes para actualizar el conjunto de opciones del proceso - {0}.
SRE0014= {0} no dispone de permiso para cancelar el trabajo {1}.
SRE0015= No se pudo vincular el objeto remoto al registro RMI - {0}.
SRE0016= No se pudo desvincular el objeto remoto del registro RMI - {0}.
SRE0017= Se han producido varios errores de llamada remota en InterfaceGroupName [{0}].
SRE0018= Excepci\u00f3n de objeto no encontrado en InterfaceGroupName [{0}].
SRE0019= El conjunto de opciones especificado {0}, para el proceso {1} no existe o el usuario no dispone de los permisos de acceso necesarios.
SRE0020= El proceso especificado {0} no existe.
SRE0021= La configuraci\u00f3n de nodo especificada {0} para el proceso {1} no existe.
SRE0022= La b\u00fasqueda especificada {0} no es v\u00e1lida. Compruebe que el nombre de empresa es v\u00e1lido.
SRE0023= {0} no dispone de permiso para suprimir el trabajo {1}.
SRE0024= No se pudo cancelar el trabajo {0}. Es posible que el trabajo ya se haya finalizado o que no sea el trabajo actual en una cadena de trabajos.
SRE0025= No se pudo aumentar la prioridad en el trabajo {0}. Es posible que el trabajo ya no est\u00e9 en estado de asignaci\u00f3n de nodos.
SRE0026= No se pudo reducir la prioridad en el trabajo {0}. Es posible que el trabajo ya no est\u00e9 en estado de asignaci\u00f3n de nodos.
SRE0027= No se pudo realizar la operaci\u00f3n en el trabajo {0}. Es posible que el trabajo ya est\u00e9 finalizado.
SRE0028= No se pudo suprimir trabajos en este momento. Todav\u00eda hay trabajos que est\u00e1n en proceso de ser limpiados.
SRE0029= El conjunto de opciones p\u00fablico especificado, establecido en {0}, para el proceso {1}, empresa {2}, no existe o bien el usuario no dispone del permiso de acceso suficiente.
SRE0030= El conjunto de opciones privado especificado, establecido en {0}, para el proceso {1}, empresa {2}, no existe o bien el usuario no dispone del permiso de acceso suficiente.
SRE0031= El permiso para actualizar el grupo de nodos y asignar procesos es insuficiente.
SRE0032= El permiso para crear el grupo de nodos y asignar procesos es insuficiente.
SRE0033= No se pudo cerrar el grupo de nodos {0}. Puede que el grupo de nodos no se est\u00e9 ejecutando.
SRE0034= No se pudo validar el objeto remoto del registro RMI - {0}.
SRE0035= El proceso especificado {0} es un proceso interno que no se puede invocar como proceso por lotes.
SRE0036= No tiene el permiso necesario para poder aumentar o reducir la prioridad de un trabajo.
SRE0037= {0} del proceso especificado no admite las solicitudes de ciclo de vida de acci\u00f3n hechas.
SRE0038= No se pudo cargar el c\u00f3digo de implementaci\u00f3n para el proceso especificado - {0}.
SRE0039= {0} de conjunto grupo acci\u00f3n especificado para {1} de proceso es incompleto(a) y se debe volver a crear a trav\u00e9s de la solicitud de ciclo de vida de acci\u00f3n CREATE_AND_SAVE_ACTIONS o CREATE_ACTIONS_ONLY.
SRE0040= Se ha alcanzado el l\u00edmite de prioridad m\u00ednimo en el trabajo {0}.
SRE0041= Se ha alcanzado el l\u00edmite de prioridad m\u00e1ximo en el trabajo {0}.
SRE0042= El objeto ya fue bloqueado por el usuario para InterfaceGroupName [{0}].
SRE0043= {0} del proceso especificado no admite solicitudes de ciclo de vida de acci\u00f3n del tipo Crear s\u00f3lo acciones.

# Status Messages
SRE2000= El estado del trabajo ha cambiado a Asignando nodos.
SRE2001= El estado del trabajo ha cambiado a Preparando trabajo.
SRE2002= El estado del trabajo ha cambiado a Preparando acciones.
SRE2003= El estado del trabajo ha cambiado a Procesar.
SRE2004= El estado del trabajo ha cambiado a Cancelando.
SRE2005= El estado del trabajo ha cambiado a Procesamiento final.
SRE2006= El estado del trabajo ha cambiado a Finalizado.
SRE2007= El estado del trabajo ha cambiado a Restableciendo debido a un error.
SRE2008= El estado del trabajo ha cambiado a Cerrando trabajo.
SRE2009= El estado del trabajo ha cambiado a En espera de asignaci\u00f3n.

# Log Messages
SRE3000=

# Batch Utility Error Messages
Batch.Usage= Uso: SREBatchUtility [-validateOnly] [-user <usuario>] -credentials <credenciales> <solicitararchivoXML>

# Batch Utility Error Messages
Batch.AuthenticationError= Error al autenticar el usuario - {0}.
Batch.BadUserName= Error al analizar el nombre de usuario del archivo de propiedades de credenciales - {0}.
Batch.BadUserPassword= Error al analizar la contrase\u00f1a del archivo de propiedades de credenciales - {0}.
Batch.BadUserInfo = Error al cargar informaci\u00f3n de identidad para el usuario - {0}.
Batch.BadCredentialsFile= Error al abrir el archivo de propiedades de credenciales - {0}.
Batch.ParseError= Errores al analizar el archivo de solicitud - {0}.
Batch.LogFileError= No se pudo abrir el archivo de registro - {0}.
Batch.XMLParseException= Error de an\u00e1lisis XML detectado en la l\u00ednea {0}, columna {1}\n  {2}


# Batch Utility Informational Messages
Batch.ValidRequest= No se ha producido ning\u00fan error al analizar el archivo de solicitud - {0}.


# Validation Messages
Validation.CharacterValidationError=Uno de los valores introducidos, {0}, contiene un car\u00e1cter no v\u00e1lido: {1}.
Validation.FieldValidationError=Car\u00e1cter no v\u00e1lido: {0}.
Validation.RequiredOptionsMissingError=No se han especificado todas las opciones necesarias para el proceso.
Validation.InvalidValuesforOptionError=Se han especificado valores no v\u00e1lidos para la opci\u00f3n: {0}.
Validation.InvalidOptionError=Opci\u00f3n no v\u00e1lida: {0}.

#Batch Information Messages
Batch.info.JobDescription=Descripci\u00f3n del trabajo
Batch.info.JobId=Ide. de trabajo
Batch.info.ServiceName=Nombre de servicio
Batch.info.NodeConfig=Config. de nodo

SS6001=Las funciones {0} s\u00f3lo se pueden asignar a una configuraci\u00f3n de servicio de nodo individual {1} en grupo {2}.

# Job Summary Extension
JobSummaryExtension.NumberOfActions = N\u00famero de acciones:

