# Main resource bundle for SRE exceptions, status messages,
# and log messages
#
# Error Messages
SRE0000= Exce\u00e7\u00e3o do sistema desconhecida - {0}.
SRE0001= Erro ao recuperar o servi\u00e7o de lan\u00e7amento - {0}.
SRE0002= Erro ao recuperar o servi\u00e7o do status - {0}.
SRE0003= Erro ao recuperar o servi\u00e7o de configura\u00e7\u00e3o - {0}.
SRE0004= Erro ao recuperar o servi\u00e7o de gerenciamento - {0}.
SRE0005= Erro ao recuperar o servi\u00e7o de op\u00e7\u00f5es - {0}.
SRE0006= Nome do conjunto do grupo de a\u00e7\u00f5es ausente.
SRE0007= Erro ao recuperar o conjunto do grupo de a\u00e7\u00f5es - {0}.
SRE0008= Nenhuma configura\u00e7\u00e3o de n\u00f3 padr\u00e3o encontrada para o processo - {0}.
SRE0009= Erros detectados ao tentar executar cadeia de trabalho - {0}. Verifique o arquivo de registro para obter mais detalhes.
SRE0010= Erros detectados para a etapa {0} da cadeia de trabalho {1}.
SRE0011= Permiss\u00f5es insuficientes para criar o conjunto de op\u00e7\u00f5es para o processo - {0}.
SRE0012= Permiss\u00f5es insuficientes para excluir o conjunto de op\u00e7\u00f5es para o processo - {0}.
SRE0013= Permiss\u00f5es insuficientes para atualizar o conjunto de op\u00e7\u00f5es para o processo - {0}.
SRE0014= {0} n\u00e3o tem permiss\u00e3o para cancelar o trabalho {1}.
SRE0015= N\u00e3o \u00e9 poss\u00edvel vincular o objeto remoto ao registro RMI - {0}.
SRE0016= N\u00e3o \u00e9 poss\u00edvel desvincular o objeto remoto do registro RMI - {0}.
SRE0017= Falhas de chamadas remotas repetidas no InterfaceGroupName [{0}].
SRE0018= Nenhum objeto encontrou exce\u00e7\u00e3o no InterfaceGroupName [{0}].
SRE0019= O conjunto de op\u00e7\u00f5es {0} especificado para o processo {1} n\u00e3o existe ou o usu\u00e1rio tem permiss\u00e3o de acesso insuficiente.
SRE0020= O processo {0} especificado n\u00e3o existe.
SRE0021= A configura\u00e7\u00e3o de n\u00f3 {0} especificada para o processo {1} n\u00e3o existe.
SRE0022= A pesquisa {0} especificada \u00e9 inv\u00e1lida. Verifique se o nome da empresa \u00e9 v\u00e1lido.
SRE0023= {0} n\u00e3o tem permiss\u00e3o para excluir o trabalho {1}.
SRE0024= N\u00e3o \u00e9 poss\u00edvel cancelar o trabalho {0}. O trabalho pode j\u00e1 estar conclu\u00eddo ou n\u00e3o \u00e9 o trabalho atual em uma cadeia de trabalho.
SRE0025= N\u00e3o \u00e9 poss\u00edvel aumentar a prioridade no trabalho {0}. O trabalho pode n\u00e3o estar mais no estado Atribuindo N\u00f3s.
SRE0026= N\u00e3o \u00e9 poss\u00edvel baixar a prioridade no trabalho {0}. O trabalho pode n\u00e3o estar mais no estado Atribuindo N\u00f3s.
SRE0027= N\u00e3o \u00e9 poss\u00edvel executar a opera\u00e7\u00e3o no trabalho {0}. O trabalho j\u00e1 pode estar conclu\u00eddo.
SRE0028= N\u00e3o \u00e9 poss\u00edvel excluir o(s) trabalho(s) no momento. O(s) trabalho(s) ainda est\u00e1(\u00e3o) sendo limpo(s).
SRE0029= O conjunto de op\u00e7\u00f5es p\u00fablicas {0} especificadas para o processo {1}, empresa {2} n\u00e3o existe ou o usu\u00e1rio tem permiss\u00e3o de acesso insuficiente.
SRE0030= O conjunto de op\u00e7\u00f5es privadas {0} especificadas para o processo {1}, empresa {2} n\u00e3o existe ou o usu\u00e1rio tem permiss\u00e3o de acesso insuficiente.
SRE0031= Permiss\u00f5es insuficientes para atualizar o pool de n\u00f3s e atribuir processos.
SRE0032= Permiss\u00f5es insuficientes para criar o pool de n\u00f3s e atribuir processos.
SRE0033= N\u00e3o \u00e9 poss\u00edvel desligar o pool de n\u00f3s {0}. O pool de n\u00f3s pode n\u00e3o estar sendo executado.
SRE0034= N\u00e3o \u00e9 poss\u00edvel validar o objeto remoto do registro RMI - {0}.
SRE0035= O processo {0} especificado \u00e9 um processo interno e n\u00e3o pode ser invocado como um processo em lote.
SRE0036= Permiss\u00f5es insuficientes para aumentar ou diminuir a prioridade dos trabalhos.
SRE0037= Os processos {0} especificados n\u00e3o aceitam pedidos de ciclo de vida de a\u00e7\u00e3o.
SRE0038= N\u00e3o \u00e9 poss\u00edvel carregar o c\u00f3digo de implementa\u00e7\u00e3o para o processo especificado - {0}.
SRE0039= O conjunto do grupo de a\u00e7\u00f5es {0} especificado para o processo {1} est\u00e1 incompleto e deve ser recriado por meio do pedido de ciclo de vida de a\u00e7\u00f5es CREATE_AND_SAVE_ACTIONS ou CREATE_ACTIONS_ONLY.
SRE0040= O limite m\u00ednimo priorit\u00e1rio foi atingido no trabalho {0}.
SRE0041= O limite m\u00e1ximo priorit\u00e1rio foi atingido no trabalho {0}.
SRE0042= Objeto j\u00e1 bloqueado pelo usu\u00e1rio para InterfaceGroupName [{0}].
SRE0043= O processo {0} especificado n\u00e3o suporta pedidos de ciclo de vida de a\u00e7\u00e3o de criar a\u00e7\u00f5es somente.

# Status Messages
SRE2000= Estado do trabalho alterado para Atribuindo N\u00f3s.
SRE2001= Estado do trabalho alterado para Preparando Trabalho.
SRE2002= Estado do trabalho alterado para Preparando A\u00e7\u00f5es.
SRE2003= Estado do trabalho alterado para Processando.
SRE2004= Estado do trabalho alterado para Cancelando.
SRE2005= Estado do trabalho alterado para Processamento Final.
SRE2006= Estado do trabalho alterado para Conclu\u00eddo.
SRE2007= Estado do trabalho alterado para Redefinindo devido a falha.
SRE2008= Estado do trabalho alterado para Desligando o trabalho.
SRE2009= Estado do trabalho alterado para Aguardando atribui\u00e7\u00e3o.

# Log Messages
SRE3000=

# Batch Utility Error Messages
Batch.Usage= Uso: SREBatchUtility [-validateOnly] [-user <user>] -credentials <credentials> <requestXMLFile>

# Batch Utility Error Messages
Batch.AuthenticationError= Erro na autentica\u00e7\u00e3o do usu\u00e1rio - {0}.
Batch.BadUserName= Erro ao analisar o nome do usu\u00e1rio a partir do arquivo de propriedades das credenciais - {0}.
Batch.BadUserPassword= Erro ao analisar a senha a partir do arquivo de propriedades das credenciais - {0}.
Batch.BadUserInfo = Erro ao carregar informa\u00e7\u00f5es de identidade para o usu\u00e1rio - {0}.
Batch.BadCredentialsFile= Erro ao abrir o arquivo de propriedades das credenciais - {0}.
Batch.ParseError= Erros encontrados ao analisar o arquivo de solicita\u00e7\u00e3o - {0}.
Batch.LogFileError= N\u00e3o \u00e9 poss\u00edvel abrir o arquivo de log - {0}.
Batch.XMLParseException= Erro de an\u00e1lise XML detectado na linha {0}, coluna {1}\n  {2}


# Batch Utility Informational Messages
Batch.ValidRequest= Nenhum erro encontrado durante a an\u00e1lise do arquivo solicitado - {0}.


# Validation Messages
Validation.CharacterValidationError=Um dos valores que voc\u00ea inseriu, {0}, cont\u00e9m um caractere inv\u00e1lido: {1}.
Validation.FieldValidationError=Caractere inv\u00e1lido: {0}.
Validation.RequiredOptionsMissingError=Todas as op\u00e7\u00f5es necess\u00e1rias para o processo n\u00e3o foram especificadas.
Validation.InvalidValuesforOptionError=Valores inv\u00e1lidos especificados para a op\u00e7\u00e3o: {0}.
Validation.InvalidOptionError=Op\u00e7\u00e3o inv\u00e1lida: {0}.

#Batch Information Messages
Batch.info.JobDescription=Descri\u00e7\u00e3o do Trabalho
Batch.info.JobId=ID do Trabalho
Batch.info.ServiceName=Nome do Servi\u00e7o
Batch.info.NodeConfig=Configura\u00e7\u00e3o do N\u00f3

SS6001=A(s) fun\u00e7\u00e3o(\u00f5es) {0} s\u00f3 pode(m) ser atribu\u00edda(s) a uma s\u00f3 configura\u00e7\u00e3o de n\u00f3 do servi\u00e7o {1} no pool {2}.

# Job Summary Extension
JobSummaryExtension.NumberOfActions = N\u00famero de a\u00e7\u00f5es:

