###############################################################################
# Resource Bundle for Strategy
###############################################################################

###############################################################################
# Process Options
###############################################################################
YES_VALUE_KEY = S\u00ed
REFINE_CONFLICT_KEY= Informe sobre inviabilidad
NO_VALUE_KEY = No
OBJECTIVE_KEY = Objetivo
OBJECTIVE_VALUES_MIN_COST_KEY = Minimizar coste
OBJECTIVE_VALUES_MAX_PROFIT_KEY = Maximizar beneficio
SKUS_TO_PROCESS_KEY = Las UDA para procesar
SKUS_TO_PROCESS_VALUES_DATA_SEL_ONLY_KEY = S\u00f3lo selecci\u00f3n de datos del plan
SKUS_TO_PROCESS_VALUES_ALL_RELATED_KEY = Planificar todos los relacionados
DEFAULT_CURRENCY_UOM_KEY = Divisa para optimizaci\u00f3n
CALENDAR_START_DATE_KEY = Fecha de inicio
CALENDAR_END_DATE_KEY = Fecha final
REPORTING_CALENDAR_NAME_KEY = Nombre de calendario
OTHER_SETUP_OPTIONS_KEY = Opciones adicionales
OTHER_SETUP_OPTIONS_VALUES_CHECK_WARN_KEY = Comprobar advertencias
MIP_FEATURES_KEY = Caracter\u00edsticas MIP
MIP_FEATURES_VALUES_MAX_SRC_KEY = Suministro m\u00e1x.
MIP_FEATURES_VALUES_MIN_SRC_KEY = Suministro m\u00edn.
MIP_FEATURES_VALUES_TIERED_KEY = Valores estructurados
MIP_FEATURES_VALUES_SETUPS_KEY = Configuraci\u00f3n
INV_CAPITAL_COSTS_KEY = Coste financiero del inventario
INV_CAPITAL_COSTS_VALUES_ON_HAND_KEY = Existencias actuales
INV_CAPITAL_COSTS_VALUES_WIP_KEY = Trabajos en curso
INV_CAPITAL_COSTS_VALUES_BUY_KEY = Compra
INV_CAPITAL_COSTS_VALUES_SELL_KEY = Vender
INV_CAPITAL_COSTS_VALUES_MOVE_KEY = Mover
RUN_PREPROCESSOR_ONLY_KEY = Run preprocessor only
STARTING_CONDITION_KEY = Condici\u00f3n inicial
STARTING_CONDITION_VALUES_WARM_KEY = Tibio
STARTING_CONDITION_VALUES_COLD_KEY = Fr\u00edo
ROOT_ALGORITHM_KEY = Algoritmo ra\u00edz
Primal = Primario
Dual = Doble
Network = Red
Barrier = Barrera
NODE_ALGORITHM_KEY = Algoritmo de nodo
TIME_LIMIT_UNITS_KEY = L\u00edmite de tiempo

USE_MIP_STARTING_VALUES_KEY = Utilice los valores iniciales MIP
NODE_SELECT_KEY = Estrategia de selecci\u00f3n de nodos
DFS = B\u00fasqueda en profundidad prioritaria
BestBound = B\u00fasqueda del mejor l\u00edmite
BestEst = B\u00fasqueda de estimaci\u00f3n \u00f3ptima
BestEstAlt = B\u00fasqueda de estimaci\u00f3n \u00f3ptima alternativa
MIP_EMPHASIS_KEY = Prioridad MIP
Optimality = Optimalidad
Feasibility = Viabilidad
Balanced = Equilibrado
BestBound = Mejor l\u00edmite
HiddenFeas = Viabilidad oculta
RELATIVE_TOLERANCE_KEY = Tolerancia relativa
UPPER_BOUND_KEY = L\u00edmite superior

SENSITIVITY_REPORTS_KEY = Informe de sensibilidad
SENSITIVITY_REPORTS_VALUES_MPS_KEY = Precio marginal e Infrautilizaci\u00f3n
SENSITIVITY_REPORTS_VALUES_RC_KEY = Coste reducido
SENSITIVITY_REPORTS_VALUES_OCSA_KEY = An\u00e1lisis del coeficiente objetivo


# Process Names
ScpoFunction.400 = Production and Sourcing Optimization
SCPOWeb.Strategy = Optimizar cadena de suministro
SCPOWeb.WriteProjections=Guardar proyecciones y estad\u00edsticas
RunProcessLaunch.ChooseOptionSelection=Elegir conjunto de opciones

# Remove these after we switch to the new process launch templates
Icon.Delete=Suprimir
Icon.New=Nueva
Icon.Done=Terminar
Icon.Cancel=Cancelar
Icon.Remove=Eliminar
Icon.Add=Agregar

# Tab names
SETUP = Configurar
OPTIMIZATION = Optimizaci\u00f3n
MIP_STRATEGY = Estrategia MIP
ADVANCED = Avanzado

Options.Advanced.Editor = Editor avanzado de opciones
Options.Advanced.OptionName = Opciones
Options.Advanced.OptionValue = Valor
Options.Advanced.NewOption = Nueva opci\u00f3n
ProcessOption.DataSelectionListHeading=Ninguna b\u00fasqueda

#Alerts from RunProcessLaunch page
RunProcessLaunch.SelectDataSelectionAlert=Seleccione b\u00fasqueda antes de ejecutar proceso.
RunProcessLaunch.DataSelectionUnspecifedAlert=B\u00fasqueda no especificada.

# Validation Errors

Options.Error = Corrija todos los errores resaltados en rojo.
Options.Loading.Error = Error al cargar las opciones del proceso para el conjunto de opciones especificado. Si desea m\u00e1s informaci\u00f3n, consulte el registro.
Options.Error.RelativeTolerance = El valor debe estar entre 0 y 1
Options.Error.UpperBound = El valor debe ser mayor o igual a 0
Options.Error.PositiveInteger = El valor debe ser un n\u00famero entero mayor o igual a 0
Options.Error.AlreadyExists = El nombre del conjunto de opciones ya existe

#
# Migration error messages
#
Migration.Usage = StrategyMigrate [-umcategories <archivo_categor\u00eda> -umunits <archivo_unidades> -umratio <archivo_relaci\u00f3n> -delimiter <caracter delimitador>] [-truncate] <ArchivoEntrada>
Migration.NotEnoughArguments = No hay suficientes argumentos.  Se debe proporcionar el archivo unidad-de-medidas o el archivo de exportaci\u00f3n 6.2.
Migration.TooManyArguments = Demasiados argumentos.
Migration.RequiresArgument = {0} requiere un argumento.
Migration.NullUOMRatioFile = No se pudo  migrar las unidades-de-medida; falta el archivo de relaci\u00f3n.
Migration.NullUOMUnitsFile = No se pudo  migrar las unidades-de-medida; falta el archivo de unidades.
Migration.NullUOMCategoryFile = No se pudo migrar las unidades-de-medida; falta el archivo de categor\u00edas.
Migration.SpecifyAllUOMFiles = Para migrar las unidades-de-medida, debe especificar un archivo de categor\u00edas, un archivo de unidades y un archivo de relaci\u00f3n.
Migration.UnrecognizedOption = Opci\u00f3n no reconocida: {0}
Migration.FileNotFoundError = No se encontr\u00f3 el archivo: {0}
Migration.FileOpenError = Error al abrir el archivo: {0}
Migration.BeginTruncation = Truncando datos existentes...
Migration.BeginMigrateUnits = Migrando las categor\u00edas UdM y las UdM...
Migration.CreateTieredCost = Se est\u00e1n creando costes y precios estructurados
Migration.CreateItems = Se est\u00e1n creando art\u00edculos
Migration.CreateLanes = Se est\u00e1n creando rutas
Migration.CreateLocations = Se est\u00e1n creando ubicaciones
Migration.CreateMakeProcesses = Se est\u00e1n creando procesos de elaboraci\u00f3n
Migration.MakeProcessCount = Creados {0} procesos de elaboraci\u00f3n
Migration.CreateMoveProcesses = Se est\u00e1n creando procesos de movimiento
Migration.MoveProcessCount = Crear {0} procesos de movimiento
Migration.CreateNamedCalendars = Se est\u00e1n creando calendarios identificados
Migration.CreatePurchaseProcesses = Se est\u00e1n creando procesos de compra
Migration.PurchaseProcessCount = Creados {0} procesos de compra
Migration.CreateResources = Se est\u00e1n creando recursos reutilizables
Migration.ResourceCount = Creados {0} recursos reutilizables
Migration.ResourceRequirement = Se est\u00e1n creando requisitos de recursos
Migration.ResourceReqtCount = Creados {0} requisitos de recursos
Migration.ServiceLevels = Se est\u00e1n creando grupos de limitaci\u00f3n de entrega de tiempo de espera de grupos de nivel de servicio
Migration.SKUFirstPass = Se est\u00e1n creando UDA
Migration.SKUSecondPass = Actualizar las UDA
Migration.InsertSKUCount = Creadas {0} UDA
Migration.UpdateSKUCount = Actualizadas {0} UDA
Migration.CreateSKUReqt = Se est\u00e1n creando requisitos de UDA
Migration.SourcingGroupFirstPass = Se est\u00e1n creando grupos de suministro
Migration.SourcingGroupSecondPass = Actualizar grupos de suministro
Migration.InsertSourcingGroupsCount = Creados {0} grupos de suministro
Migration.UpdateSourcingGroupsCount = Actualizados {0} grupos de suministro
Migration.FatalError = Se ha producido un error fatal al intentar la migraci\u00f3n, compruebe los detalles en el archivo de registro.
Migration.FormatError = Error de formato del archivo introducido, se esperaba el inicio de la secci\u00f3n de clase pero no se encontr\u00f3.
Migration.ErrorLineNumber = Error en la l\u00ednea {0}
Migration.CreateUOMCategories = Se est\u00e1n creando categor\u00edas de unidad de medida
Migration.UOMCategoryCount = Creadas {0} categor\u00edas de unidad de medida
Migration.CreateUOM = Se est\u00e1n creando unidades de medida
Migration.UOMCount = Creadas {0} unidades de medida
Migration.CreateUOMRatios = Se est\u00e1n creando conversiones de unidad de medida
Migration.UOMRatioCount = Creadas {0} conversiones de unidad de medida
Migration.Seconds = segundos.

#User preferences
StrategySettings.title=Configuraci\u00f3n de PSO
StrategySettings.subTitle=Configuraci\u00f3n de UdM predeterminada
rbIdTime=UDM de tiempo predeterminado
rbIdCurrency=UdM de divisa predeterminada
rbIdPercentage=UDM del porcentaje predeterminado
rbIdRes=UDM predeterminada del recurso
rbIdSku=UDM predeterminada de la UDA
UOMCategory=Categor\u00eda de UdM:
UOM=UdM:

#General messages
Validation.ErrorsEncountered = Errores en la red.  Cesar\u00e1 el procesamiento.
Validation.RunPreprocessorOnly = Ha terminado el procesamiento previo del modelo.  El procesamiento cesar\u00e1 a petici\u00f3n del usuario.

#Calendars
Validation.NoCalIntervals = El calendario {0} no tiene intervalos.
Validation.NoCalendar = El calendario de planificaci\u00f3n es nulo.

# Model Validation messages - try to keep sorted
Validation.BomUomMissing = Falta la UDM de la cantidad para un LDM.
Validation.BomDrawZero = La cantidad descontada de consumo de la LDM es cero en algunos per\u00edodos.
Validation.Loc_Cost_Invalid_UOM = El coste de ubicaci\u00f3n UDMCantid no es v\u00e1lido para la ubicaci\u00f3n {0}
Validation.Loc_Cost_Zero_UOM = El coste de ubicaci\u00f3n UDMCantid es cero para la ubicaci\u00f3n {0}. La UDM predeterminada se considera como a\u00f1o
Validation.Resource_UOM = Falta la UDM del recurso o no est\u00e1 activado el recurso o su ubicaci\u00f3n. El recurso no se considerar\u00e1 para la planificaci\u00f3n
Validation.SKU_Missing_UOM_Enable = Falta la UDM de la UDA o no est\u00e1 activada la UDA o su ubicaci\u00f3n. La UDA no se considerar\u00e1 para la planificaci\u00f3n

#Resources
Validation.FirstRampDownBucket = Se ha especificado un valor en el primer per\u00edodo de tiempo descendente.  Este valor se ignorar\u00e1.
Validation.FirstRampUpBucket = Se ha especificado un valor en el primer per\u00edodo de tiempo ascendente.  Este valor se ignorar\u00e1.
Validation.MaxCapacityNegative = La capacidad m\u00e1xima es menor que cero en por lo menos un intervalo del calendario.
Validation.MinCapacityNegative = La capacidad m\u00ednima es menor que cero en por lo menos un intervalo del calendario.
Validation.RampDownNegative = El valor descendente es menor que cero en por lo menos un intervalo del calendario.
Validation.RampUpNegative = El valor ascendente es menor que cero en por lo menos un intervalo del calendario.
Validation.ResConstraintUOMMissing = La limitaci\u00f3n del recurso no tiene una UDM seleccionada.
Validation.ResCostCurrencyUOMConversion = No se pudo convertir la UDM de la divisa del coste a la UDM de la divisa predeterminada del recurso.
Validation.ResCostQtyUOMConversion = No se pudo convertir la UDM de la penalizaci\u00f3n de la cantidad del coste a la UDM de la cantidad predeterminada del recurso.
Validation.ResMaxCapacityPenaltyCurrencyUOMConversion = No se pudo convertir la UDM de penalizaci\u00f3n de la divisa de la capacidad m\u00e1xima a la UDM de la divisa predeterminada del recurso.
Validation.ResMaxCapacityPenaltyQtyUOMConversion = No se pudo convertir la UDM de la penalizaci\u00f3n de la cantidad de la capacidad m\u00e1xima a la UDM de la cantidad predeterminada del recurso.
Validation.ResMinCapacityPenaltyCurrencyUOMConversion = No se pudo convertir la UDM de la divisa de la penalizaci\u00f3n de la capacidad m\u00ednima a la UDM de la divisa predeterminada del recurso.
Validation.ResMinCapacityPenaltyQtyUOMConversion = No se pudo convertir la UDM de la penalizaci\u00f3n de la cantidad de la capacidad m\u00ednima a la UDM de la cantidad predeterminada del recurso.
Validation.ResRampDownPenaltyCurrencyUOMConversion = No se pudo convertir la UDM de la penalizaci\u00f3n de la divisa descendente a la UDM de la divisa predeterminada del recurso.
Validation.ResRampDownPenaltyQtyUOMConversion = No se pudo convertir la UDM de la penalizaci\u00f3n de la cantidad descendente a la UDM de la cantidad predeterminada del recurso.
Validation.ResRampUpPenaltyCurrencyUOMConversion = No se pudo convertir la UDM de la penalizaci\u00f3n de la divisa ascendente a la UDM de la divisa predeterminada del recurso.
Validation.ResRampUpPenaltyQtyUOMConversion = No se pudo convertir la UDM de la penalizaci\u00f3n de la cantidad ascendente a la UDM de la cantidad predeterminada del recurso.
Validation.ResUOMMaxCapacityConversion = No se pudo convertir la UDM de la capacidad m\u00e1xima del recurso a la UDM predeterminada del recurso.
Validation.ResUOMMinCapacityConversion = No se pudo convertir la UDM de la capacidad m\u00ednima del recurso a la UDM predeterminada del recurso.
Validation.ResUOMRampDownConversion = No se pudo convertir la UDM descendente a la UDM predeterminada del recurso.
Validation.ResUOMRampUpConversion = No se pudo convertir la UDM ascendente a la UDM predeterminada del recurso.
Validation.ResourceCapacity = La capacidad m\u00ednima de un recurso es mayor que la capacidad m\u00e1xima.
Validation.MinResQtyUomNoConversion = No hay conversi\u00f3n de la UDM de la cantidad del recurso a la UDM de la cantidad de penalizaci\u00f3n del recurso m\u00ednimo.
Validation.MinResCurrQtyUomMissing =  Falta la UDM de la cantidad de penalizaci\u00f3n del recurso m\u00ednimo.
Validation.MinResCurrQtyUomNoConversion = No hay conversi\u00f3n de la UDM de la cantidad del recurso a la UDM de la cantidad de penalizaci\u00f3n del recurso m\u00ednimo.
Validation.MinResCurrUomMissing = Falta la UDM de la divisa de penalizaci\u00f3n del recurso m\u00ednimo.
Validation.MinResCurrUomNoConversion = No hay conversi\u00f3n de la UDM de la divisa del recurso m\u00ednimo a la UDM de la divisa predeterminada modelo.
Validation.MaxResCurrQtyUomMissing =  Falta la UDM de la cantidad de penalizaci\u00f3n del recurso m\u00e1ximo.
Validation.MaxResQtyUomNoConversion = No hay conversi\u00f3n de la UDM de la cantidad del recurso descendente a la UDM de la divisa predeterminada modelo.
Validation.MaxResCurrUomMissing = Falta la UDM de la divisa de penalizaci\u00f3n del recurso m\u00e1ximo.
Validation.MaxResCurrUomNoConversion = No hay conversi\u00f3n de la UDM de la divisa del recurso m\u00e1ximo a la UDM de la divisa predeterminada modelo.
Validation.RampupResCurrQtyUomMissing =  Falta la UDM de la cantidad de penalizaci\u00f3n del recurso ascendente.
Validation.RampupResCurrQtyUomNoConversion = No hay conversi\u00f3n de la UDM de la cantidad del recurso a la UDM de la cantidad de penalizaci\u00f3n del recurso ascendente.
Validation.RampupResCurrUomMissing = Falta la UDM de la divisa de penalizaci\u00f3n del recurso ascendente.
Validation.RampupResCurrUomNoConversion = No hay conversi\u00f3n de la UDM de la divisa del recurso ascendente a la UDM de la divisa predeterminada modelo.
Validation.RampupResQtyUomMissing = Falta la UDM de la cantidad de limitaci\u00f3n del recurso ascendente.
Validation.RampupResTimeUomMissing = Falta la UDM del tiempo de la limitaci\u00f3n del recurso ascendente.
Validation.RampupWorkingDurTimeUomMissing = Falta la UDM del tiempo de la limitaci\u00f3n de la duraci\u00f3n activa ascendente.
Validation.RampupResQtyUomNoConversion = No hay conversi\u00f3n entre la UDM de la cantidad de limitaci\u00f3n ascendente y la UDM del recurso.
Validation.RampupPnltyQtyUomNoConversion = No hay conversi\u00f3n entre la UDM de la cantidad de penalizaci\u00f3n ascendente y la UDM del recurso.
Validation.RampupTimeUomNotInTimeCategory = La UDM del tiempo de la limitaci\u00f3n ascendente no est\u00e1 en la categor\u00eda UDM de tiempo.
Validation.RampupWorkingDurTimeUomNotInTimeCategory = La UDM del tiempo de la limitaci\u00f3n de la duraci\u00f3n activa ascendente no est\u00e1 en la categor\u00eda UDM de tiempo.
Validation.RampupPnltyTimeUomMissing = Falta la UDM del tiempo de la penalizaci\u00f3n ascendente.
Validation.RampupPnltyTimeUomNotInTimeCategory = La UDM del tiempo de la penalizaci\u00f3n ascendente no est\u00e1 en la categor\u00eda UDM de tiempo.
Validation.RampupWkngDurValExceeds = Los valores convertidos de la duraci\u00f3n de trabajo ascendente son mayores que el n\u00famero de d\u00edas en el per\u00edodo.  Se han ajustado.
Validation.RampupWkngDurValNegative = Algunos valores de la duraci\u00f3n activa ascendente son negativos.  Estos valores se establecer\u00e1n en cero.
Validation.RampupWkngDurValOutOfRange = Los valores convertidos de la duraci\u00f3n de trabajo ascendente son mayores que el n\u00famero de d\u00edas en el per\u00edodo.  Se han ajustado.
Validation.RampdownResCurrQtyUomMissing =  Falta la UDM de la cantidad de penalizaci\u00f3n del recurso descendente.
Validation.RampdownResCurrQtyUomNoConversion = No hay conversi\u00f3n de la UDM de la cantidad de recurso a la UDM de cantidad de penalizaci\u00f3n de recurso descendente.
Validation.RampdownResCurrUomMissing = Falta la UDM de la divisa de la penalizaci\u00f3n del recurso descendente.
Validation.RampdownResCurrUomNoConversion = No hay conversi\u00f3n de la UDM de la divisa del recurso descendente a la UDM de la divisa predeterminada modelo.
Validation.RampdownResQtyUomMissing = Falta la UDM de la cantidad de limitaci\u00f3n de recurso descendente.
Validation.RampdownResTimeUomMissing = Falta la UDM de tiempo de la limitaci\u00f3n del recurso descendente - Se usar\u00e1n d\u00edas.
Validation.RampdownWorkingDurTimeUomMissing = Falta la UDM del tiempo de restricci\u00f3n de la duraci\u00f3n activa descendente -Se usar\u00e1n d\u00edas.
Validation.RampdownQtyUomNoConversion = No hay conversi\u00f3n entre la UDM de la cantidad de limitaci\u00f3n descendente y la UDM del recurso.
Validation.RampdownResQtyUomNoConversion = No hay conversi\u00f3n entre la UDM de la cantidad de limitaci\u00f3n descendente y la UDM del recurso.
Validation.RampdownTimeUomNotInTimeCategory = La UDM del tiempo de limitaci\u00f3n descendente no est\u00e1 en la categor\u00eda UDM de tiempo.
Validation.RampdownWorkingDurTimeUomNotInTimeCategory = La UDM del tiempo de la limitaci\u00f3n de la duraci\u00f3n activa descendente no est\u00e1 en la categor\u00eda UDM de tiempo.
Validation.RampdownPnltyTimeUomMissing = Falta la UDM del tiempo de penalizaci\u00f3n descendente.
Validation.RampdownPnltyTimeUomNotInTimeCategory = La UDM del tiempo de penalizaci\u00f3n descendente no est\u00e1 en la categor\u00eda UDM de tiempo.
Validation.RampdownPnltyQtyUomNoConversion = No hay conversi\u00f3n entre la UDM de la cantidad de limitaci\u00f3n descendente y la UDM del recurso.
Validation.RampdownWkngDurValNegative = Algunos valores de la duraci\u00f3n activa descendente son negativos.  Se han establecido en cero.
Validation.RampdownWkngDurValExceeds = Los valores convertidos de la duraci\u00f3n de trabajo descendente son mayores que el n\u00famero de d\u00edas en el per\u00edodo.  Se han ajustado.
Validation.RampdownWkngDurValOutOfRange = Los valores convertidos de la duraci\u00f3n de trabajo descendente son mayores que el n\u00famero de d\u00edas en el per\u00edodo.  Se han ajustado.
Validation.ResourceMinUomMissing = Falta la UDM de la capacidad m\u00ednima del recurso.
Validation.ResourceMaxUomMissing = Falta la UDM de la capacidad m\u00e1xima del recurso.
Validation.ResQtyUomMissing = Falta la UDM de la cantidad del recurso.
Validation.ResourceMaxNoConversion = No hay conversi\u00f3n entre la UDM de la limitaci\u00f3n de capacidad del recurso m\u00e1ximo y la UDM del recurso.
Validation.ResourceNoReqt = El recurso no se utiliza pues no est\u00e1 adjunto a una UDA o a un proceso.
Validation.ResourceMaxUomMissing = Falta la UDM de la limitaci\u00f3n de la capacidad m\u00e1xima del recurso.
Validation.ResourceMinUomMissing = Falta la UDM de la limitaci\u00f3n de la capacidad m\u00ednima del recurso.
Validation.ResourceMinNoConversion = No hay conversi\u00f3n entre la UDM de la limitaci\u00f3n de capacidad de recurso m\u00ednimo y la UDM de recurso.

# Production Methods
Validation.ProdLeadTimeTooLong = El tiempo de espera de un m\u00e9todo de producci\u00f3n supera la duraci\u00f3n del calendario de planificaci\u00f3n.
Validation.ProdMethodNoValidBOM = El m\u00e9todo de producci\u00f3n no tiene una LDM v\u00e1lida asociada.
Validate.ProductionStepUomMissing = El requisito de recursos no tiene una UDM v\u00e1lida o una conversi\u00f3n v\u00e1lida a la UDM de su recurso asociado.
Validate.ProductionYieldUomMissing = El rendimiento de producci\u00f3n no tiene una UDM v\u00e1lida.
Validation.ProductionYieldZero = La cantidad del rendimiento de producci\u00f3n es cero en algunos periodNoFeasibleSolution.
Validate.ProductionYieldNoConversion = No existe conversi\u00f3n para la UDM del rendimiento de producci\u00f3n y la UDM de la UDA.
Validation.BomNoConversion = No existe conversi\u00f3n entre la UDM del retiro de producci\u00f3n (LDM) y la UDM de la UDA.
Validation.ProductionSplitPenUOMNoConversion = No hay conversi\u00f3n para la UDM de penalizaci\u00f3n del porcentaje de divisi\u00f3n de la producci\u00f3n a la UDM predeterminada de la UDA.
Validation.ProductionSplitCurrUOMNoConversion = No hay conversi\u00f3n para la UDM de la divisa del porcentaje de divisi\u00f3n de la producci\u00f3n a la UDM de la divisa del modelo.
Validate.ProductionStepNoConversion = El requisito de recursos no tiene una conversi\u00f3n de UDM v\u00e1lida a la UDM de su recurso asociado.
Validate.LostCapacityUomMissing = La capacidad perdida de la configuraci\u00f3n no tiene una UDM v\u00e1lida.

#Sourcing
Validation.SourcingLeadTimeTooLong = El tiempo de espera de un m\u00e9todo de suministro supera la duraci\u00f3n del calendario de planificaci\u00f3n.
Validation.SourcingNoReqt = El suministro no tiene asociado un requisito de suministro.  Se ignorar\u00e1.
Validation.SourcingYieldUomMissing = El rendimiento del suministro no tiene una UDM v\u00e1lida.
Validate.SourcingYieldNoUomConversion =  La UDM del rendimiento de suministro no tiene una relaci\u00f3n de conversi\u00f3n validNoFeasibleSolution.
Validate.SourcingRequirementUomMissing = El requisito de suministro no tiene una UDM v\u00e1lida.
Validate.SourcingRequirementNoConversion = La UDM del requisito de suministro no tiene conversi\u00f3n.
Validation.SourcingDrawUomMissing = El consumo de suministro no tiene una UDM v\u00e1lida.
Validate.SourcingDrawNoUomConversion = La UDM del retiro de suministro no tiene una relaci\u00f3n de conversi\u00f3n v\u00e1lida.
Validation.BuyProcessHasNoCost = El proceso de compra no tiene ning\u00fan coste.
Validation.SellProcessHasNoPrice = El proceso de venta no tiene precio.
Validation.BuySellProcessHasNoCostOrPrice = La compra y un proceso de la venta no tiene ning\u00fan coste o precio.
Validation.SouringCostNoConversion = El suministro no tiene conversi\u00f3n de la divisa de coste con la divisa del modelo.
Validation.SouringCostQuantityNoConversion = La UDM de la cantidad de coste de suministro no tiene conversi\u00f3n con las UDA de retiro o rendimiento.
Validation.SouringIccNoConversion = En los c\u00e1lculos de ICC de suministro, la divisa de coste est\u00e1ndar de la UDA descontada no tiene conversi\u00f3n con la divisa del modelo.
Validation.SourcingCostCurrencyUOMMissing = Falta la UDM de la divisa de uno de los componentes de coste/precios del suministro.
Validation.SourcingDrawZero = La cantidad de consumo del suministro es cero en algunos per\u00edodos.
Validation.SourcingYieldZero = La cantidad de rendimiento del suministro es cero en algunos per\u00edodos.
Validation.SourcingGroupMinQtyUOMNoConversion = La UDM de cantidad m\u00ednima de grupos de suministro no tiene conversi\u00f3n con la UDM predeterminada de las UDA.
Validation.SourcingSplitPenUOMNoConversion = No hay conversi\u00f3n para la UDM de la penalizaci\u00f3n del porcentaje de divisi\u00f3n del suministro a la UDM predeterminada de la UDA.
Validation.SourcingSplitCurrUOMNoConversion = No hay conversi\u00f3n para la UDM de la divisa del porcentaje de divisi\u00f3n del suministro a la UDA de la divisa del modelo.
Validation.SouringPriceCurrencyConversion = El precio del suministro no tiene conversi\u00f3n de la UDM de la divisa a la UDM de las UDA de destino.
Validation.SouringPriceQuantityConversion = El precio de suministro no tiene conversi\u00f3n de la UDM de cantidad a la UDM de la UDA.
Validation.DutyCostCurrencyConversion = El coste de arancel no tiene conversi\u00f3n de la UDM de divisa a la UDM de UDA.
Validation.DutyCostQuantityConversion = El coste de arancel no tiene conversi\u00f3n de la UDM de cantidad a la UDM de UDA.
Validation.DrawQuantityConversion = Draw has no quantity UOM conversion to the source SKU's UOM.
Validation.YieldQuantitySrcConversion = El rendimiento no tiene conversi\u00f3n de la UDM de cantidad a la UDM de la UDA de origen.
Validation.YieldQuantityDestConversion = El rendimiento no tiene conversi\u00f3n de la UDM de cantidad a la UDM de la UDA de destino.
                       \
#SKU Validation
Validation.SKUOHNoFlow = La UDA tiene existencias actuales iniciales pero no tiene ning\u00fan proceso de entrada o salida.
Validation.StorableSKUNoFlow = La UDA es almacenable pero no tiene ning\u00fan proceso de entrada o salida.
Validation.SkuStdCostCurrQtyUomMissing = Falta la UDM de cantidad de la UDA.
Validation.SkuStdCostCurrUomMissing = Falta la UDM de la divisa de coste est\u00e1ndar de la UDA.
Validation.SkuStdCostCurrQtyNoConversion = La UDM de la cantidad de coste est\u00e1ndar de la UDA no tiene conversi\u00f3n a la UDM de la cantidad de la UDA.
Validation.SkuStdCostCurrNoConversion = La UDM de la divisa de coste est\u00e1ndar de la UDA no tiene conversi\u00f3n.
Validation.SkuUnitPriceCurrQtyUomMissing = Falta la UDM de cantidad de la UDA.
Validation.SkuUnitPriceCurrUomMissing  = Falta la UDM de la divisa del precio unitario de la UDA.
Validation.SkuUnitPriceCurrQtyNoConversion = La UDM de la cantidad de precio unitario de la UDM no tiene conversi\u00f3n a la UDM de la cantidad de la UDA.
Validation.SkuUnitPriceCurrNoConversion = La UDM de la divisa de precio unitario de la UDA no tiene conversi\u00f3n nJobCancelledo.
Validation.StorageSkuUomNoConversion = La UDM de la cantidad de UDA no puede convertirse a la UDM de la cantidad del recurso de almacenamiento.
Validation.SkuConsCurrQtyUomMissing = Falta la UDM de la cantidad de penalizaci\u00f3n de limitaciones de UDA.
Validation.SkuConsCurrQtyUomNoConversion = No hay conversi\u00f3n entre la UDM de la cantidad de las UDA y la UDM de la cantidad de las penalizaciones.
Validation.SkuConsCurrUomMissing = Falta la UDM de la divisa de limitaci\u00f3n de UDA.
Validation.SkuConsCurrUomnoConversion = La UDM de la divisa de limitaci\u00f3n de UDA no tiene conversi\u00f3n.
Validation.SkuConsQtyUomNoConversion = La UDM de la cantidad de limitaci\u00f3n de UDA no tiene conversi\u00f3n.
Validation.SkuConsQtyUomMissing = Falta la UDM de la cantidad de limitaci\u00f3n de UDA.
Validation.SkuConsCategoryUnknown = La categor\u00eda de la limitaci\u00f3n de UDA se desconoce.
Validation.SkuQtyUomMissing = Falta la UDM de la cantidad de UDA. La UDA no se va a tomar en consideraci\u00f3n para la planificaci\u00f3n.
Validation.SkuNotStorable = La UDA no es almacenable pero tiene requisitos de almacenamiento.
Validation.SKUIndDemandPenUOMNoConversion = La UDM de penalizaci\u00f3n de la demanda independiente no tiene conversi\u00f3n a la UDM predeterminada de la UDA.
Validation.NoOutflwOrMetDmdVariables = No hay demanda satisfecha ni variables de salida para la UDA {0}.  No se crear\u00e1n limitaciones de cobertura futura de existencias actuales.
Validation.MinOutflConstrNoOutfl = La UDA no tiene procesos de salida pero tiene limitaciones del m\u00ednimo de salida.
Validation.MaxOutflConstrNoOutfl = La UDA no tiene procesos de salida pero tiene limitaciones del m\u00e1ximo de salida.
Validation.MinInflConstrNoInfl = La UDA no tiene procesos de entrada pero tiene limitaciones del m\u00ednimo de entrada.
Validation.MaxInflConstrNoInfl = La UDA no tiene procesos de entrada pero tiene limitaciones del m\u00e1ximo de entrada.
Validation.IndDmdButNoSuppliers = La UDA tiene procesos de demanda independiente pero no tiene procesos de oferta.
Validation.InitialOHAndInfSupply = La UDA tiene existencias actuales iniciales positivas y el interruptor de oferta infinita est\u00e1 definido.
Validation.SchedRecptsAndInfSupply = La UDA tiene recepciones programadas y el interruptor de oferta infinita est\u00e1 definido.
Validation.HasSuppliersAndInfSupply = El interruptor de oferta infinita de la UDA est\u00e1 definido pero se ignorar\u00e1 porque la UDA tiene procesos de oferta.
Validation.HasNOSuppliersAndNotInfSupply = El interruptor de oferta infinita de la UDA no est\u00e1 definido y la UDA no tiene procesos de oferta.
Validation.Skuenableswoff = El interruptor para activar la UDA est\u00e1 desactivado.  Esta UDA no se va a tomar en consideraci\u00f3n para la planificaci\u00f3n.
Validation.Skucurrencyuomiszero = No existe una UDM de Divisa para la UDA
Validation.SkuInfCarryFwdSwOff = InfCarryFwdSw de la UDA est\u00e1 desactivado La demanda de per\u00edodo de la UDA ser\u00e1 limitada a un (al mismo) per\u00edodo de tiempo.
Validation.SkuInfiniteSupplySwOff = InterrOfertaInfinit de la UDA est\u00e1 desactivado. Las entradas para la UDA s\u00f3lo pueden ser por Suministro/Rendimiento de producci\u00f3n.
Validation.SkuinvalidminOhCovRule = MinOhCovRule de la UDA no tiene validez. Los valores v\u00e1lidos son 1 y 2.
Validation.SkuNegativeOH = La UDA tiene EA negativas. Las EA se van a considerar cero para todos los c\u00e1lculos.
Validation.SkustorableSwOFF = Esta UDA no se puede almacenar. No se va a consumir el inventario EA.
Validation.SkuinvalidtargetOhCovRule = TargetOhCovRule de la UDA no tiene validez. Los valores v\u00e1lidos son 1 y 2.
Validation.SkuTimeUOMZero = No existe una UDM de tiempo para la UDA La UDA no se va a tomar en consideraci\u00f3n para la planificaci\u00f3n.
Validation.Sourcinggroupblank = No se ha especificado un grupo de suministro para la UDA. El suministro de UDA no tendr\u00e1 limitaciones.
Validation.Itemenableswoff = El interruptor para activar el art\u00edculo est\u00e1 desactivado. El art\u00edculo no se va a tomar en consideraci\u00f3n para la planificaci\u00f3n.
Validation.Locenableswoff = El interruptor para activar la ubicaci\u00f3n est\u00e1 desactivado. La ubicaci\u00f3n no se va a tomar en consideraci\u00f3n para la planificaci\u00f3n.
#Tiered Values
Validation.AccumCalNoIntervals=El calendario de acumulaci\u00f3n del valor estructurado {0} no tiene intervalos.
Validation.AccumCalLessThanPlanCal = El calendario de acumulaci\u00f3n del valor estructurado {0} finaliza antes que el calendario de planificaci\u00f3n.
Validation.GroupedTVNoQtyUOM = El valor estructurado agrupado {0} no tiene definida la UDM de cantidad.  Se usar\u00e1 la UDM de cantidad del objeto asociado.
Validation.GroupedTVNoCurrencyUOM = El valor estructurado agrupado {0} no tiene definida la UDM de divisa.  Se usar\u00e1 la UDM de divisa del objeto asociado.
Validation.TVNoQtyUOM = El valor estructurado {0} no tiene definida la UDM de cantidad.  Se usar\u00e1 la UDM de cantidad del objeto asociado.
Validation.TVNoObjectQtyUOM = El objeto que est\u00e1 usando la valuaci\u00f3n estructurada {0} tiene UDMCantid 0.
Validation.TVNoCurrencyUOM = El valor estructurado {0} no tiene definida la UDM de divisa.  Se usar\u00e1 la UDM de divisa del objeto asociado.
Validation.TVUsedAsCostAndPrice = La valuaci\u00f3n estructurada agrupada {0} se est\u00e1 utilizando como un coste y un precio.
Validation.TVNoQtyUOMNoneForObject = No hay definida la UDM de la cantidad para la valuaci\u00f3n estructurada {0},  o para el objeto que la est\u00e1 utilizando.
Validation.TVUOMToObjUOMNoConversion = No hay conversi\u00f3n definida entre la valuaci\u00f3n estructurada UDMcantid de {0} y los objetos asociados UDMcantid.
Validation.NonPriceTVUsedAsPrice = La valuaci\u00f3n estructurada no relativa a precios {0} adjunta como un precio para la demanda independiente de la UDA.
Validation.TVPriceForNonSinkSKU = La valuaci\u00f3n estructurada no relativa a precios {0} adjunta como un precio para la demanda independiente de la UDA.
Validation.GrpdTVMixedStorageResAndOthers = El coste estructurado agrupado usado por los recursos de almacenamiento y otros tipos de objetos.

#Missing UOM conversions
Validation.ResTVCostNoUOMConversion = No existe conversi\u00f3n para la UDM del coste de recursos.
Validation.ResTVCostMissingUOM = Falta la UDM de coste del recurso.
Validation.SourcingCostNoUOMConversion = No existe conversi\u00f3n del coste de suministro.
Validation.SourcingCostMissingUOM = Falta la UDM de coste del suministro.
Validation.SKUCostNoUOMConversion = No existe conversi\u00f3n del coste de UDA.
Validation.CurrencyUOMMissingForCostOfCapital = Falta la UDM de la divisa del coste de capital.
Validation.CurrencyUOMMissingForProductionConstrPnlty = Falta la UDM de la divisa para la limitaci\u00f3n de la producci\u00f3n. Se usar\u00e1 la UDM de la divisa del modelo.
Validation.SKUCostMissingUOM = Falta la UDM de coste de UDA. Se usar\u00e1 la UDM de la divisa del modelo.

# Missing currency UOMs
Validation.CurrencyUOMMissingForResPnltyCost = Falta UDM de la divisa de coste de penalizaci\u00f3n de recursos.  Se usar\u00e1 la UDM de la divisa modelo.
Validation.CurrencyUOMMissingForResourceCost = Falta la UDM de la divisa de coste del recurso.  Se usar\u00e1 la UDM de la divisa del modelo.
Validation.CurrencyUOMMissingForSetupCost = Falta la UDM de la divisa del coste de la configuraci\u00f3n.  Se usar\u00e1 la UDM de la divisa del modelo.
Validation.CurrencyUOMMissingForSKUPnltyCost = Falta la UDM de la divisa del coste de penalizaci\u00f3n de la UDA.  Se usar\u00e1 la UDM de la divisa modelo.
Validation.CurrencyUOMMissingForSourcingConstrPnltyCost = Falta la UDM de la divisa de coste de penalizaci\u00f3n de limitaci\u00f3n de suministro.  Se usar\u00e1 la UDM de la divisa del modelo.
Validation.CurrencyUOMissingForTieredCost = Falta la UDM de la divisa del coste de la valuaci\u00f3n estructurada.  Se usar\u00e1 la UDM de la divisa del modelo.
Validation.CurrencyUOMissingForSrcngCost = Falta la UDM de la divisa del coste o precio de suministro.  Se usar\u00e1 la UDM de la divisa del modelo.
Validation.CurrencyUOMissingForSkuCost = Falta la UDM de la divisa del coste o precio de UDA.  Se usar\u00e1 la UDM de la divisa del modelo.
Validation.CurrencyUOMMissingForStandardCost = Falta la UDM de la divisa del coste est\u00e1ndar.  Se usar\u00e1 la UDM de la divisa del modelo.

# New validation messages.
Validation.resDisabledMsg = El Recurso est\u00e1 desactivado y por lo tanto no se va a tomar en consideraci\u00f3n para ninguno de sus requisitos.
Validation.locDisabledForResMsg = La Ubicaci\u00f3n del Recurso est\u00e1 desactivada y por lo tanto el Recurso no se va a tomar en consideraci\u00f3n para ninguno de sus requisitos.
Validation.storageDisabledForResMsg = El Requisito de almacenamiento para esta UDA est\u00e1 desactivado, por lo tanto no se va a asignar ning\u00fan Recurso para almacenar esta UDA.
Validation.sourcingDisabledForResMsg = El Requisito de suministro para el Recurso adjunto est\u00e1 desactivado, por lo tanto el Recurso no se va a utilizar para Suministro.
Validation.prodYieldNotExistMsg = No existe una Cant de rendimiento definida para el Proceso de elaboraci\u00f3n y por lo tanto ser\u00e1 considerada como cero.
Validation.prodYieldIsZeroMsg = La cantidad de rendimiento es cero para el proceso de elaboraci\u00f3n. El Proceso de elaboraci\u00f3n no generar\u00e1 resultados de producci\u00f3n.
Validation.prodMethodDisabledMsg = El M\u00e9todo de producci\u00f3n est\u00e1 desactivado y por lo tanto no se va a utilizar para calcular el tiempo de espera/la carga asociados.
Validation.prodStepDisabled = El Paso de producci\u00f3n est\u00e1 desactivado para el Proceso de elaboraci\u00f3n. La carga del Paso de producci\u00f3n no ser\u00e1 agregada al M\u00e9todo de producci\u00f3n.
Validation.setupDisabled = Configuraci\u00f3n adjunta desactivada. Las p\u00e9rdidas de Tiempo/Capacidad /Coste de la configuraci\u00f3n no ser\u00e1n explicadas.
Validation.sourcingDisabled = El Proceso de movimiento est\u00e1 desactivado y por lo tanto no se va a utilizar para gestionar el suministro.
Validation.sourcingDrawNotExistMsg = El Consumo de suministro no existe para el Proceso de movimiento. La cantidad de consumo ser\u00e1 considerada como cero.
Validation.sourcingDrawIsZeroMsg = El Consumo del suministro para el Proceso de movimiento es cero. No habr\u00e1 ninguna salida de suministro.
Validation.sourcingYieldNotExistMsg = El Rendimiento de suministro no existe para el Proceso de movimiento. La cantidad de rendimiento ser\u00e1 considerada como cero
Validation.sourcingYieldIsZeroMsg = El Rendimiento de suministro es cero para el Proceso de movimiento. No habr\u00e1 ninguna entrada de suministro.
Validation.bomdisabled = La LDM est\u00e1 desactivada y no se va a usar en el M\u00e9todo de producci\u00f3n designado.
Validation.sourcinggroupdisabled = Grupo de suministro adjunto desactivado. La limitaci\u00f3n sobre el suministro no ser\u00e1 v\u00e1lida.
Validation.NoSkuInModelMsg = No hay ninguna UDA en el modelo para que el Optimizador la procese
Validation.NoCostAttached = No hay un coste adjunto al modelo.

#QTYUOM Exception Messages
Validation.qtyuomzeroforresMsg = La UDM de Cnt es cero para el Recurso.
Validation.qtyuomzeroforsourcingdrawMsg = La UDM de Cnt es cero para el consumo del suministro.
Validation.qtyuomzeroforsourcingyieldMsg = UDM de Cnt es cero para el Rendimiento del suministro.
Validation.qtyuomzeroforproductionyieldMsg = La UDM de Cnt es cero para el Rendimiento de producci\u00f3n.
Validation.qtyuomzeroforproductionstepMsg = La UDM de Cnt es cero para el Paso de producci\u00f3n.
Validation.qtyuomzeroforbomMsg = La UDM de Cnt es cero para la LDM.
Validation.qtyuomzeroforsourcingrequirementMsg = UDM de Cnt es cero para el Requisito del suministro.


#Cost Exception Messages
Validation.loccostdisabledMsg = Coste/Precio adjunto a la Ubi est\u00e1 desactivado.
Validation.loccostqtyuomzeroMsg = La UDM de Cnt del Coste/Precio adjunto a la UDA es cero.
Validation.loccostcurrencyuomzeroMsg = La UDM de la divisa del Coste/Precio adjunto a la Ubi es cero.
Validation.skucostdisabledMsg = El coste/precio adjunto a la UDA est\u00e1 desactivado. El coste no ser\u00e1 adjuntado a la UDA.
Validation.skucostqtyuomzeroMsg = La UDM de Cnt del Coste/Precio adjunto a la UDA es cero.
Validation.skucostcurrencyuomzeroMsg = La UDM de la divisa del Coste/Precio adjunto a la UDA es cero.
Validation.rescostdisabledMsg = El coste/precio adjunto al Recurso est\u00e1 desactivado. El coste no ser\u00e1 adjuntado al Recurso.
Validation.rescostqtyuomzeroMsg = La UDM de Cnt del Coste/Precio adjunto al Recurso es cero.
Validation.rescostcurrencyuomzeroMsg = La UDM de la divisa del Coste/Precio adjunto al Recurso es cero.
Validation.sourcingcostdisabledMsg = El coste/precio adjunto al Proceso de movimiento est\u00e1 desactivado. El coste no ser\u00e1 adjuntado a la Configuraci\u00f3n.
Validation.sourcingcostqtyuomzeroMsg = La UDM de Cnt del Coste/Precio adjunto al Proceso de movimiento es cero.
Validation.sourcingcostcurrencyuomzeroMsg = La UDM de la divisa del coste/precio adjunto al Proceso de movimiento es cero.
Validation.setupcostdisabledMsg = El coste/precio adjunto a la Configuraci\u00f3n est\u00e1 desactivado. El coste no ser\u00e1 adjuntado a la Configuraci\u00f3n.
Validation.setupcostqtyuomzeroMsg = La UDM de Cnt del Coste/Precio adjunto a la Configuraci\u00f3n es cero.
Validation.setsupcostcurrencyuomzeroMsg = La UDM de la divisa del Coste/Precio adjunto a la Configuraci\u00f3n es cero.


#Messages from the Optimizer
Optimizer.Primal = Primario
Optimizer.Dual = Doble
Optimizer.Barrier = Barrera
Optimizer.Network = Red
Optimizer.Auto = Autom\u00e1tico
Optimizer.Sifting = Tamizar
Optimizer.AlgorithmUsed = Resolver usando el algoritmo {0}.
Optimizer.JobCancelled = La Optimizaci\u00f3n no termin\u00f3.  El usuario cancel\u00f3 el proceso.
Optimizer.ModelStatistics = El modelo tiene {0} limitaciones, {1} variables ({2} binario) y {3} coeficientes sin ceros.
Optimizer.NoFeasibleSolution = Production & Sourcing Optimizer no hall\u00f3 una soluci\u00f3n viable.
Optimizer.RunningInfeasibilityFinder = Buscando inviabilidades en el modelo.
Optimizer.RelaxedMIPIsFeasible = El modelo MIP inicial es inviable pero el problema relajado es viable.  No se pueden recuperar las limitaciones inviables.
Optimizer.LPIsFeasible = El modelo inicial es inviable pero es viable despu\u00e9s de la resoluci\u00f3n.
Optimizer.FeasibleSolution = Production & Sourcing Optimizer ha terminado correctamente.
Optimizer.ReachedTimeLim = Se ha alcanzado el tiempo l\u00edmite de la soluci\u00f3n.
Optimizer.UnboundedSolution =  El modelo es ilimitado. Si maximiza el beneficio, establezca la demanda m\u00e1xima en Inflexible o agregue restricciones adicionales para limitar la producci\u00f3n.
Optimizer.UnboundedVariable =  El modelo es inviable o ilimitado.  Hay un problema con la variable {0}.
Optimizer.FinalMIPGap = El vac\u00edo MIP final es {0}.
Optimizer.FinalObjectiveValue = El objetivo final es {0}.
Optimizer.ModelConditionNumber = El n\u00famero de la condici\u00f3n (medida de calidad num\u00e9rica de la soluci\u00f3n) es {0}.
Optimizer.CondNumUnavailable = No se pudo obtener el n\u00famero de la condici\u00f3n de la soluci\u00f3n, probablemente debido al algoritmo de la ra\u00edz.
Optimizer.CPLEXOutputToFile = Escribiendo el resultado CPLEX en el archivo {0}.
Optimizer.CannotWriteCPLEXOutput = No se puede escribir el resultado en el archivo {0}.  No se escribir\u00e1 el resultado CPLEX.
Optimizer.SKUMetricTblWritten = Los resultados se escriben en la tabla SKUMetric
Optimizer.SKUMetricTblNotWritten = No hay resultados para la tabla SKUMetric.
Optimizer.ProdMetricTblWritten = Los resultados se escriben en la tabla ProductionMetric
Optimizer.ProdMetricTblNotWritten = No hay resultados para la tabla ProductionMetric.
Optimizer.ScngMetricTblWritten = Los resultados se escriben en la tabla M\u00e9tricSumin
Optimizer.ScngMetricTblNotWritten = No hay resultados para la tabla M\u00e9tricSumin.
Optimizer.ResMetricTblWritten = Los resultados se escriben en la tabla ResMetric
Optimizer.ResMetricTblNotWritten = No hay resultados para la tabla ResMetric.
Optimizer.ProdResMetricTblWritten = Los resultados se escriben en la tabla ProductionResMetric
Optimizer.ProdResMetricTblNotWritten = No hay resultados para la tabla ProductionResMetric.
Optimizer.SrcResMetricTblWritten = Los resultados se escriben en la tabla M\u00e9tricRecSumin
Optimizer.SrcResMetricTblNotWritten = No hay resultados para la tabla M\u00e9tricRecSumin.
Optimizer.SKUIndDmdWritten = El resultado de la demanda independiente de la UDA se escribe en la tabla SKUMetric
Optimizer.SKUIndDmdNotWritten = No hay una demanda independiente de UDA para la tabla SKUMetric.
Optimizer.BasisTblWritten = Los resultados se escriben en la tabla base
Optimizer.BasisTblNotWritten = No hay resultados para la tabla Basis.
Optimizer.ScngSplitPctWritten = El resultado del porcentaje de divisi\u00f3n del suministro se escribe en la tabla M\u00e9tricSumin
Optimizer.ScngSplitPctNotWritten = No hay un porcentaje de divisi\u00f3n del suministro para la tabla M\u00e9tricSumin.
Optimizer.ProdSplitPctWritten = Los resultados del porcentaje de divisi\u00f3n de producci\u00f3n se escriben en la tabla ProductionMetric
Optimizer.ProdSplitPctNotWritten = No hay un porcentaje de divisi\u00f3n de la producci\u00f3n para la tabla ProductionMetric.
Optimizer.ModelStatistics = Estad\u00edsticas de modelo :-
Optimizer.NumOfConstraints =  N\u00famero de limitaciones:
Optimizer.NumOfVariables = N\u00famero de variables:
Optimizer.NumOfNon-ZeroCoefficients =  N\u00famero de coeficientes sin ceros: 

#Setup Validation
Validation.SetupCurrUomNoConversion = No hay conversi\u00f3n de la UDM de la divisa de configuraci\u00f3n a la UDM de la divisa predeterminada.

#Messages for Infeasibilities
Infeasibility.ErrorGettingConflict = Error obteniendo conflicto.
Infeasibility.ErrorRefiningConflict = Error refinando el conflicto.
Infeasibility.ConflictCannotBeRefined = El conflicto no puede ser refinado.
Infeasibility.SKU = Inviabilidad de UDA. {0} {1}
Infeasibility.SKUWith_Time_Period_Without_Tier = Inviabilidad de UDA. {0} {1} para el per\u00edodo de tiempo {2}
Infeasibility.SKUWithout_Time_Period_With_Tier = Inviabilidad de UDA. {0} {1} para el nivel {2}
Infeasibility.SKUWith_Time_Period_With_Tier = Inviabilidad de UDA. {0} {1} para el per\u00edodo de tiempo {2} para el nivel{3}
Infeasibility.SKUInfSplySw = La UDA del proveedor {0} en{1} tiene el InterrOfertaInfinit establecida en 0.
Infeasibility.Resource = Inviabilidad de recurso. {0} {1}
Infeasibility.ResourceWith_Time_Period_Without_Tier = Inviabilidad del recurso. {0} {1} para el per\u00edodo de tiempo {2}
Infeasibility.ResourceWithout_Time_Period_With_Tier = Inviabilidad del recurso. {0} {1} para el nivel {2}
Infeasibility.ResourceWith_Time_Period_With_Tier = Inviabilidad del recurso. {0} {1}  para el per\u00edodo de tiempo {2} para el nivel{3}
Infeasibility.Prod = Inviabilidad de prod. {0} m\u00e9todo de producci\u00f3n {1}
Infeasibility.ProdWith_Time_Period_Without_Tier = Inviabilidad de prod. {0} m\u00e9todo de producci\u00f3n {1} para el periodo de tiempo {2}
Infeasibility.ProdWithout_Time_Period_With_Tier = Inviabilidad de prod. {0} m\u00e9todo de producci\u00f3n {1} para el nivel {2}
Infeasibility.ProdWith_Time_Period_With_Tier = Inviabilidad de prod. {0} m\u00e9todo de producci\u00f3n {1} para el per\u00edodo de tiempo {2} para el nivel {3}
Infeasibility.Sourcing = Inviabilidad del suministro. {0} {1}
Infeasibility.SourcingWith_Time_Period_Without_Tier = Inviabilidad del suministro. {0} m\u00e9todo de suministro {1} para el per\u00edodo de tiempo {2}
Infeasibility.SourcingWithout_Time_Period_With_Tier = Inviabilidad del suministro. {0} m\u00e9todo de suministro {1} para el nivel {2}
Infeasibility.SourcingWith_Time_Period_With_Tier = Inviabilidad del suministro. {0} m\u00e9todo de suministro {1} para el per\u00edodo de tiempo {2} para el nivel {3}
Infeasibility.Setup = Inviabilidad de la configuraci\u00f3n. {0} {1}
Infeasibility.SetupWith_Time_Period_Without_Tier = Inviabilidad de la configuraci\u00f3n. {0} {1} para el per\u00edodo de tiempo {2}
Infeasibility.SetupWithout_Time_Period_With_Tier = Inviabilidad de la configuraci\u00f3n. {0} {1} para el nivel {2}
Infeasibility.SetupWith_Time_Period_With_Tier = Inviabilidad de la configuraci\u00f3n. {0} {1} para el per\u00edodo de tiempo {2} para el nivel {3}
Infeasibility.Default = Inviabilidad predeterminada. {0} incidencia {1}
Infeasibility.DefaultWith_Time_Period_Without_Tier = Inviabilidad predeterminada. {0} incidencia {1} para el per\u00edodo de tiempo {2}
Infeasibility.DefaultWithout_Time_Period_With_Tier = Inviabilidad predeterminada. {0} incidencia {1} para el nivel {2}
Infeasibility.DefaultWith_Time_Period_With_Tier = Inviabilidad predeterminada. {0} incidencia {1} para el per\u00edodo de tiempo {2} para el nivel {3}

Infeasibility.IsPartOfConflict = es parte del conflicto.
Infeasibility.MayBePartOfConflict = puede ser parte del conflicto.
Infeasibility.SkuBalanceConstrString = Ecuaci\u00f3n de balances de UDA para 
Infeasibility.SSConstrString = Limitaci\u00f3n del stock de seguridad de UDA para 
Infeasibility.TgtOHConstrString = Limitaci\u00f3n de existencias actuales de destino de UDA para 
Infeasibility.MaxOHConstrString = Limitaci\u00f3n de existencias actuales m\u00e1ximas de UDA para 
Infeasibility.IFConstrString = Ecuaci\u00f3n de entrada de UDA para 
Infeasibility.IFMinConstrString = Limitaci\u00f3n m\u00ednima de entrada de UDA para  
Infeasibility.IFMaxConstrString = Limitaci\u00f3n m\u00e1xima de entrada de UDA para  
Infeasibility.OFConstrString = Ecuaci\u00f3n de salida de UDA para 
Infeasibility.OFMinConstrString = Limitaci\u00f3n m\u00ednima de salida de UDA para  
Infeasibility.OFMaxConstrStraxg = Limitaci\u00f3n m\u00e1xima de salida de UDA para  
Infeasibility.SrcSpltCptConstrString = Limitaci\u00f3n del porcentaje de divisi\u00f3n del suministro para 
Infeasibility.ProdSpltCptConstrString = Limitaci\u00f3n del porcentaje de divisi\u00f3n de producci\u00f3n para 
Infeasibility.IndDmdConstrString = Limitaciones de demanda independiente para 
Infeasibility.MaxIndDmdConstrString = Limitaci\u00f3n de demanda independiente m\u00e1xima para 
Infeasibility.ResUtilConstrString = Ecuaci\u00f3n de utilizaci\u00f3n de recursos para 
Infeasibility.ResMinConstrString = Limitaci\u00f3n de utilizaci\u00f3n m\u00ednima de recursos para 
Infeasibility.ResMaxConstrString = Limitaci\u00f3n de utilizaci\u00f3n m\u00e1xima de recursos para 
Infeasibility.RampUpConstrString = Limitaci\u00f3n ascendente de recursos para 
Infeasibility.RampDownConstrString = Limitaci\u00f3n descendente de recursos para 
Infeasibility.MaxSrcgConstrString = Limitaci\u00f3n de recursos m\u00e1xima para 
Infeasibility.MinSrcgConstrString = Limitaci\u00f3n de recursos m\u00ednima para 
Infeasibility.sgLocMaxConstrString = Limitaci\u00f3n m\u00e1xima de las ubicaciones de suministro para 
Infeasibility.sgLocMinConstrString = Limitaci\u00f3n m\u00ednima de las ubicaciones de suministro para 
Infeasibility.sgProdProcMaxConstrString = Limitaci\u00f3n m\u00e1xima de los procesos de producci\u00f3n para 
Infeasibility.sgProdProcMinConstrString = Limitaci\u00f3n m\u00ednima de los procesos de producci\u00f3n para 
Infeasibility.sgSrcngMaxConstrString = Limitaci\u00f3n m\u00e1xima de los procesos de suministro para 
Infeasibility.sgSrcngMinConstrString = Limitaci\u00f3n m\u00ednima de los procesos de suministro para 
Infeasibility.SkuTierUBConstrString = Restricci\u00f3n del l\u00edmite superior del nivel UDA TV para 
Infeasibility.SkuTierLBConstrString = Restricci\u00f3n del l\u00edmite inferior del nivel de UDA TV para 
Infeasibility.SkuTierBinConstrString = Limitaci\u00f3n binaria del nivel de UDA TV para 
Infeasibility.SkuTVPIConstrString = Limitaci\u00f3n de la intersecci\u00f3n de planificaci\u00f3n del nivel UDA TV para 
Infeasibility.SkuTVAIConstrString = Limitaci\u00f3n de la intersecci\u00f3n de acumulaci\u00f3n del nivel UDA TV para 
Infeasibility.SkuTVPAConstrString = Limitaci\u00f3n de la acumulaci\u00f3n de planificaci\u00f3n del nivel UDA TV para 
Infeasibility.SkuTVClosedTierConstrString = Limitaci\u00f3n del nivel cerrado UDA TV para 
Infeasibility.ResTierUBConstrString = Restricci\u00f3n del limite superior del nivel Recurso TV para 
Infeasibility.ResTierLBConstrString = Restricci\u00f3n del limite inferior del nivel Recurso TV para 
Infeasibility.ResTierBinConstrString = Limitaci\u00f3n binaria del nivel Recurso TV para 
Infeasibility.ResTVPIConstrString = Limitaci\u00f3n de intersecci\u00f3n de planificaci\u00f3n del nivel Recurso TV para 
Infeasibility.ResTVAIConstrString = Limitaci\u00f3n de intersecci\u00f3n de acumulaci\u00f3n del nivel Recurso TV para 
Infeasibility.ResTVPAConstrString = Limitaci\u00f3n de acumulaci\u00f3n de planificaci\u00f3n del nivel Recurso TV para 
Infeasibility.ResTVClosedTierConstrString = Limitaci\u00f3n del nivel cerrado Recurso TV para 
Infeasibility.ProcTierUBConstrString = Restricci\u00f3n del l\u00edmite superior del nivel Proceso TV para 
Infeasibility.ProcTierLBConstrString = Restricci\u00f3n del l\u00edmite inferior del nivel Proceso TV para 
Infeasibility.ProcTierBinConstrString = La limitaci\u00f3n binaria del nivel Proceso TV para 
Infeasibility.ProcTVPIConstrString = Limitaci\u00f3n de intersecci\u00f3n de la planificaci\u00f3n del nivel Proceso TV para 
Infeasibility.ProcTVAIConstrString = Limitaci\u00f3n de intersecci\u00f3n de la acumulaci\u00f3n del nivel Proceso TV para 
Infeasibility.ProcTVPAConstrString = Limitaci\u00f3n de la acumulaci\u00f3n de planificaci\u00f3n del nivel Proceso TV para 
Infeasibility.ProcTVClosedTierConstrString = Limitaci\u00f3n del nivel cerrado del proceso TV para 
Infeasibility.GrpTierUBConstrString = Limitaci\u00f3n del l\u00edmite superior del nivel Grupo TV para 
Infeasibility.GrpTierLBConstrString = Limitaci\u00f3n del l\u00edmite inferior del nivel Grupo TV para 
Infeasibility.GrpTierBinConstrString = Limitaci\u00f3n binaria del nivel Grupo TV para 
Infeasibility.GrpTVPIConstrString = Limitaci\u00f3n de la intersecci\u00f3n de planificaci\u00f3n del nivel Grupo TV para 
Infeasibility.GrpTVAIConstrString = Limitaci\u00f3n de la intersecci\u00f3n de acumulaci\u00f3n del nivel Grupo TV para 
Infeasibility.GrpTVPAConstrString = Limitaci\u00f3n de la acumulaci\u00f3n de planificaci\u00f3n del nivel Grupo TV para 
Infeasibility.GrpTVClosedTierConstrString = Limitaci\u00f3n del nivel cerrado del Grupo TV para 
Infeasibility.SchOHConstrString = Limitaci\u00f3n programada de existencias actuales de UDA para 
Infeasibility.IOHConstrString = Limitaci\u00f3n inicial de existencias actuales de UDA para 
Infeasibility.GrpUtilAEqPConstrString = Limitaci\u00f3n de la acumulaci\u00f3n para utilizaci\u00f3n del Grupo TV para 
Infeasibility.ResUBConstrString = Restricci\u00f3n del l\u00edmite superior del recurso para 
Infeasibility.SrcngUBConstrString = Restricci\u00f3n de l\u00edmite superior del suministro para 
Infeasibility.ProdUBConstrString = Restricci\u00f3n del l\u00edmite superior de producci\u00f3n para 
Infeasibility.StpPrdUBConstrString = L\u00edmite superior de la producci\u00f3n del grupo Configuraci\u00f3n para 
Infeasibility.StpPrdLBConstrString = L\u00edmite inferior de la producci\u00f3n del grupo Configuraci\u00f3n para 
Infeasibility.StpResDurStUBConstrString = L\u00edmite superior del inicio de la duraci\u00f3n del grupo de la configuraci\u00f3n para 
Infeasibility.StpResDurStLBConstrString = L\u00edmite inferior del inicio de la duraci\u00f3n del grupo de la configuraci\u00f3n para 
Infeasibility.StpUBConstrString = L\u00edmite superior de la configuraci\u00f3n para 
Infeasibility.StpLBConstrString = L\u00edmite inferior de la configuraci\u00f3n para 
Infeasibility.StpMinSvdConstrString = Configuraci\u00f3n m\u00ednima guardada para 
Infeasibility.StpUsdResPrConstrString = Configuraci\u00f3n usada anteriormente 
Infeasibility.SrcLotSzConstrString = Tama\u00f1o del lote de suministro 
Infeasibility.SrcExcsUBConstrString = L\u00edmite superior del suministro 
Infeasibility.ProdLotSzConstrString = Tama\u00f1o de lote del m\u00e9todo de producci\u00f3n 
Infeasibility.ProdExcsUBConstrString = L\u00edmite superior del m\u00e9todo de producci\u00f3n 

SCPOWeb.Strategy.enterOptionName = Introduzca el nombre de la opci\u00f3n
SCPOWeb.Strategy.enterOptionValue = Introduzca el valor de la opci\u00f3n
SCPOWeb.Strategy.removeOption = Seleccione una opci\u00f3n a eliminar

# For SRE Job Output on ProcessManager UI and Process Status Popup
JobOutputKey = {0}

StatusPopupOutput = Resultado del optimizador

#Writing Projections and Statistics for SKU and Resource

Strategy.WriteProj.Duration=Duraci\u00f3n
Strategy.WriteProj.PLAInstance=Incidencia de an\u00e1lisis de plan
Strategy.WriteProj.SKUProjection=Proyecciones de UDA
Strategy.WriteProj.SKUStatistics=Estad\u00edsticas de UDA
Strategy.WriteProj.ResProjection=Proyecciones del recurso
Strategy.WriteProj.ResStatistics=Estad\u00edsticas de recursos
Strategy.WriteProj.StartKeyword=Palabra clave de inicio
Strategy.WriteProj.StartKeywordOffset=Desviaci\u00f3n de palabra clave de inicio
Strategy.WriteProj.InvalidDaysEntry=El valor num\u00e9rico de d\u00edas no debe anexarse con a + or a -. Utilice la desviaci\u00f3n para los mismos.
Strategy.WriteProj.Negative=La duraci\u00f3n no puede ser negativa.

# Validations
Validation.NoPLAInstance=La incidencia de an\u00e1lisis de plan es nula.
WriteProj.Null={0} no puede estar vac\u00edo/a.
WriteProj.ParseInt=Entero no v\u00e1lido especificado para {0}.
WriteProj.Nil.Selection=Seleccione estad\u00edsticas o proyecciones  basadas en recurso o UDA para iniciar el proceso.
Error.InvalidDate= El formato introducido {0} no es v\u00e1lido.

### Optimizer Status Window resources
ModelStatistics=Estad\u00edsticas de modelo:
NumberOfConstraints=    N\u00famero de limitaciones:
NumberOfVariables=    N\u00famero de variables:
NumberOfNonZeroCoefficients=    N\u00famero de coeficientes sin ceros:
PrimalSolve=Soluci\u00f3n primaria:
DualSolve=Soluci\u00f3n doble:
NetworkSolve=Soluci\u00f3n de red:
BarrierSolve=Resolver barrera:
Iteration=Iteraci\u00f3n:
Objective=Objetivo:

# Fatals
servlet.log.fatal.internalerror=Error interno:

# Warnings
servlet.log.warning.nolastmodified=\u00daltima modificaci\u00f3n de {0} le\u00edda como 0
servlet.log.warning.notimestamp=Marcador de tiempo de {0} le\u00eddo como 0. En su lugar se utiliza la \u00faltima modificaci\u00f3n
servlet.log.warning.missing-file=Hace referencia a un archivo no existente ({0}) en {1}
servlet.log.warning.xml.parsing=Error al analizar {0} en la l\u00ednea {1}: {2}
servlet.log.warning.xml.reading=Error inesperado al leer {0}:
servlet.log.warning.xml.missing-jnlp=Falta el elemento <jnlp-versions> en {0}
servlet.log.warning.xml.missing-pattern=Falta el elemento <pattern> en {0}
servlet.log.warning.xml.missing-elems=Falta el atributo <version-id> o <file> en {0}
servlet.log.warning.xml.missing-elems2=Falta el atributo <version-id>, <file> o <product-version-id> en {0}
servlet.log.warning.jardiff.failed=Error al generar JarDiff para {0} {1}->{2}

# Informational
servlet.log.info.request=Solicitud: {0}
servlet.log.info.useragent=Agente de usuario: {0}
servlet.log.info.goodrequest=Recurso devuelto: {0}
servlet.log.info.badrequest=Se ha devuelto un c\u00f3digo de error para la solicitud: {0}
servlet.log.scandir=Reexplorar directorio: {0}
servlet.log.info.jardiff.response=Se ha devuelto JarDiff para la solicitud
servlet.log.info.jardiff.gen=Generando JarDiff para {0} {1}->{2}
    	
# JNLP Error strings
servlet.jnlp.err.10 = No se pudo localizar el recurso
servlet.jnlp.err.11 = No se pudo localizar la versi\u00f3n solicitada
servlet.jnlp.err.20 = Sistema operativo no admitido
servlet.jnlp.err.21 = Arquitectura no admitida
servlet.jnlp.err.22 = Configuraci\u00f3n regional no admitida
servlet.jnlp.err.23 = Versi\u00f3n de JRE no admitida
servlet.jnlp.err.99 = Error desconocido    


# Integration
Strategy.Integration.Duration = Duraci\u00f3n
Strategy.Integration.Calendar = Nombre de calendario
Strategy.Integration.StartKeyword = Palabra clave de inicio
Strategy.Integration.StartKeywordOffset = Desviaci\u00f3n de palabra clave de inicio
Strategy.Integration.StartKeywordRule = Norma de palabra clave de inicio
Strategy.Integration.StartDate = Fecha de inicio
Strategy.Integration.Policy = Normas sobre limitaciones
Strategy.Integration.Colon = :

Strategy.Integration.ToScenario = A escenario
Strategy.Integration.IndepedentDemand = Demanda independiente
Strategy.Integration.SafetyStock = Stock de seguridad
Strategy.Integration.AvgStock = Stock promedio
Strategy.Integration.Capacity = Capacidad
Strategy.Integration.Production = Cantidad de producci\u00f3n optimizada
Strategy.Integration.Inventory = Inventario
Strategy.Integration.ScheduledOrder = Pedido programado
Strategy.Integration.SchedRecptConstr = Recepci\u00f3n programada
Strategy.Integration.PurchaseOrder = Orden de compra
Strategy.Integration.VehicleLoadLine = L\u00ednea de carga de veh\u00edculo
Strategy.Integration.Sourcingsw = Cantidad de suministro optimizada
Strategy.Integration.InputTVQ = Datos de entrada
Strategy.Integration.OutputTVQ = Datos de salida
Strategy.Integration.RetainPastInvsw = Inventario vencido de transferencia
Strategy.Integration.RetainPastOrder = Recepciones programadas vencidas de transferencia
Strategy.Integration.RetainPastVLL = Cargas de veh\u00edculos vencidas de transferencia
Strategy.Integration.RetainPastPurchOrder = \u00d3rdenes de compra vencidas de transferencia
Strategy.Integration.IPOPlanName = Nombre del plan de IPO

Strategy.Integration.CheckBoxValidation = Seleccione los datos de entrada para ejecutar.
Strategy.Integration.CheckBoxValidationForOutput = Seleccione los datos de salida para ejecutar.


# Distance Calculation
Strategy.DistanceCalculation.distUom = UdM de distancia

Strategy.integration.error.negative=El valor {0} no puede ser negativo.
Strategy.integration.error.zero=El valor{0} no puede ser cero.
Strategy.integration.error.InvalidDaysEntry=El valor num\u00e9rico de d\u00edas no debe anexarse con a + or a -. Utilice la desviaci\u00f3n para los mismos.
Strategy.integration.error.InvalidDate=El formato introducido {0} no es v\u00e1lido.
Strategy.integration.error.null={0} no puede estar vac\u00edo/a.
Strategy.integration.error.fraction={0} no puede ser una fracci\u00f3n. Introduzca un valor entero positivo.
