###############################################################################
# Resource Bundle for Strategy
###############################################################################

###############################################################################
# Process Options
###############################################################################
YES_VALUE_KEY = Sim
REFINE_CONFLICT_KEY= Relat\u00f3rios de inviabilidade
NO_VALUE_KEY = N\u00e3o
OBJECTIVE_KEY = Objetivo
OBJECTIVE_VALUES_MIN_COST_KEY = Minimizar custo
OBJECTIVE_VALUES_MAX_PROFIT_KEY = Maximizar lucros
SKUS_TO_PROCESS_KEY = SKUs para processar
SKUS_TO_PROCESS_VALUES_DATA_SEL_ONLY_KEY = Apenas sele\u00e7\u00e3o de dados do plano
SKUS_TO_PROCESS_VALUES_ALL_RELATED_KEY = Planejar tudo relacionado
DEFAULT_CURRENCY_UOM_KEY = Moeda de otimiza\u00e7\u00e3o
CALENDAR_START_DATE_KEY = Data de in\u00edcio
CALENDAR_END_DATE_KEY = Data Final
REPORTING_CALENDAR_NAME_KEY = Nome do calend\u00e1rio
OTHER_SETUP_OPTIONS_KEY = Op\u00e7\u00f5es diversas
OTHER_SETUP_OPTIONS_VALUES_CHECK_WARN_KEY = Verificar quanto a avisos
MIP_FEATURES_KEY = Recursos de MIP
MIP_FEATURES_VALUES_MAX_SRC_KEY = Fornecimento m\u00e1x.
MIP_FEATURES_VALUES_MIN_SRC_KEY = Fornecimento m\u00edn.
MIP_FEATURES_VALUES_TIERED_KEY = Valores em camadas
MIP_FEATURES_VALUES_SETUPS_KEY = Prepara\u00e7\u00f5es
INV_CAPITAL_COSTS_KEY = Custos de capital do estoque
INV_CAPITAL_COSTS_VALUES_ON_HAND_KEY = Dispon\u00edvel
INV_CAPITAL_COSTS_VALUES_WIP_KEY = Trabalho em andamento
INV_CAPITAL_COSTS_VALUES_BUY_KEY = Comprar
INV_CAPITAL_COSTS_VALUES_SELL_KEY = Vender
INV_CAPITAL_COSTS_VALUES_MOVE_KEY = Mover
RUN_PREPROCESSOR_ONLY_KEY = Executar somente pr\u00e9-processador
STARTING_CONDITION_KEY = Condi\u00e7\u00e3o inicial
STARTING_CONDITION_VALUES_WARM_KEY = Quente
STARTING_CONDITION_VALUES_COLD_KEY = Frio
ROOT_ALGORITHM_KEY = Algoritmo raiz
Primal = Primitivo
Dual = Duplo
Network = Rede
Barrier = Barreira
NODE_ALGORITHM_KEY = Algoritmo do n\u00f3
TIME_LIMIT_UNITS_KEY = Limite de tempo

USE_MIP_STARTING_VALUES_KEY = Usar valores iniciais de MIP
NODE_SELECT_KEY = Estrat\u00e9gia de sele\u00e7\u00e3o de n\u00f3
DFS = Profundidade da primeira pesquisa
BestBound = Pesquisa de melhor limite
BestEst = Pesquisa de melhor estimativa
BestEstAlt = Pesquisa de melhor estimativa alternativa
MIP_EMPHASIS_KEY = \u00canfase de MIP
Optimality = Idealidade
Feasibility = Viabilidade
Balanced = Equilibrado
BestBound = Melhor limite
HiddenFeas = Viabilidade oculta
RELATIVE_TOLERANCE_KEY = Toler\u00e2ncia relativa
UPPER_BOUND_KEY = Limite superior

SENSITIVITY_REPORTS_KEY = Relat\u00f3rio de sensibilidade
SENSITIVITY_REPORTS_VALUES_MPS_KEY = Pre\u00e7o marginal e espa\u00e7o desperdi\u00e7ado
SENSITIVITY_REPORTS_VALUES_RC_KEY = Custo reduzido
SENSITIVITY_REPORTS_VALUES_OCSA_KEY = An\u00e1lise do coeficiente do objetivo


# Process Names
ScpoFunction.400 = Otimiza\u00e7\u00e3o da produ\u00e7\u00e3o e fornecimento
SCPOWeb.Strategy = Otimizar cadeia de suprimentos
SCPOWeb.WriteProjections=Armazenar proje\u00e7\u00f5es e estat\u00edsticas
RunProcessLaunch.ChooseOptionSelection=Escolher conjunto de op\u00e7\u00f5es

# Remove these after we switch to the new process launch templates
Icon.Delete=Excluir
Icon.New=Novo
Icon.Done=Conclu\u00eddo
Icon.Cancel=Cancelar
Icon.Remove=Remover
Icon.Add=Adicionar

# Tab names
SETUP = Configura\u00e7\u00e3o
OPTIMIZATION = Otimiza\u00e7\u00e3o
MIP_STRATEGY = Estrat\u00e9gia de MIP
ADVANCED = Avan\u00e7ado

Options.Advanced.Editor = Editor de op\u00e7\u00f5es avan\u00e7ado
Options.Advanced.OptionName = Op\u00e7\u00e3o
Options.Advanced.OptionValue = Valor
Options.Advanced.NewOption = Nova op\u00e7\u00e3o
ProcessOption.DataSelectionListHeading=Nenhuma pesquisa

#Alerts from RunProcessLaunch page
RunProcessLaunch.SelectDataSelectionAlert=Selecione a pesquisa antes de executar o processo.
RunProcessLaunch.DataSelectionUnspecifedAlert=A pesquisa n\u00e3o est\u00e1 especificada.

# Validation Errors

Options.Error = Corrija todos os erros marcados em vermelho.
Options.Loading.Error = Falha ao carregar as op\u00e7\u00f5es do processo para o conjunto de op\u00e7\u00f5es especificado.  Consulte mais detalhes no log.
Options.Error.RelativeTolerance = O valor deve estar entre 0 e 1
Options.Error.UpperBound = O valor deve ser maior que ou igual a 0
Options.Error.PositiveInteger = O valor deve ser um n\u00famero inteiro maior que ou igual a 0
Options.Error.AlreadyExists = O nome do conjunto de op\u00e7\u00f5es j\u00e1 existe

#
# Migration error messages
#
Migration.Usage = StrategyMigrate [-umcategories <category_file> -umunits <units_file> -umratio <ratio_file> -delimiter <delimiter character] [-truncate] <inputFile>
Migration.NotEnoughArguments = Argumentos insuficientes.  O arquivo de unidade de medida ou o arquivo de exporta\u00e7\u00e3o 6.2 deve ser fornecido.
Migration.TooManyArguments = Muitos argumentos.
Migration.RequiresArgument = {0} requer um argumento.
Migration.NullUOMRatioFile = N\u00e3o \u00e9 poss\u00edvel migrar as unidades de medidas; arquivo de taxa ausente.
Migration.NullUOMUnitsFile = N\u00e3o \u00e9 poss\u00edvel migrar as unidades de medida; arquivo de unidades ausente.
Migration.NullUOMCategoryFile = N\u00e3o \u00e9 poss\u00edvel migrar as unidades de medida; arquivo de categorias ausente.
Migration.SpecifyAllUOMFiles = Para migrar as unidades de medida, voc\u00ea precisa especificar um arquivo de categoria, um arquivo de unidades e um arquivo de taxa.
Migration.UnrecognizedOption = Op\u00e7\u00e3o n\u00e3o reconhecida: {0}
Migration.FileNotFoundError = Arquivo n\u00e3o encontrado: {0}
Migration.FileOpenError = Erro ao abrir arquivo: {0}
Migration.BeginTruncation = Truncando dados existentes...
Migration.BeginMigrateUnits = Migrando categorias de UDM e UDMs...
Migration.CreateTieredCost = Criando custos e pre\u00e7os em camadas
Migration.CreateItems = Criando itens
Migration.CreateLanes = Criando rotas
Migration.CreateLocations = Criando locais
Migration.CreateMakeProcesses = Criando processos de realiza\u00e7\u00e3o
Migration.MakeProcessCount = {0} processos de realiza\u00e7\u00e3o criados
Migration.CreateMoveProcesses = Criando processos de movimenta\u00e7\u00e3o
Migration.MoveProcessCount = {0} processo de movimenta\u00e7\u00e3o criados
Migration.CreateNamedCalendars = Criando calend\u00e1rios nomeados
Migration.CreatePurchaseProcesses = Criando processos de compra
Migration.PurchaseProcessCount = {0} processos de compra criados
Migration.CreateResources = Criando recursos reutiliz\u00e1veis
Migration.ResourceCount = {0} recursos reutiliz\u00e1veis criados
Migration.ResourceRequirement = Criando requisitos de recursos
Migration.ResourceReqtCount = {0} requisitos de recursos criados
Migration.ServiceLevels = Criando grupos de entrega de tempo de aprovisionamento de grupos de n\u00edvel de servi\u00e7o
Migration.SKUFirstPass = Criando SKUs
Migration.SKUSecondPass = Atualizando SKUs
Migration.InsertSKUCount = {0} SKUs criadas
Migration.UpdateSKUCount = {0} SKUs atualizadas
Migration.CreateSKUReqt = Criando requisitos de SKU
Migration.SourcingGroupFirstPass = Criando grupos de fornecimento
Migration.SourcingGroupSecondPass = Atualizando grupos de fornecimento
Migration.InsertSourcingGroupsCount = {0} grupos de fornecimento criados
Migration.UpdateSourcingGroupsCount = {0} grupos de fornecimento atualizados
Migration.FatalError = Ocorreu um erro fatal ao tentar a migra\u00e7\u00e3o, verifique mais detalhes no arquivo de log.
Migration.FormatError = Erro no formato do arquivo de entrada, se\u00e7\u00e3o de in\u00edcio da classe esperada, mas n\u00e3o encontrada.
Migration.ErrorLineNumber = Ocorreu um erro na linha {0}
Migration.CreateUOMCategories = Criando categorias de unidades de medida
Migration.UOMCategoryCount = {0} categorias de unidades de medida criadas
Migration.CreateUOM = Criando unidades de medida
Migration.UOMCount = {0} unidades de medida criadas
Migration.CreateUOMRatios = Criando convers\u00f5es de unidades de medida
Migration.UOMRatioCount = {0} convers\u00f5es de unidades de medida criadas
Migration.Seconds = segundos.

#User preferences
StrategySettings.title=Configura\u00e7\u00f5es de PSO
StrategySettings.subTitle=Configura\u00e7\u00f5es de UDM padr\u00e3o
rbIdTime=UDM de tempo padr\u00e3o
rbIdCurrency=UDM de moeda padr\u00e3o
rbIdPercentage=UDM de porcentagem padr\u00e3o
rbIdRes=UDM padr\u00e3o de recurso
rbIdSku=UDM padr\u00e3o de SKU
UOMCategory=Categoria de UDM:
UOM=UDM:

#General messages
Validation.ErrorsEncountered = Foram encontrados erros na rede.  O processamento ser\u00e1 encerrado.
Validation.RunPreprocessorOnly = O pr\u00e9-processamento do modelo foi conclu\u00eddo.  O processamento ser\u00e1 encerrado quando o usu\u00e1rio solicitar.

#Calendars
Validation.NoCalIntervals = O calend\u00e1rio {0} n\u00e3o tem intervalos.
Validation.NoCalendar = O calend\u00e1rio de planejamento \u00e9 nulo.

# Model Validation messages - try to keep sorted
Validation.BomUomMissing = A UDM da quantidade para um BOM est\u00e1 ausente.
Validation.BomDrawZero = A quantidade de cria\u00e7\u00e3o de BOM \u00e9 zero em um per\u00edodo.
Validation.Loc_Cost_Invalid_UOM = QtyUOM de custo do local \u00e9 inv\u00e1lida para o local {0}
Validation.Loc_Cost_Zero_UOM = QtyUOM de custo do local \u00e9 zero para o local {0} A UDM padr\u00e3o \u00e9 considerada como ano
Validation.Resource_UOM = UDM do recurso ausente, n\u00e3o habilitada, ou o local do recurso n\u00e3o est\u00e1 habilitado. O recurso n\u00e3o ser\u00e1 considerado para o planejamento
Validation.SKU_Missing_UOM_Enable = A SKU tem UDM ausente, a SKU n\u00e3o est\u00e1 habilitada, ou o local da SKU n\u00e3o est\u00e1 habilitado, ou o item da SKU n\u00e3o est\u00e1 habilitado. A SKU n\u00e3o ser\u00e1 considerada para o planejamento

#Resources
Validation.FirstRampDownBucket = Um valor foi especificado no primeiro per\u00edodo de tempo de regress\u00e3o.  Ele ser\u00e1 ignorado.
Validation.FirstRampUpBucket = Um valor foi especificado no primeiro per\u00edodo de tempo de progress\u00e3o.  Ele ser\u00e1 ignorado.
Validation.MaxCapacityNegative = A capacidade m\u00e1xima \u00e9 menor que zero em pelo menos um intervalo de calend\u00e1rio.
Validation.MinCapacityNegative = A capacidade m\u00ednima \u00e9 menor que zero em pelo menos um intervalo de calend\u00e1rio.
Validation.RampDownNegative = O valor de regress\u00e3o \u00e9 menor que zero em pelo menos um intervalo de calend\u00e1rio.
Validation.RampUpNegative = O valor de progress\u00e3o \u00e9 menor que zero em pelo menos um intervalo de calend\u00e1rio.
Validation.ResConstraintUOMMissing = A restri\u00e7\u00e3o do recurso n\u00e3o tem nenhuma UDM selecionada.
Validation.ResCostCurrencyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da moeda de custo para a UDM da moeda padr\u00e3o do recurso.
Validation.ResCostQtyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da penalidade da quantidade de custo para a UDM da quantidade padr\u00e3o do recurso.
Validation.ResMaxCapacityPenaltyCurrencyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da penalidade da moeda da capacidade m\u00e1xima para a UDM da moeda padr\u00e3o do recurso.
Validation.ResMaxCapacityPenaltyQtyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da penalidade da quantidade da capacidade m\u00e1xima para a UDM da quantidade padr\u00e3o do recurso.
Validation.ResMinCapacityPenaltyCurrencyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da moeda da penalidade da capacidade m\u00ednima para a UDM da moeda padr\u00e3o do recurso.
Validation.ResMinCapacityPenaltyQtyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da penalidade da quantidade da capacidade m\u00ednima para a UDM da quantidade padr\u00e3o do recurso.
Validation.ResRampDownPenaltyCurrencyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da penalidade da moeda de regress\u00e3o para a UDM da moeda padr\u00e3o do recurso.
Validation.ResRampDownPenaltyQtyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da penalidade da quantidade de regress\u00e3o para a UDM da quantidade padr\u00e3o do recurso.
Validation.ResRampUpPenaltyCurrencyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da penalidade da moeda de progress\u00e3o para a UDM da moeda padr\u00e3o do recurso.
Validation.ResRampUpPenaltyQtyUOMConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da penalidade da quantidade de progress\u00e3o para a UDM da quantidade padr\u00e3o do recurso.
Validation.ResUOMMaxCapacityConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da capacidade m\u00e1xima do recurso para a UDM padr\u00e3o do recurso.
Validation.ResUOMMinCapacityConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM da capacidade m\u00ednima do recurso para a UDM padr\u00e3o do recurso.
Validation.ResUOMRampDownConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM de regress\u00e3o para a UDM padr\u00e3o do recurso.
Validation.ResUOMRampUpConversion = N\u00e3o \u00e9 poss\u00edvel converter a UDM de progress\u00e3o para a UDM padr\u00e3o do recurso.
Validation.ResourceCapacity = A capacidade m\u00ednima para um recurso \u00e9 maior que a capacidade m\u00e1xima.
Validation.MinResQtyUomNoConversion = Nenhuma convers\u00e3o de UDM da quantidade do recurso para a UDM da quantidade m\u00ednima da penalidade do recurso.
Validation.MinResCurrQtyUomMissing =  UDM da quantidade m\u00ednima da penalidade do recurso ausente.
Validation.MinResCurrQtyUomNoConversion = Nenhuma convers\u00e3o de UDM da quantidade do recurso para a UDM da quantidade m\u00ednima da penalidade do recurso.
Validation.MinResCurrUomMissing = UDM da moeda m\u00ednima da penalidade do recurso ausente.
Validation.MinResCurrUomNoConversion = Nenhuma convers\u00e3o da UDM de moeda m\u00ednima do recurso para a UDM da moeda padr\u00e3o do modelo.
Validation.MaxResCurrQtyUomMissing =  UDM da quantidade m\u00e1xima da penalidade do recurso ausente.
Validation.MaxResQtyUomNoConversion = Nenhuma convers\u00e3o de UDM da quantidade do recurso para a UDM da quantidade m\u00e1xima da penalidade do recurso.
Validation.MaxResCurrUomMissing = UDM da moeda m\u00e1xima da penalidade do recurso ausente.
Validation.MaxResCurrUomNoConversion = Nenhuma convers\u00e3o da UDM de moeda m\u00e1xima do recurso para a UDM da moeda padr\u00e3o do modelo.
Validation.RampupResCurrQtyUomMissing =  UDM da quantidade da penalidade do recurso de progress\u00e3o ausente.
Validation.RampupResCurrQtyUomNoConversion = Nenhuma convers\u00e3o de UDM da quantidade do recurso para a UDM da quantidade da penalidade de progress\u00e3o do recurso.
Validation.RampupResCurrUomMissing = UDM da moeda da penalidade de progress\u00e3o do recurso ausente.
Validation.RampupResCurrUomNoConversion = Nenhuma convers\u00e3o da UDM de moeda do recurso de progress\u00e3o para a UDM da moeda padr\u00e3o do modelo.
Validation.RampupResQtyUomMissing = UDM da quantidade da restri\u00e7\u00e3o do recurso de progress\u00e3o ausente.
Validation.RampupResTimeUomMissing = UDM de tempo da restri\u00e7\u00e3o do recurso de progress\u00e3o ausente - Dias ser\u00e1 usado.
Validation.RampupWorkingDurTimeUomMissing = UDM de tempo da restri\u00e7\u00e3o de dura\u00e7\u00e3o do trabalho de progress\u00e3o ausente - Dias ser\u00e1 usado.
Validation.RampupResQtyUomNoConversion = Nenhuma convers\u00e3o entre UDM da quantidade de restri\u00e7\u00e3o de progress\u00e3o e a UDM do recurso.
Validation.RampupPnltyQtyUomNoConversion = Nenhuma convers\u00e3o entre UDM da quantidade de penalidade de progress\u00e3o e a UDM do recurso.
Validation.RampupTimeUomNotInTimeCategory = A UDM de tempo de restri\u00e7\u00e3o de progress\u00e3o n\u00e3o est\u00e1 em uma categoria de UDM de tempo.
Validation.RampupWorkingDurTimeUomNotInTimeCategory = A UDM de tempo de restri\u00e7\u00e3o da dura\u00e7\u00e3o de trabalho de progress\u00e3o n\u00e3o est\u00e1 em uma categoria de UDM de tempo.
Validation.RampupPnltyTimeUomMissing = UDM de tempo de penalidade de progress\u00e3o ausente.
Validation.RampupPnltyTimeUomNotInTimeCategory = A UDM de tempo de penalidade de progress\u00e3o n\u00e3o est\u00e1 em uma categoria de UDM de tempo.
Validation.RampupWkngDurValExceeds = Os valores convertidos da dura\u00e7\u00e3o de trabalho de progress\u00e3o s\u00e3o maiores que o n\u00famero de dias no per\u00edodo.  Eles foram ajustados.
Validation.RampupWkngDurValNegative = Alguns valores de dura\u00e7\u00e3o de trabalho de progress\u00e3o s\u00e3o negativos.  Ser\u00e3o definidos como zero.
Validation.RampupWkngDurValOutOfRange = Os valores convertidos da dura\u00e7\u00e3o de trabalho de progress\u00e3o s\u00e3o maiores que o n\u00famero de dias no per\u00edodo.  Eles foram ajustados.
Validation.RampdownResCurrQtyUomMissing =  UDM da quantidade da penalidade do recurso de regress\u00e3o ausente.
Validation.RampdownResCurrQtyUomNoConversion = Nenhuma convers\u00e3o de UDM da quantidade do recurso para a UDM da quantidade da penalidade de regress\u00e3o do recurso.
Validation.RampdownResCurrUomMissing = UDM da moeda da penalidade de regress\u00e3o do recurso ausente.
Validation.RampdownResCurrUomNoConversion = Nenhuma convers\u00e3o da UDM de moeda do recurso de regress\u00e3o para a UDM da moeda padr\u00e3o do modelo.
Validation.RampdownResQtyUomMissing = UDM da quantidade da restri\u00e7\u00e3o do recurso de regress\u00e3o ausente.
Validation.RampdownResTimeUomMissing = UDM de tempo da restri\u00e7\u00e3o do recurso de regress\u00e3o ausente - Dias ser\u00e1 usado.
Validation.RampdownWorkingDurTimeUomMissing = UDM de tempo da restri\u00e7\u00e3o de dura\u00e7\u00e3o do trabalho de regress\u00e3o ausente - Dias ser\u00e1 usado.
Validation.RampdownQtyUomNoConversion = Nenhuma convers\u00e3o entre UDM da quantidade de restri\u00e7\u00e3o de regress\u00e3o e a UDM do recurso.
Validation.RampdownResQtyUomNoConversion = Nenhuma convers\u00e3o entre UDM da quantidade de restri\u00e7\u00e3o de regress\u00e3o e a UDM do recurso.
Validation.RampdownTimeUomNotInTimeCategory = A UDM de tempo de restri\u00e7\u00e3o de regress\u00e3o n\u00e3o est\u00e1 em uma categoria de UDM de tempo.
Validation.RampdownWorkingDurTimeUomNotInTimeCategory = A UDM de tempo de restri\u00e7\u00e3o da dura\u00e7\u00e3o de trabalho de regress\u00e3o n\u00e3o est\u00e1 em uma categoria de UDM de tempo.
Validation.RampdownPnltyTimeUomMissing = UDM de tempo de penalidade de regress\u00e3o ausente.
Validation.RampdownPnltyTimeUomNotInTimeCategory = A UDM de tempo de penalidade de regress\u00e3o n\u00e3o est\u00e1 em uma categoria de UDM de tempo.
Validation.RampdownPnltyQtyUomNoConversion = Nenhuma convers\u00e3o entre UDM da quantidade de penalidade de regress\u00e3o e a UDM do recurso.
Validation.RampdownWkngDurValNegative = Alguns valores de dura\u00e7\u00e3o de trabalho de regress\u00e3o s\u00e3o negativos.  Foram definidos como zero.
Validation.RampdownWkngDurValExceeds = Os valores convertidos da dura\u00e7\u00e3o de trabalho de regress\u00e3o s\u00e3o maiores que o n\u00famero de dias no per\u00edodo.  Eles foram ajustados.
Validation.RampdownWkngDurValOutOfRange = Os valores convertidos da dura\u00e7\u00e3o de trabalho de regress\u00e3o s\u00e3o maiores que o n\u00famero de dias no per\u00edodo.  Eles foram ajustados.
Validation.ResourceMinUomMissing = UDM de capacidade m\u00ednima do recurso ausente.
Validation.ResourceMaxUomMissing = UDM de capacidade m\u00e1xima do recurso ausente.
Validation.ResQtyUomMissing = UDM da quantidade do recurso ausente.
Validation.ResourceMaxNoConversion = Nenhuma convers\u00e3o entre a UDM da restri\u00e7\u00e3o de capacidade m\u00e1xima e a UDM do recurso.
Validation.ResourceNoReqt = O recurso n\u00e3o \u00e9 usado, pois ele n\u00e3o est\u00e1 anexado a uma SKU ou processo.
Validation.ResourceMaxUomMissing = A UDM para a restri\u00e7\u00e3o de capacidade m\u00e1xima do recurso est\u00e1 ausente.
Validation.ResourceMinUomMissing = A UDM para a restri\u00e7\u00e3o de capacidade m\u00ednima do recurso est\u00e1 ausente.
Validation.ResourceMinNoConversion = Nenhuma convers\u00e3o entre a UDM da restri\u00e7\u00e3o de capacidade m\u00ednima e a UDM do recurso.

# Production Methods
Validation.ProdLeadTimeTooLong = O tempo de aprovisionamento para um m\u00e9todo de produ\u00e7\u00e3o excede o comprimento do calend\u00e1rio de planejamento.
Validation.ProdMethodNoValidBOM = O m\u00e9todo de produ\u00e7\u00e3o n\u00e3o tem um BOM v\u00e1lido associado a ele.
Validate.ProductionStepUomMissing = O requisito do recurso n\u00e3o tem uma UDM v\u00e1lida ou n\u00e3o tem uma convers\u00e3o de UDM v\u00e1lida para a UDM de seu recurso associado.
Validate.ProductionYieldUomMissing = O rendimento da produ\u00e7\u00e3o n\u00e3o tem uma UDM v\u00e1lida.
Validation.ProductionYieldZero = A quantidade do rendimento da produ\u00e7\u00e3o \u00e9 zero em alguma periodNoFeasibleSolution.
Validate.ProductionYieldNoConversion = N\u00e3o h\u00e1 convers\u00f5es para a UDM de rendimento de produ\u00e7\u00e3o e a UDM de SKU.
Validation.BomNoConversion = N\u00e3o h\u00e1 convers\u00f5es entre a UDM (de BOM) de retirada da produ\u00e7\u00e3o e a UDM de SKU.
Validation.ProductionSplitPenUOMNoConversion = N\u00e3o h\u00e1 convers\u00f5es para a UDM da penalidade do percentual de divis\u00e3o da produ\u00e7\u00e3o e a UDM padr\u00e3o de SKU.
Validation.ProductionSplitCurrUOMNoConversion = N\u00e3o h\u00e1 convers\u00f5es para a UDM da moeda do percentual de divis\u00e3o da produ\u00e7\u00e3o para a UDM de moeda modelo.
Validate.ProductionStepNoConversion = O requisito do recurso n\u00e3o tem uma convers\u00e3o de UDM v\u00e1lida para a UDM de seu recurso associado.
Validate.LostCapacityUomMissing = A capacidade perdida com a configura\u00e7\u00e3o n\u00e3o tem uma UDM v\u00e1lida.

#Sourcing
Validation.SourcingLeadTimeTooLong = O tempo de aprovisionamento para um m\u00e9todo de fornecimento excede o comprimento do calend\u00e1rio de planejamento.
Validation.SourcingNoReqt = O fornecimento n\u00e3o tem requisitos de fornecimento associados.  Ele ser\u00e1 ignorado.
Validation.SourcingYieldUomMissing = O rendimento do fornecimento n\u00e3o tem uma UDM v\u00e1lida.
Validate.SourcingYieldNoUomConversion =  A UDM de rendimento do fornecimento n\u00e3o tem uma taxa de convers\u00e3o validNoFeasibleSolution.
Validate.SourcingRequirementUomMissing = O requisito do fornecimento n\u00e3o tem uma UDM v\u00e1lida.
Validate.SourcingRequirementNoConversion = A UDM de requisito de fornecimento n\u00e3o tem convers\u00f5es.
Validation.SourcingDrawUomMissing = A retirada do fornecimento n\u00e3o tem uma UDM v\u00e1lida.
Validate.SourcingDrawNoUomConversion = A UDM de retirada do fornecimento n\u00e3o tem uma taxa de convers\u00e3o v\u00e1lida.
Validation.BuyProcessHasNoCost = O processo de compra n\u00e3o tem custo.
Validation.SellProcessHasNoPrice = O processo de venda n\u00e3o tem pre\u00e7o.
Validation.BuySellProcessHasNoCostOrPrice = Os processos de compra e de venda n\u00e3o t\u00eam custo ou pre\u00e7o.
Validation.SouringCostNoConversion = O fornecimento n\u00e3o tem convers\u00e3o de moeda de custo com a moeda modelo.
Validation.SouringCostQuantityNoConversion = A UDM de quantidade de custo do fornecimento n\u00e3o tem convers\u00e3o com as SKUs de retirada e rendimento correspondentes.
Validation.SouringIccNoConversion = Nos c\u00e1lculos de ICC do fornecimento, a moeda de custo padr\u00e3o de SKU de retirada n\u00e3o tem convers\u00e3o com a moeda modelo.
Validation.SourcingCostCurrencyUOMMissing = Uma das UDMs da moeda dos componentes de custo/pre\u00e7os est\u00e1 ausente no fornecimento.
Validation.SourcingDrawZero = A quantidade de retirada do fornecimento \u00e9 zero em um per\u00edodo.
Validation.SourcingYieldZero = A quantidade de rendimento do fornecimento \u00e9 zero em um per\u00edodo.
Validation.SourcingGroupMinQtyUOMNoConversion = A UDM de quantidade m\u00ednima do grupo de fornecimento n\u00e3o tem convers\u00e3o com a UDM padr\u00e3o de SKU.
Validation.SourcingSplitPenUOMNoConversion = N\u00e3o h\u00e1 convers\u00f5es para a UDM da penalidade do percentual de divis\u00e3o do fornecimento e a UDM padr\u00e3o de SKU.
Validation.SourcingSplitCurrUOMNoConversion = N\u00e3o h\u00e1 convers\u00f5es para a UDM da moeda do percentual de divis\u00e3o do fornecimento para a UDM de moeda modelo.
Validation.SouringPriceCurrencyConversion = O pre\u00e7o de fornecimento n\u00e3o tem convers\u00e3o de UDM para a UDM da SKU de destino.
Validation.SouringPriceQuantityConversion = O pre\u00e7o de fornecimento n\u00e3o tem convers\u00e3o de UDM de quantidade para a UDM da SKU.
Validation.DutyCostCurrencyConversion = O custo da tarifa n\u00e3o tem convers\u00e3o de UDM de moeda para a UDM da SKU.
Validation.DutyCostQuantityConversion = O custo da tarifa n\u00e3o tem convers\u00e3o de UDM de quantidade para a UDM da SKU.
Validation.DrawQuantityConversion = A retirada n\u00e3o tem convers\u00e3o de UDM de quantidade para a UDM da SKU de origem.
Validation.YieldQuantitySrcConversion = O rendimento n\u00e3o tem convers\u00e3o de UDM de quantidade para a UDM da SKU de origem.
Validation.YieldQuantityDestConversion = O rendimento n\u00e3o tem convers\u00e3o de UDM de quantidade para a UDM da SKU de destino.
                       \
#SKU Validation
Validation.SKUOHNoFlow = A SKU tem dispon\u00edvel inicial, mas n\u00e3o tem processos de fluxo de entrada ou fluxo de sa\u00edda.
Validation.StorableSKUNoFlow = A SKU \u00e9 armazen\u00e1vel, mas n\u00e3o tem processos de fluxo de entrada ou fluxo de sa\u00edda.
Validation.SkuStdCostCurrQtyUomMissing = UDM da quantidade da SKU ausente.
Validation.SkuStdCostCurrUomMissing = UDM da moeda de custo padr\u00e3o da SKU ausente.
Validation.SkuStdCostCurrQtyNoConversion = A UDM de quantidade de custo padr\u00e3o da SKU n\u00e3o tem convers\u00e3o para a UDM de quantidade da SKU.
Validation.SkuStdCostCurrNoConversion = A UDM da moeda de custo padr\u00e3o da SKU n\u00e3o tem convers\u00e3o.
Validation.SkuUnitPriceCurrQtyUomMissing = UDM da quantidade da SKU ausente.
Validation.SkuUnitPriceCurrUomMissing  = UDM da moeda de pre\u00e7o unit\u00e1rio da SKU ausente.
Validation.SkuUnitPriceCurrQtyNoConversion = A UDM de quantidade do pre\u00e7o unit\u00e1rio da SKU n\u00e3o tem convers\u00e3o para a UDM de quantidade da SKU.
Validation.SkuUnitPriceCurrNoConversion = A UDM da moeda de pre\u00e7o unit\u00e1rio da SKU n\u00e3o tem convers\u00e3o de nJobCancelledo.
Validation.StorageSkuUomNoConversion = A UDM da quantidade da SKU n\u00e3o pode ser convertida para a UDM da quantidade do recurso de armazenamento.
Validation.SkuConsCurrQtyUomMissing = UDM da quantidade da penalidade de restri\u00e7\u00e3o da SKU ausente.
Validation.SkuConsCurrQtyUomNoConversion = N\u00e3o h\u00e1 convers\u00f5es entre a UDM de quantidade da SKU e a UDM de quantidade da penalidade.
Validation.SkuConsCurrUomMissing = UDM de moeda da restri\u00e7\u00e3o da SKU ausente.
Validation.SkuConsCurrUomnoConversion = A UDM de moeda da restri\u00e7\u00e3o da SKU n\u00e3o tem convers\u00e3o.
Validation.SkuConsQtyUomNoConversion = A UDM da quantidade da restri\u00e7\u00e3o da SKU n\u00e3o tem convers\u00e3o.
Validation.SkuConsQtyUomMissing = UDM da quantidade da restri\u00e7\u00e3o da SKU ausente.
Validation.SkuConsCategoryUnknown = A categoria de restri\u00e7\u00e3o da SKU \u00e9 desconhecida.
Validation.SkuQtyUomMissing = UDM da quantidade da SKU ausente. A SKU n\u00e3o ser\u00e1 considerada para o planejamento.
Validation.SkuNotStorable = A SKU n\u00e3o \u00e9 armazen\u00e1vel, mas tem requisitos de armazenamento.
Validation.SKUIndDemandPenUOMNoConversion = A UDM de penalidade de demanda independente n\u00e3o tem convers\u00e3o para a UDM padr\u00e3o de SKUs.
Validation.NoOutflwOrMetDmdVariables = N\u00e3o h\u00e1 demandas atendidas e nenhuma vari\u00e1vel de fluxo de sa\u00edda para a SKU {0}.  Nenhuma restri\u00e7\u00e3o de cobertura direta dispon\u00edvel ser\u00e1 criada.
Validation.MinOutflConstrNoOutfl = A SKU n\u00e3o tem processos de fluxo de sa\u00edda, mas tem restri\u00e7\u00f5es m\u00ednimas de fluxo de sa\u00edda.
Validation.MaxOutflConstrNoOutfl = A SKU n\u00e3o tem processos de fluxo de sa\u00edda, mas tem restri\u00e7\u00f5es m\u00e1ximas de fluxo de sa\u00edda.
Validation.MinInflConstrNoInfl = A SKU n\u00e3o tem processos de fluxo de entrada, mas tem restri\u00e7\u00f5es m\u00ednimas de fluxo de entrada.
Validation.MaxInflConstrNoInfl = A SKU n\u00e3o tem processos de fluxo de entrada, mas tem restri\u00e7\u00f5es m\u00e1ximas de fluxo de entrada.
Validation.IndDmdButNoSuppliers = A SKU tem demanda independente, mas n\u00e3o tem processos de fornecimento.
Validation.InitialOHAndInfSupply = A SKU tem dispon\u00edvel inicial positivo E a troca de fornecimento infinita est\u00e1 definida.
Validation.SchedRecptsAndInfSupply = A SKU tem recebimentos agendados E a troca de fornecimento infinita est\u00e1 definida.
Validation.HasSuppliersAndInfSupply = A troca de fornecimento infinita da SKU est\u00e1 definida, mas ser\u00e1 ignorada, porque a SKU tem processos de fornecimento.
Validation.HasNOSuppliersAndNotInfSupply = A troca de fornecimento infinita da SKU n\u00e3o est\u00e1 definida e a SKU n\u00e3o tem processos de fornecimento.
Validation.Skuenableswoff = A troca de habilita\u00e7\u00e3o da SKU est\u00e1 desativada.  A SKU n\u00e3o ser\u00e1 considerada para o planejamento.
Validation.Skucurrencyuomiszero = CurrencyUOM da SKU ausente
Validation.SkuInfCarryFwdSwOff = InfCarryFwdSw da SKU desativado. A demanda de grupo da SKU ser\u00e1 limitada a um (mesmo) grupo de tempo.
Validation.SkuInfiniteSupplySwOff = InfiniteSupplySw da SKU desativado. Os fluxos de entrada para a SKU somente podem ser o rendimento de produ\u00e7\u00e3o/fornecimento.
Validation.SkuinvalidminOhCovRule = A SKU tem uma MinOhCovRule inv\u00e1lida. Os valores v\u00e1lidos s\u00e3o 1 e 2.
Validation.SkuNegativeOH = A SKU tem OH negativo. OH ser\u00e1 considerado zero para todos os c\u00e1lculos.
Validation.SkustorableSwOFF = A SKU n\u00e3o \u00e9 armazen\u00e1vel. O estoque de OH n\u00e3o ser\u00e1 consumido.
Validation.SkuinvalidtargetOhCovRule = A SKU tem TargetOhCovRule inv\u00e1lido. Os valores v\u00e1lidos s\u00e3o 1 e 2.
Validation.SkuTimeUOMZero = A UDM de tempo da SKU est\u00e1 ausente. A SKU n\u00e3o ser\u00e1 considerada para o planejamento.
Validation.Sourcinggroupblank = O grupo de fornecimento n\u00e3o foi especificado para o fornecimento da SKU. A SKU n\u00e3o ser\u00e1 restringida.
Validation.Itemenableswoff = A troca de habilita\u00e7\u00e3o de item est\u00e1 desativada. O item n\u00e3o ser\u00e1 considerado para o planejamento
Validation.Locenableswoff = A troca de habilita\u00e7\u00e3o de local est\u00e1 desativada. O local n\u00e3o ser\u00e1 considerado para o planejamento
#Tiered Values
Validation.AccumCalNoIntervals=O calend\u00e1rio de ac\u00famulo para o valor em camadas {0} n\u00e3o tem intervalos.
Validation.AccumCalLessThanPlanCal = O calend\u00e1rio de ac\u00famulo para o valor em camadas {0} termina antes do calend\u00e1rio de planejamento.
Validation.GroupedTVNoQtyUOM = O valor em camadas agrupado {0} n\u00e3o tem uma UDM de quantidade definida.  A UDM de quantidade de seu objeto associado ser\u00e1 usada.
Validation.GroupedTVNoCurrencyUOM = O valor em camadas agrupado {0} n\u00e3o tem uma UDM de moeda definida.  A UDM de moeda de seu objeto associado ser\u00e1 usada.
Validation.TVNoQtyUOM = O valor em camadas {0} n\u00e3o tem uma UDM de quantidade definida.  A UDM de quantidade de seu objeto associado ser\u00e1 usada.
Validation.TVNoObjectQtyUOM = O objeto que usa a aprecia\u00e7\u00e3o em camadas {0} tem QTYUOM 0.
Validation.TVNoCurrencyUOM = O valor em camadas {0} n\u00e3o tem uma UDM de moeda definida.  A UDM de moeda de seu objeto associado ser\u00e1 usada.
Validation.TVUsedAsCostAndPrice = A aprecia\u00e7\u00e3o em camadas agrupada {0} est\u00e1 sendo usada tanto como um custo quanto como um pre\u00e7o.
Validation.TVNoQtyUOMNoneForObject = Nenhuma UDM de quantidade est\u00e1 definida para {0}, NEM para o objeto que a est\u00e1 usando.
Validation.TVUOMToObjUOMNoConversion = Nenhuma convers\u00e3o est\u00e1 definida entre a qtyUOM de {0} de aprecia\u00e7\u00e3o em camadas e a qtyUOM do objeto associado.
Validation.NonPriceTVUsedAsPrice = Aprecia\u00e7\u00e3o em camadas n\u00e3o de pre\u00e7o {0} anexado como um pre\u00e7o para a demanda independente de SKU.
Validation.TVPriceForNonSinkSKU = Aprecia\u00e7\u00e3o em camadas n\u00e3o de pre\u00e7o {0} anexado como um pre\u00e7o para a demanda independente de SKU.
Validation.GrpdTVMixedStorageResAndOthers = Custo em camadas agrupado usado tanto pelos recursos de armazenamento quanto por outros tipos de objetos.

#Missing UOM conversions
Validation.ResTVCostNoUOMConversion = Nenhuma convers\u00e3o existe para a UDM de custo de recursos.
Validation.ResTVCostMissingUOM = UDM de custo de recursos ausente.
Validation.SourcingCostNoUOMConversion = Nenhuma convers\u00e3o existe para o custo de fornecimento.
Validation.SourcingCostMissingUOM = UDM de custo de fornecimento ausente.
Validation.SKUCostNoUOMConversion = Nenhuma convers\u00e3o existe para o custo de SKU.
Validation.CurrencyUOMMissingForCostOfCapital = UDM de moeda ausente para o custo de capital.
Validation.CurrencyUOMMissingForProductionConstrPnlty = UDM de moeda ausente para a restri\u00e7\u00e3o de produ\u00e7\u00e3o. A UDM de moeda modelo ser\u00e1 usada.
Validation.SKUCostMissingUOM = UDM de custo de SKU ausente. A UDM de moeda modelo ser\u00e1 usada.

# Missing currency UOMs
Validation.CurrencyUOMMissingForResPnltyCost = UDM de moeda de custo de penalidade de recurso ausente.  A UDM de moeda modelo ser\u00e1 usada.
Validation.CurrencyUOMMissingForResourceCost = UDM de moeda de custo de recurso ausente.  A UDM de moeda modelo ser\u00e1 usada.
Validation.CurrencyUOMMissingForSetupCost = UDM de moeda de custo de configura\u00e7\u00e3o ausente.  A UDM de moeda modelo ser\u00e1 usada.
Validation.CurrencyUOMMissingForSKUPnltyCost = UDM de moeda de custo de penalidade de SKU ausente.  A UDM de moeda modelo ser\u00e1 usada.
Validation.CurrencyUOMMissingForSourcingConstrPnltyCost = UDM de moeda de custo de penalidade de restri\u00e7\u00e3o de fornecimento ausente.  A UDM de moeda modelo ser\u00e1 usada.
Validation.CurrencyUOMissingForTieredCost = UDM de moeda de custo de aprecia\u00e7\u00e3o em camadas ausente.  A UDM de moeda modelo ser\u00e1 usada.
Validation.CurrencyUOMissingForSrcngCost = UDM de pre\u00e7o de fornecimento ou de moeda de custo ausente.  A UDM de moeda modelo ser\u00e1 usada.
Validation.CurrencyUOMissingForSkuCost = UDM de pre\u00e7o de SKU ou de moeda de custo ausente.  A UDM de moeda modelo ser\u00e1 usada.
Validation.CurrencyUOMMissingForStandardCost = UDM da moeda de custo padr\u00e3o ausente.  A UDM de moeda modelo ser\u00e1 usada.

# New validation messages.
Validation.resDisabledMsg = O recurso est\u00e1 desativado e, portanto, n\u00e3o ser\u00e1 considerado para qualquer um de seus requisitos.
Validation.locDisabledForResMsg = O local do recurso est\u00e1 desativado e, portanto, n\u00e3o ser\u00e1 considerado para qualquer um de seus requisitos.
Validation.storageDisabledForResMsg = O requisito do armazenamento est\u00e1 desabilitado para a SKU, portanto, nenhum recurso seria alocado para o armazenamento da SKU.
Validation.sourcingDisabledForResMsg = O requisito de fornecimento est\u00e1 desativado para o recurso anexado, portanto, o recurso n\u00e3o ser\u00e1 utilizado para o fornecimento.
Validation.prodYieldNotExistMsg = A quantidade de rendimento n\u00e3o est\u00e1 definida para o processo de realiza\u00e7\u00e3o e ser\u00e1 considerada como zero.
Validation.prodYieldIsZeroMsg = A quantidade de rendimento \u00e9 zero para o processo de realiza\u00e7\u00e3o. N\u00e3o haver\u00e1 sa\u00edda de produ\u00e7\u00e3o para o processo de realiza\u00e7\u00e3o.
Validation.prodMethodDisabledMsg = O m\u00e9todo de produ\u00e7\u00e3o est\u00e1 desativado e, portanto, n\u00e3o ser\u00e1 utilizado para o c\u00e1lculo do tempo de aprovisionamento/carga associados.
Validation.prodStepDisabled = A etapa de produ\u00e7\u00e3o est\u00e1 desabilitada para o processo de realiza\u00e7\u00e3o. A carga na etapa de produ\u00e7\u00e3o n\u00e3o ser\u00e1 adicionada ao m\u00e9todo de produ\u00e7\u00e3o.
Validation.setupDisabled = A configura\u00e7\u00e3o anexada est\u00e1 desabilitada. Perdas de tempo/capacidade/custo da configura\u00e7\u00e3o n\u00e3o ser\u00e3o contabilizadas.
Validation.sourcingDisabled = O processo de movimenta\u00e7\u00e3o est\u00e1 desabilitado e, portanto, n\u00e3o seria utilizado para realizar o fornecimento.
Validation.sourcingDrawNotExistMsg = A retirada do fornecimento n\u00e3o existe para o processo de movimenta\u00e7\u00e3o. A quantidade de retirada ser\u00e1 considerada como zero.
Validation.sourcingDrawIsZeroMsg = A retirada do fornecimento \u00e9 zero para o processo de movimenta\u00e7\u00e3o. N\u00e3o haver\u00e1 fluxo de sa\u00edda do fornecimento.
Validation.sourcingYieldNotExistMsg = O rendimento do fornecimento n\u00e3o existe para o processo de movimenta\u00e7\u00e3o. A quantidade de rendimento ser\u00e1 considerada como zero.
Validation.sourcingYieldIsZeroMsg = O rendimento do fornecimento \u00e9 zero para o processo de movimenta\u00e7\u00e3o. N\u00e3o haver\u00e1 fluxo de entrada do fornecimento.
Validation.bomdisabled = A BOM est\u00e1 desabilitada e n\u00e3o ser\u00e1 usada no m\u00e9todo de produ\u00e7\u00e3o designado.
Validation.sourcinggroupdisabled = Grupo de fornecimento anexado est\u00e1 desabilitado. A restri\u00e7\u00e3o sobre o fornecimento n\u00e3o ser\u00e1 v\u00e1lida.
Validation.NoSkuInModelMsg = N\u00e3o h\u00e1 SKU no modelo para o otimizador processar.
Validation.NoCostAttached = Nenhum custo anexado ao modelo.

#QTYUOM Exception Messages
Validation.qtyuomzeroforresMsg = A UDM de quantidade \u00e9 zero para o recurso.
Validation.qtyuomzeroforsourcingdrawMsg = A UDM de quantidade \u00e9 zero para a retirada de fornecimento.
Validation.qtyuomzeroforsourcingyieldMsg = A UDM de quantidade \u00e9 zero para o rendimento de fornecimento.
Validation.qtyuomzeroforproductionyieldMsg = A UDM de quantidade \u00e9 zero para o rendimento da produ\u00e7\u00e3o.
Validation.qtyuomzeroforproductionstepMsg = A UDM de quantidade \u00e9 zero para a etapa de produ\u00e7\u00e3o.
Validation.qtyuomzeroforbomMsg = A UDM de quantidade \u00e9 zero para a BOM.
Validation.qtyuomzeroforsourcingrequirementMsg = A UDM de quantidade \u00e9 zero para o requisito de fornecimento.


#Cost Exception Messages
Validation.loccostdisabledMsg = O custo/pre\u00e7o anexado ao local est\u00e1 desabilitado.
Validation.loccostqtyuomzeroMsg = A UDM de quantidade do custo/pre\u00e7o anexado ao local est\u00e1 desabilitada.
Validation.loccostcurrencyuomzeroMsg = A UDM de moeda do custo/pre\u00e7o anexado ao local est\u00e1 desabilitada.
Validation.skucostdisabledMsg = O custo/pre\u00e7o anexado \u00e0 SKU est\u00e1 desabilitado. O custo n\u00e3o ser\u00e1 anexado \u00e0 SKU.
Validation.skucostqtyuomzeroMsg = A UDM de quantidade do custo/pre\u00e7o anexado \u00e0 SKU est\u00e1 desabilitada.
Validation.skucostcurrencyuomzeroMsg = A UDM de moeda do custo/pre\u00e7o anexado \u00e0 SKU est\u00e1 desabilitada.
Validation.rescostdisabledMsg = O custo/pre\u00e7o anexado ao recurso est\u00e1 desabilitado. O custo n\u00e3o ser\u00e1 anexado ao recurso.
Validation.rescostqtyuomzeroMsg = A UDM de quantidade do custo/pre\u00e7o anexado ao recurso est\u00e1 desabilitada.
Validation.rescostcurrencyuomzeroMsg = A UDM de moeda do custo/pre\u00e7o anexado ao recurso est\u00e1 desabilitada.
Validation.sourcingcostdisabledMsg = O custo/pre\u00e7o anexado ao processo de movimenta\u00e7\u00e3o est\u00e1 desabilitado. O custo n\u00e3o ser\u00e1 anexado ao processo de movimenta\u00e7\u00e3o.
Validation.sourcingcostqtyuomzeroMsg = A UDM de quantidade do custo/pre\u00e7o anexado ao processo de movimenta\u00e7\u00e3o est\u00e1 desabilitada.
Validation.sourcingcostcurrencyuomzeroMsg = A UDM de moeda do custo/pre\u00e7o anexado ao processo de movimenta\u00e7\u00e3o est\u00e1 desabilitada.
Validation.setupcostdisabledMsg = O custo/pre\u00e7o anexado \u00e0 configura\u00e7\u00e3o est\u00e1 desabilitado. O custo n\u00e3o ser\u00e1 anexado \u00e0 configura\u00e7\u00e3o.
Validation.setupcostqtyuomzeroMsg = A UDM de quantidade do custo/pre\u00e7o anexado \u00e0 configura\u00e7\u00e3o est\u00e1 desabilitada.
Validation.setsupcostcurrencyuomzeroMsg = A UDM de moeda do custo/pre\u00e7o anexado \u00e0 configura\u00e7\u00e3o est\u00e1 desabilitada.


#Messages from the Optimizer
Optimizer.Primal = Primitivo
Optimizer.Dual = Duplo
Optimizer.Barrier = Barreira
Optimizer.Network = Rede
Optimizer.Auto = Auto
Optimizer.Sifting = Triagem
Optimizer.AlgorithmUsed = Resolvendo usando o algoritmo {0}.
Optimizer.JobCancelled = A otimiza\u00e7\u00e3o n\u00e3o foi conclu\u00edda.  O usu\u00e1rio cancelou o processo.
Optimizer.ModelStatistics = O modelo cont\u00e9m {0} restri\u00e7\u00f5es, {1} vari\u00e1veis ({2} bin\u00e1rio) e {3} coeficientes diferentes de zero.
Optimizer.NoFeasibleSolution = O otimizador de produ\u00e7\u00e3o e fornecimento n\u00e3o encontrou uma solu\u00e7\u00e3o vi\u00e1vel.
Optimizer.RunningInfeasibilityFinder = Procurando inviabilidades no modelo.
Optimizer.RelaxedMIPIsFeasible = O modelo inicial de MIP \u00e9 invi\u00e1vel, mas o problema relaxado \u00e9 vi\u00e1vel.  N\u00e3o \u00e9 poss\u00edvel recuperar as restri\u00e7\u00f5es invi\u00e1veis.
Optimizer.LPIsFeasible = O modelo inicial \u00e9 invi\u00e1vel, mas vi\u00e1vel com a resolu\u00e7\u00e3o.
Optimizer.FeasibleSolution = O otimizador de produ\u00e7\u00e3o e fornecimento foi conclu\u00eddo com \u00eaxito.
Optimizer.ReachedTimeLim = Limite de tempo de solu\u00e7\u00e3o atingido.
Optimizer.UnboundedSolution =  O modelo \u00e9 ilimitado. Se estiver maximizando os lucros, defina a demanda m\u00e1xima para INFLEX\u00cdVEL ou adicione restri\u00e7\u00f5es para limitar a produ\u00e7\u00e3o.
Optimizer.UnboundedVariable =  O modelo \u00e9 invi\u00e1vel ou est\u00e1 desatualizado.  H\u00e1 um problema com a vari\u00e1vel {0}.
Optimizer.FinalMIPGap = O intervalo final de MIP \u00e9 {0}.
Optimizer.FinalObjectiveValue = O valor do objetivo final \u00e9 {0}.
Optimizer.ModelConditionNumber = O n\u00famero da condi\u00e7\u00e3o (medida da qualidade num\u00e9rica da solu\u00e7\u00e3o) \u00e9 {0}.
Optimizer.CondNumUnavailable = N\u00e3o foi poss\u00edvel obter o n\u00famero da condi\u00e7\u00e3o da solu\u00e7\u00e3o, provavelmente devido ao algoritmo raiz.
Optimizer.CPLEXOutputToFile = Gravando sa\u00edda CPLEX no arquivo {0}.
Optimizer.CannotWriteCPLEXOutput = N\u00e3o \u00e9 poss\u00edvel gravar a sa\u00edda no arquivo {0}.  A sa\u00edda CPLEX n\u00e3o ser\u00e1 gravada.
Optimizer.SKUMetricTblWritten = Sa\u00edda gravada na tabela SKUMetric
Optimizer.SKUMetricTblNotWritten = N\u00e3o h\u00e1 sa\u00eddas para a tabela SKUMetric.
Optimizer.ProdMetricTblWritten = Sa\u00edda gravada na tabela ProductionMetric
Optimizer.ProdMetricTblNotWritten = N\u00e3o h\u00e1 sa\u00eddas para a tabela ProductionMetric.
Optimizer.ScngMetricTblWritten = Sa\u00edda gravada na tabela SourcingMetric
Optimizer.ScngMetricTblNotWritten = N\u00e3o h\u00e1 sa\u00eddas para a tabela SourcingMetric.
Optimizer.ResMetricTblWritten = Sa\u00edda gravada na tabela ResMetric
Optimizer.ResMetricTblNotWritten = N\u00e3o h\u00e1 sa\u00eddas para a tabela ResMetric.
Optimizer.ProdResMetricTblWritten = Sa\u00edda gravada na tabela ProductionResMetric
Optimizer.ProdResMetricTblNotWritten = N\u00e3o h\u00e1 sa\u00eddas para a tabela ProductionResMetric.
Optimizer.SrcResMetricTblWritten = Sa\u00edda gravada na tabela SourcingResMetric
Optimizer.SrcResMetricTblNotWritten = N\u00e3o h\u00e1 sa\u00eddas para a tabela SourcingResMetric.
Optimizer.SKUIndDmdWritten = Sa\u00edda da demanda independente da SKU gravada na tabela SKUMetric
Optimizer.SKUIndDmdNotWritten = N\u00e3o h\u00e1 demanda independente da SKU para a tabela SKUMetric.
Optimizer.BasisTblWritten = Sa\u00edda gravada na tabela Base
Optimizer.BasisTblNotWritten = N\u00e3o h\u00e1 sa\u00eddas para a tabela Base.
Optimizer.ScngSplitPctWritten = Sa\u00edda da porcentagem de divis\u00e3o de fornecimento gravada na tabela SourcingMetric
Optimizer.ScngSplitPctNotWritten = N\u00e3o h\u00e1 porcentagem de divis\u00e3o do fornecimento para a tabela SourcingMetric.
Optimizer.ProdSplitPctWritten = Sa\u00edda da porcentagem da divis\u00e3o da produ\u00e7\u00e3o gravada na tabela ProductionMetric
Optimizer.ProdSplitPctNotWritten = N\u00e3o h\u00e1 porcentagem da divis\u00e3o da produ\u00e7\u00e3o para a tabela ProductionMetric.
Optimizer.ModelStatistics = Estat\u00edsticas do modelo:
Optimizer.NumOfConstraints =  N\u00famero de restri\u00e7\u00f5es:
Optimizer.NumOfVariables = N\u00famero de vari\u00e1veis:
Optimizer.NumOfNon-ZeroCoefficients =  N\u00famero de coeficientes diferentes de zero: 

#Setup Validation
Validation.SetupCurrUomNoConversion = Nenhuma convers\u00e3o da UDM de moeda da configura\u00e7\u00e3o para a UDM da moeda padr\u00e3o do modelo.

#Messages for Infeasibilities
Infeasibility.ErrorGettingConflict = Erro ao obter o conflito.
Infeasibility.ErrorRefiningConflict = Erro ao refinar o conflito.
Infeasibility.ConflictCannotBeRefined = O conflito n\u00e3o pode ser refinado.
Infeasibility.SKU = Inviabilidade da SKU. {0} {1}
Infeasibility.SKUWith_Time_Period_Without_Tier = Inviabilidade da SKU. {0} {1} para o per\u00edodo de tempo {2}
Infeasibility.SKUWithout_Time_Period_With_Tier = Inviabilidade da SKU. {0} {1} para a camada {2}
Infeasibility.SKUWith_Time_Period_With_Tier = Inviabilidade da SKU. {0} {1} para o per\u00edodo de tempo {2} na camada {3}
Infeasibility.SKUInfSplySw = A SKU do fornecedor {0} em {1} tem seu InfiniteSupplySw definido como 0.
Infeasibility.Resource = Inviabilidade do recurso. {0} {1}
Infeasibility.ResourceWith_Time_Period_Without_Tier = Inviabilidade do recurso. {0} {1} para o per\u00edodo de tempo {2}
Infeasibility.ResourceWithout_Time_Period_With_Tier = Inviabilidade do recurso. {0} {1} para a camada {2}
Infeasibility.ResourceWith_Time_Period_With_Tier = Inviabilidade do recurso. {0} {1} para o per\u00edodo de tempo {2} na camada {3}
Infeasibility.Prod = Inviabilidade da produ\u00e7\u00e3o. {0} m\u00e9todo de produ\u00e7\u00e3o {1}
Infeasibility.ProdWith_Time_Period_Without_Tier = Inviabilidade da produ\u00e7\u00e3o. {0} m\u00e9todo de produ\u00e7\u00e3o {1} para o per\u00edodo de tempo {2}
Infeasibility.ProdWithout_Time_Period_With_Tier = Inviabilidade da produ\u00e7\u00e3o. {0} m\u00e9todo de produ\u00e7\u00e3o {1} da camada {2}
Infeasibility.ProdWith_Time_Period_With_Tier = Inviabilidade da produ\u00e7\u00e3o. {0} m\u00e9todo de produ\u00e7\u00e3o {1} para o per\u00edodo de tempo {2} da camada {3}
Infeasibility.Sourcing = Inviabilidade de fornecimento. {0} {1}
Infeasibility.SourcingWith_Time_Period_Without_Tier = Inviabilidade de fornecimento. {0} m\u00e9todo de fornecimento {1} para o per\u00edodo de tempo {2}
Infeasibility.SourcingWithout_Time_Period_With_Tier = Inviabilidade de fornecimento. {0} m\u00e9todo de fornecimento {1} da camada {2}
Infeasibility.SourcingWith_Time_Period_With_Tier = Inviabilidade de fornecimento. {0} m\u00e9todo de fornecimento {1} para o per\u00edodo de tempo {2} da camada {3}
Infeasibility.Setup = Inviabilidade de configura\u00e7\u00e3o. {0} {1}
Infeasibility.SetupWith_Time_Period_Without_Tier = Inviabilidade de configura\u00e7\u00e3o. {0} {1} para o per\u00edodo de tempo {2}
Infeasibility.SetupWithout_Time_Period_With_Tier = Inviabilidade de configura\u00e7\u00e3o. {0} {1} para a camada {2}
Infeasibility.SetupWith_Time_Period_With_Tier = Inviabilidade de configura\u00e7\u00e3o. {0} {1} para o per\u00edodo de tempo {2} na camada {3}
Infeasibility.Default = Inviabilidade padr\u00e3o. {0} inst\u00e2ncia {1}
Infeasibility.DefaultWith_Time_Period_Without_Tier = Inviabilidade padr\u00e3o. {0} inst\u00e2ncia {1} para o per\u00edodo de tempo {2}
Infeasibility.DefaultWithout_Time_Period_With_Tier = Inviabilidade padr\u00e3o. {0} inst\u00e2ncia {1} para a camada {2}
Infeasibility.DefaultWith_Time_Period_With_Tier = Inviabilidade padr\u00e3o. {0} inst\u00e2ncia {1} para o per\u00edodo de tempo {2} na camada {3}

Infeasibility.IsPartOfConflict = \u00e9 parte do conflito.
Infeasibility.MayBePartOfConflict = pode ser parte do conflito.
Infeasibility.SkuBalanceConstrString = Equa\u00e7\u00e3o do saldo da SKU para 
Infeasibility.SSConstrString = Restri\u00e7\u00e3o do estoque de seguran\u00e7a da SKU para 
Infeasibility.TgtOHConstrString = Restri\u00e7\u00e3o de disponibilidade de destino da SKU para 
Infeasibility.MaxOHConstrString = Restri\u00e7\u00e3o de m\u00e1ximo dispon\u00edvel da SKU para 
Infeasibility.IFConstrString = Equa\u00e7\u00e3o do fluxo de entrada da SKU para 
Infeasibility.IFMinConstrString = Restri\u00e7\u00e3o m\u00ednima do fluxo de entrada da SKU para  
Infeasibility.IFMaxConstrString = Restri\u00e7\u00e3o m\u00e1xima do fluxo de entrada da SKU para  
Infeasibility.OFConstrString = Equa\u00e7\u00e3o do fluxo de sa\u00edda da SKU para 
Infeasibility.OFMinConstrString = Restri\u00e7\u00e3o m\u00ednima do fluxo de sa\u00edda da SKU para  
Infeasibility.OFMaxConstrStraxg = Restri\u00e7\u00e3o m\u00e1xima do fluxo de sa\u00edda da SKU para  
Infeasibility.SrcSpltCptConstrString = Restri\u00e7\u00e3o de porcentagem de divis\u00e3o de fornecimento para 
Infeasibility.ProdSpltCptConstrString = Restri\u00e7\u00e3o de porcentagem de divis\u00e3o de produ\u00e7\u00e3o para 
Infeasibility.IndDmdConstrString = Restri\u00e7\u00e3o da demanda independente para 
Infeasibility.MaxIndDmdConstrString = Restri\u00e7\u00e3o m\u00e1xima da demanda independente para 
Infeasibility.ResUtilConstrString = Equa\u00e7\u00e3o de utiliza\u00e7\u00e3o de recursos para 
Infeasibility.ResMinConstrString = Restri\u00e7\u00e3o m\u00ednima de utiliza\u00e7\u00e3o de recursos para 
Infeasibility.ResMaxConstrString = Restri\u00e7\u00e3o m\u00e1xima de utiliza\u00e7\u00e3o de recursos para 
Infeasibility.RampUpConstrString = Restri\u00e7\u00e3o de progress\u00e3o de recursos para 
Infeasibility.RampDownConstrString = Restri\u00e7\u00e3o de regress\u00e3o de recursos para 
Infeasibility.MaxSrcgConstrString = Restri\u00e7\u00e3o m\u00e1xima de fornecimento para 
Infeasibility.MinSrcgConstrString = Restri\u00e7\u00e3o m\u00ednima de fornecimento para 
Infeasibility.sgLocMaxConstrString = Restri\u00e7\u00e3o m\u00e1xima de locais de fornecimento para 
Infeasibility.sgLocMinConstrString = Restri\u00e7\u00e3o m\u00ednima de locais de fornecimento para 
Infeasibility.sgProdProcMaxConstrString = Restri\u00e7\u00e3o m\u00e1xima de processos de produ\u00e7\u00e3o para 
Infeasibility.sgProdProcMinConstrString = Restri\u00e7\u00e3o m\u00ednima de processos de produ\u00e7\u00e3o para 
Infeasibility.sgSrcngMaxConstrString = Restri\u00e7\u00e3o m\u00e1xima de processos de fornecimento para 
Infeasibility.sgSrcngMinConstrString = Restri\u00e7\u00e3o m\u00ednima de processos de fornecimento para 
Infeasibility.SkuTierUBConstrString = Restri\u00e7\u00e3o do limite superior da camada de SKU de TV para 
Infeasibility.SkuTierLBConstrString = Restri\u00e7\u00e3o do limite inferior da camada de SKU de TV para 
Infeasibility.SkuTierBinConstrString = Restri\u00e7\u00e3o bin\u00e1ria da camada de SKU de TV para 
Infeasibility.SkuTVPIConstrString = Restri\u00e7\u00e3o da interse\u00e7\u00e3o de planejamento da camada de SKU de TV para 
Infeasibility.SkuTVAIConstrString = Restri\u00e7\u00e3o da interse\u00e7\u00e3o de acumula\u00e7\u00e3o da camada de SKU de TV para 
Infeasibility.SkuTVPAConstrString = Restri\u00e7\u00e3o da acumula\u00e7\u00e3o de planejamento da camada de SKU de TV para 
Infeasibility.SkuTVClosedTierConstrString = Restri\u00e7\u00e3o de camada fechada de SKU de TV para 
Infeasibility.ResTierUBConstrString = Restri\u00e7\u00e3o do limite superior da camada de recurso de TV para 
Infeasibility.ResTierLBConstrString = Restri\u00e7\u00e3o do limite inferior da camada de recurso de TV para 
Infeasibility.ResTierBinConstrString = Restri\u00e7\u00e3o bin\u00e1ria da camada de recurso de TV para 
Infeasibility.ResTVPIConstrString = Restri\u00e7\u00e3o da interse\u00e7\u00e3o de planejamento da camada de recurso de TV para 
Infeasibility.ResTVAIConstrString = Restri\u00e7\u00e3o da interse\u00e7\u00e3o de acumula\u00e7\u00e3o da camada de recurso de TV para 
Infeasibility.ResTVPAConstrString = Restri\u00e7\u00e3o da acumula\u00e7\u00e3o de planejamento da camada de recurso de TV para 
Infeasibility.ResTVClosedTierConstrString = Restri\u00e7\u00e3o de camada fechada de recurso de TV para 
Infeasibility.ProcTierUBConstrString = Restri\u00e7\u00e3o do limite superior da camada de processo de TV para 
Infeasibility.ProcTierLBConstrString = Restri\u00e7\u00e3o do limite inferior da camada de processo de TV para 
Infeasibility.ProcTierBinConstrString = Restri\u00e7\u00e3o bin\u00e1ria da camada de processo de TV para 
Infeasibility.ProcTVPIConstrString = Restri\u00e7\u00e3o da interse\u00e7\u00e3o de planejamento da camada de processo de TV para 
Infeasibility.ProcTVAIConstrString = Restri\u00e7\u00e3o da interse\u00e7\u00e3o de acumula\u00e7\u00e3o da camada de processo de TV para 
Infeasibility.ProcTVPAConstrString = Restri\u00e7\u00e3o da acumula\u00e7\u00e3o de planejamento da camada de processo de TV para 
Infeasibility.ProcTVClosedTierConstrString = Restri\u00e7\u00e3o de camada fechada de processo de TV para 
Infeasibility.GrpTierUBConstrString = Restri\u00e7\u00e3o do limite superior da camada de grupo de TV para 
Infeasibility.GrpTierLBConstrString = Restri\u00e7\u00e3o do limite inferior da camada de grupo de TV para 
Infeasibility.GrpTierBinConstrString = Restri\u00e7\u00e3o bin\u00e1ria da camada de grupo de TV para 
Infeasibility.GrpTVPIConstrString = Restri\u00e7\u00e3o da interse\u00e7\u00e3o de planejamento da camada de grupo de TV para 
Infeasibility.GrpTVAIConstrString = Restri\u00e7\u00e3o da interse\u00e7\u00e3o de acumula\u00e7\u00e3o da camada de grupo de TV para 
Infeasibility.GrpTVPAConstrString = Restri\u00e7\u00e3o da acumula\u00e7\u00e3o de planejamento da camada de grupo de TV para 
Infeasibility.GrpTVClosedTierConstrString = Restri\u00e7\u00e3o de camada fechada de grupo de TV para 
Infeasibility.SchOHConstrString = Restri\u00e7\u00e3o de dispon\u00edvel programado da SKU para 
Infeasibility.IOHConstrString = Restri\u00e7\u00e3o de dispon\u00edvel inicial da SKU para 
Infeasibility.GrpUtilAEqPConstrString = Restri\u00e7\u00e3o de acumula\u00e7\u00e3o de utiliza\u00e7\u00e3o de grupo de TV para 
Infeasibility.ResUBConstrString = Restri\u00e7\u00e3o de limite superior de recurso para 
Infeasibility.SrcngUBConstrString = Restri\u00e7\u00e3o de limite superior de fornecimento para 
Infeasibility.ProdUBConstrString = Restri\u00e7\u00e3o de limite superior de produ\u00e7\u00e3o para 
Infeasibility.StpPrdUBConstrString = Limite superior de produ\u00e7\u00e3o do grupo de configura\u00e7\u00e3o para 
Infeasibility.StpPrdLBConstrString = Limite inferior de produ\u00e7\u00e3o do grupo de configura\u00e7\u00e3o para 
Infeasibility.StpResDurStUBConstrString = Limite superior do in\u00edcio da dura\u00e7\u00e3o do grupo de configura\u00e7\u00e3o para 
Infeasibility.StpResDurStLBConstrString = Limite inferior do in\u00edcio da dura\u00e7\u00e3o do grupo de configura\u00e7\u00e3o para 
Infeasibility.StpUBConstrString = Limite superior de configura\u00e7\u00e3o para 
Infeasibility.StpLBConstrString = Limite inferior de configura\u00e7\u00e3o para 
Infeasibility.StpMinSvdConstrString = M\u00ednima configura\u00e7\u00e3o salva para 
Infeasibility.StpUsdResPrConstrString = Configura\u00e7\u00e3o usada antes de 
Infeasibility.SrcLotSzConstrString = Tamanho do lote de fornecimento 
Infeasibility.SrcExcsUBConstrString = Limite superior de fornecimento 
Infeasibility.ProdLotSzConstrString = Tamanho do lote do m\u00e9todo de produ\u00e7\u00e3o 
Infeasibility.ProdExcsUBConstrString = Limite superior do m\u00e9todo de produ\u00e7\u00e3o 

SCPOWeb.Strategy.enterOptionName = Digite o nome da op\u00e7\u00e3o
SCPOWeb.Strategy.enterOptionValue = Digite o valor da op\u00e7\u00e3o
SCPOWeb.Strategy.removeOption = Selecione uma op\u00e7\u00e3o para remover

# For SRE Job Output on ProcessManager UI and Process Status Popup
JobOutputKey = {0}

StatusPopupOutput = Sa\u00edda do otimizador

#Writing Projections and Statistics for SKU and Resource

Strategy.WriteProj.Duration=Dura\u00e7\u00e3o
Strategy.WriteProj.PLAInstance=Inst\u00e2ncia de an\u00e1lise do plano
Strategy.WriteProj.SKUProjection=Proje\u00e7\u00f5es de SKUs
Strategy.WriteProj.SKUStatistics=Estat\u00edsticas de SKU
Strategy.WriteProj.ResProjection=Proje\u00e7\u00f5es de recursos
Strategy.WriteProj.ResStatistics=Estat\u00edsticas de recursos
Strategy.WriteProj.StartKeyword=Palavra-chave de in\u00edcio
Strategy.WriteProj.StartKeywordOffset=Deslocamento de palavra-chave de in\u00edcio
Strategy.WriteProj.InvalidDaysEntry=O valor num\u00e9rico de dias n\u00e3o deve ter um + ou um -. Use o deslocamento para ele.
Strategy.WriteProj.Negative=O valor da dura\u00e7\u00e3o n\u00e3o pode ser negativo.

# Validations
Validation.NoPLAInstance=A inst\u00e2ncia de an\u00e1lise do plano \u00e9 nula.
WriteProj.Null={0} n\u00e3o pode estar vazio.
WriteProj.ParseInt=N\u00famero inteiro inv\u00e1lido especificado para {0}.
WriteProj.Nil.Selection=Selecione as proje\u00e7\u00f5es ou estat\u00edsticas baseadas em SKU ou recursos para iniciar o processo.
Error.InvalidDate= Formato {0} inv\u00e1lido informado.

### Optimizer Status Window resources
ModelStatistics=Estat\u00edsticas do modelo:
NumberOfConstraints=    N\u00famero de restri\u00e7\u00f5es:
NumberOfVariables=    N\u00famero de vari\u00e1veis:
NumberOfNonZeroCoefficients=    N\u00famero de coeficientes diferentes de zero:
PrimalSolve=Solu\u00e7\u00e3o primitiva:
DualSolve=Solu\u00e7\u00e3o dupla:
NetworkSolve=Solu\u00e7\u00e3o de rede:
BarrierSolve=Solu\u00e7\u00e3o de barreira:
Iteration=Itera\u00e7\u00e3o:
Objective=Objetivo:

# Fatals
servlet.log.fatal.internalerror=Erro interno:

# Warnings
servlet.log.warning.nolastmodified=\u00daltima modifica\u00e7\u00e3o lida como 0 para {0}
servlet.log.warning.notimestamp=Carimbo de data/hora lido como 0 para {0}. Usando \u00faltima modifica\u00e7\u00e3o em seu lugar
servlet.log.warning.missing-file=Refer\u00eancia para o arquivo n\u00e3o existente ({0}) em {1}
servlet.log.warning.xml.parsing=Erro ao analisar {0} na linha {1}: {2}
servlet.log.warning.xml.reading=Erro inesperado ao ler {0}:
servlet.log.warning.xml.missing-jnlp=Elemento de <jnlp-versions> ausente em {0}
servlet.log.warning.xml.missing-pattern=Elemento de <pattern> ausente em {0}
servlet.log.warning.xml.missing-elems=Atributo de <version-id> ou <file> ausente em {0}
servlet.log.warning.xml.missing-elems2=Atributo de <version-id>, <file> ou <product-version-id> ausente em {0}
servlet.log.warning.jardiff.failed=Falha ao gerar JarDiff para {0} {1}->{2}

# Informational
servlet.log.info.request=Solicita\u00e7\u00e3o: {0}
servlet.log.info.useragent=Agente do usu\u00e1rio: {0}
servlet.log.info.goodrequest=Recurso retornado: {0}
servlet.log.info.badrequest=C\u00f3digo de erro retornado para a solicita\u00e7\u00e3o: {0}
servlet.log.scandir=Nova verifica\u00e7\u00e3o de diret\u00f3rio: {0}
servlet.log.info.jardiff.response=JarDiff retornado para a solicita\u00e7\u00e3o
servlet.log.info.jardiff.gen=Gerando JarDiff para {0} {1}->{2}
    	
# JNLP Error strings
servlet.jnlp.err.10 = N\u00e3o foi poss\u00edvel localizar o recurso
servlet.jnlp.err.11 = N\u00e3o foi poss\u00edvel localizar a vers\u00e3o solicitada
servlet.jnlp.err.20 = Sistema operacional n\u00e3o suportado
servlet.jnlp.err.21 = Arquitetura n\u00e3o suportada
servlet.jnlp.err.22 = Local n\u00e3o suportado
servlet.jnlp.err.23 = Vers\u00e3o do JRE n\u00e3o suportada
servlet.jnlp.err.99 = Erro desconhecido    


# Integration
Strategy.Integration.Duration = Dura\u00e7\u00e3o
Strategy.Integration.Calendar = Nome do calend\u00e1rio
Strategy.Integration.StartKeyword = Palavra-chave de in\u00edcio
Strategy.Integration.StartKeywordOffset = Deslocamento de palavra-chave de in\u00edcio
Strategy.Integration.StartKeywordRule = Regra da palavra-chave de in\u00edcio
Strategy.Integration.StartDate = Data de in\u00edcio
Strategy.Integration.Policy = Pol\u00edtica de restri\u00e7\u00e3o
Strategy.Integration.Colon = :

Strategy.Integration.ToScenario = Cen\u00e1rio de destino
Strategy.Integration.IndepedentDemand = Demanda independente
Strategy.Integration.SafetyStock = Estoque de seguran\u00e7a
Strategy.Integration.AvgStock = Estoque m\u00e9dio
Strategy.Integration.Capacity = Capacidade
Strategy.Integration.Production = Quantidade de produ\u00e7\u00e3o otimizada
Strategy.Integration.Inventory = Estoque
Strategy.Integration.ScheduledOrder = Pedido programado
Strategy.Integration.SchedRecptConstr = Recebimento programado
Strategy.Integration.PurchaseOrder = Ordem de Compra
Strategy.Integration.VehicleLoadLine = Rota de carga do ve\u00edculo
Strategy.Integration.Sourcingsw = Quantidade de fornecimento otimizada
Strategy.Integration.InputTVQ = Dados de entrada
Strategy.Integration.OutputTVQ = Dados de sa\u00edda
Strategy.Integration.RetainPastInvsw = Transfer\u00eancia de estoque al\u00e9m do vencimento
Strategy.Integration.RetainPastOrder = Transfer\u00eancia de recebimento agendado al\u00e9m do vencimento
Strategy.Integration.RetainPastVLL = Transfer\u00eancia de cargas de ve\u00edculo al\u00e9m do vencimento
Strategy.Integration.RetainPastPurchOrder = Transfer\u00eancia de pedidos de compra al\u00e9m do vencimento
Strategy.Integration.IPOPlanName = Nome do plano de IPO

Strategy.Integration.CheckBoxValidation = Selecione os dados de entrada a serem executados.
Strategy.Integration.CheckBoxValidationForOutput = Selecione os dados de sa\u00edda a serem executados.


# Distance Calculation
Strategy.DistanceCalculation.distUom = UDM da dist\u00e2ncia

Strategy.integration.error.negative=O valor {0} n\u00e3o pode ser negativo.
Strategy.integration.error.zero=O valor {0} n\u00e3o pode ser zero.
Strategy.integration.error.InvalidDaysEntry=O valor num\u00e9rico de dias n\u00e3o deve ter um + ou um -. Use o deslocamento para ele.
Strategy.integration.error.InvalidDate=Formato {0} inv\u00e1lido informado.
Strategy.integration.error.null={0} n\u00e3o pode estar vazio.
Strategy.integration.error.fraction={0} n\u00e3o pode ser um valor em fra\u00e7\u00e3o. Digite um n\u00famero inteiro positivo.
